{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "db6a6d85-4ba4-438b-944e-b811120df13a",
   "metadata": {},
   "source": [
    "<div class=\"alert alert-block alert-success\">\n",
    "    <h1>\n",
    "        Example notebook - Healthcare\n",
    "    </h1>\n",
    "    <p>\n",
    "        Link to dataset : <a href=\"https://www.kaggle.com/datasets/prasad22/healthcare-dataset\">Kaggle link</a>\n",
    "    </p>\n",
    "</div>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "34b987fa-2bdf-452b-8ee5-0ca12f5e3dff",
   "metadata": {},
   "source": [
    "# Import modules and functions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "035ac6b2-334d-441b-93e2-8ea3debe6bcc",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import pandas as pd\n",
    "import re\n",
    "import time\n",
    "from tqdm.auto import tqdm\n",
    "\n",
    "from turingdb_examples.utils import create_ID_column\n",
    "from turingdb_examples.graph import (\n",
    "    create_graph_from_df,\n",
    "    build_create_command_from_networkx,\n",
    "    split_cypher_commands\n",
    ")\n",
    "from turingdb_examples.llm import natural_language_to_cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "89befeed-7cad-4a97-b58b-29b107b6b792",
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext autoreload\n",
    "%autoreload 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a570fab2-fd5f-4582-b5bb-e4cf67d6f9e9",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e1968381-79ad-4712-a9c2-12a6e1928185",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "a47eab26-0c99-46ee-811e-f0e0f7948867",
   "metadata": {},
   "source": [
    "# Check data files are available"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "46ef15e4-2f4c-443d-80bb-f7b7a85b3612",
   "metadata": {},
   "outputs": [],
   "source": [
    "example_name = \"healthcare_dataset\"\n",
    "path_data = f\"{os.getcwd()}/data/{example_name}\"\n",
    "if not os.path.exists(path_data):\n",
    "    raise ValueError(f\"{path_data} does not exists\")\n",
    "\n",
    "filename = \"healthcare_dataset.csv\"\n",
    "list_csv_files = sorted(os.listdir(path_data))\n",
    "if filename not in list_csv_files:\n",
    "    raise ValueError(\n",
    "        f\"{filename} csv file is not available in {path_data}\"\n",
    "    )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "79dd284a-1bb1-4d29-a45d-914226d0ea3c",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7d2a3403-3541-4456-a664-789eb5d5477d",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "1a6ee38f-72d6-4329-a63f-cc5aa24c6879",
   "metadata": {},
   "source": [
    "# Import and format data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "8e4c11e7-15da-4b8d-bf2e-63c97ecb9d32",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Patient ID</th>\n",
       "      <th>Name</th>\n",
       "      <th>Age</th>\n",
       "      <th>Gender</th>\n",
       "      <th>Blood Type</th>\n",
       "      <th>Medical Condition</th>\n",
       "      <th>Date of Admission</th>\n",
       "      <th>Doctor</th>\n",
       "      <th>Hospital</th>\n",
       "      <th>Insurance Provider</th>\n",
       "      <th>Billing Amount</th>\n",
       "      <th>Room Number</th>\n",
       "      <th>Admission Type</th>\n",
       "      <th>Discharge Date</th>\n",
       "      <th>Medication</th>\n",
       "      <th>Test Results</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>00000</td>\n",
       "      <td>Bobby JACKSON</td>\n",
       "      <td>30</td>\n",
       "      <td>Male</td>\n",
       "      <td>B-</td>\n",
       "      <td>Cancer</td>\n",
       "      <td>2024-01-31</td>\n",
       "      <td>Matthew SMITH</td>\n",
       "      <td>Sons and Miller</td>\n",
       "      <td>Blue Cross</td>\n",
       "      <td>18856.281306</td>\n",
       "      <td>328</td>\n",
       "      <td>Urgent</td>\n",
       "      <td>2024-02-02</td>\n",
       "      <td>Paracetamol</td>\n",
       "      <td>Normal</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>00001</td>\n",
       "      <td>Leslie TERRY</td>\n",
       "      <td>62</td>\n",
       "      <td>Male</td>\n",
       "      <td>A+</td>\n",
       "      <td>Obesity</td>\n",
       "      <td>2019-08-20</td>\n",
       "      <td>Samantha DAVIES</td>\n",
       "      <td>Kim Inc</td>\n",
       "      <td>Medicare</td>\n",
       "      <td>33643.327287</td>\n",
       "      <td>265</td>\n",
       "      <td>Emergency</td>\n",
       "      <td>2019-08-26</td>\n",
       "      <td>Ibuprofen</td>\n",
       "      <td>Inconclusive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>00002</td>\n",
       "      <td>Danny SMITH</td>\n",
       "      <td>76</td>\n",
       "      <td>Female</td>\n",
       "      <td>A-</td>\n",
       "      <td>Obesity</td>\n",
       "      <td>2022-09-22</td>\n",
       "      <td>Tiffany MITCHELL</td>\n",
       "      <td>Cook PLC</td>\n",
       "      <td>Aetna</td>\n",
       "      <td>27955.096079</td>\n",
       "      <td>205</td>\n",
       "      <td>Emergency</td>\n",
       "      <td>2022-10-07</td>\n",
       "      <td>Aspirin</td>\n",
       "      <td>Normal</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>00003</td>\n",
       "      <td>Andrew WATTS</td>\n",
       "      <td>28</td>\n",
       "      <td>Female</td>\n",
       "      <td>O+</td>\n",
       "      <td>Diabetes</td>\n",
       "      <td>2020-11-18</td>\n",
       "      <td>Kevin WELLS</td>\n",
       "      <td>Hernandez Rogers and Vang,</td>\n",
       "      <td>Medicare</td>\n",
       "      <td>37909.782410</td>\n",
       "      <td>450</td>\n",
       "      <td>Elective</td>\n",
       "      <td>2020-12-18</td>\n",
       "      <td>Ibuprofen</td>\n",
       "      <td>Abnormal</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>00004</td>\n",
       "      <td>Adrienne BELL</td>\n",
       "      <td>43</td>\n",
       "      <td>Female</td>\n",
       "      <td>AB+</td>\n",
       "      <td>Cancer</td>\n",
       "      <td>2022-09-19</td>\n",
       "      <td>Kathleen HANNA</td>\n",
       "      <td>White-White</td>\n",
       "      <td>Aetna</td>\n",
       "      <td>14238.317814</td>\n",
       "      <td>458</td>\n",
       "      <td>Urgent</td>\n",
       "      <td>2022-10-09</td>\n",
       "      <td>Penicillin</td>\n",
       "      <td>Abnormal</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4995</th>\n",
       "      <td>04995</td>\n",
       "      <td>Marcus LONG</td>\n",
       "      <td>41</td>\n",
       "      <td>Female</td>\n",
       "      <td>AB+</td>\n",
       "      <td>Hypertension</td>\n",
       "      <td>2023-02-12</td>\n",
       "      <td>Melissa DUNCAN</td>\n",
       "      <td>and Mosley, Williams Russell</td>\n",
       "      <td>Aetna</td>\n",
       "      <td>10769.289595</td>\n",
       "      <td>177</td>\n",
       "      <td>Urgent</td>\n",
       "      <td>2023-03-02</td>\n",
       "      <td>Penicillin</td>\n",
       "      <td>Inconclusive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4996</th>\n",
       "      <td>04996</td>\n",
       "      <td>Bethany GUZMAN</td>\n",
       "      <td>77</td>\n",
       "      <td>Male</td>\n",
       "      <td>AB+</td>\n",
       "      <td>Arthritis</td>\n",
       "      <td>2020-01-18</td>\n",
       "      <td>Mr. OSCAR</td>\n",
       "      <td>Rodriguez Inc</td>\n",
       "      <td>UnitedHealthcare</td>\n",
       "      <td>5500.283823</td>\n",
       "      <td>490</td>\n",
       "      <td>Elective</td>\n",
       "      <td>2020-02-08</td>\n",
       "      <td>Paracetamol</td>\n",
       "      <td>Inconclusive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4997</th>\n",
       "      <td>04997</td>\n",
       "      <td>Deborah MACDONALD</td>\n",
       "      <td>85</td>\n",
       "      <td>Female</td>\n",
       "      <td>O+</td>\n",
       "      <td>Arthritis</td>\n",
       "      <td>2019-09-05</td>\n",
       "      <td>Cathy SWANSON</td>\n",
       "      <td>Calderon and Sons</td>\n",
       "      <td>UnitedHealthcare</td>\n",
       "      <td>5153.940251</td>\n",
       "      <td>499</td>\n",
       "      <td>Urgent</td>\n",
       "      <td>2019-09-21</td>\n",
       "      <td>Paracetamol</td>\n",
       "      <td>Inconclusive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4998</th>\n",
       "      <td>04998</td>\n",
       "      <td>Dr. ANA</td>\n",
       "      <td>28</td>\n",
       "      <td>Male</td>\n",
       "      <td>O+</td>\n",
       "      <td>Cancer</td>\n",
       "      <td>2022-11-03</td>\n",
       "      <td>Kathryn DAVIS</td>\n",
       "      <td>LLC Jensen</td>\n",
       "      <td>UnitedHealthcare</td>\n",
       "      <td>5260.553923</td>\n",
       "      <td>115</td>\n",
       "      <td>Elective</td>\n",
       "      <td>2022-11-20</td>\n",
       "      <td>Ibuprofen</td>\n",
       "      <td>Inconclusive</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4999</th>\n",
       "      <td>04999</td>\n",
       "      <td>David OLSEN</td>\n",
       "      <td>41</td>\n",
       "      <td>Male</td>\n",
       "      <td>A-</td>\n",
       "      <td>Cancer</td>\n",
       "      <td>2020-10-13</td>\n",
       "      <td>Michael HARRIS</td>\n",
       "      <td>Russell-Knight</td>\n",
       "      <td>Blue Cross</td>\n",
       "      <td>6850.203900</td>\n",
       "      <td>118</td>\n",
       "      <td>Emergency</td>\n",
       "      <td>2020-10-30</td>\n",
       "      <td>Aspirin</td>\n",
       "      <td>Inconclusive</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5000 rows × 16 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     Patient ID               Name  Age  Gender Blood Type Medical Condition  \\\n",
       "0         00000      Bobby JACKSON   30    Male         B-            Cancer   \n",
       "1         00001       Leslie TERRY   62    Male         A+           Obesity   \n",
       "2         00002        Danny SMITH   76  Female         A-           Obesity   \n",
       "3         00003       Andrew WATTS   28  Female         O+          Diabetes   \n",
       "4         00004      Adrienne BELL   43  Female        AB+            Cancer   \n",
       "...         ...                ...  ...     ...        ...               ...   \n",
       "4995      04995        Marcus LONG   41  Female        AB+      Hypertension   \n",
       "4996      04996     Bethany GUZMAN   77    Male        AB+         Arthritis   \n",
       "4997      04997  Deborah MACDONALD   85  Female         O+         Arthritis   \n",
       "4998      04998            Dr. ANA   28    Male         O+            Cancer   \n",
       "4999      04999        David OLSEN   41    Male         A-            Cancer   \n",
       "\n",
       "     Date of Admission            Doctor                      Hospital  \\\n",
       "0           2024-01-31     Matthew SMITH               Sons and Miller   \n",
       "1           2019-08-20   Samantha DAVIES                       Kim Inc   \n",
       "2           2022-09-22  Tiffany MITCHELL                      Cook PLC   \n",
       "3           2020-11-18       Kevin WELLS    Hernandez Rogers and Vang,   \n",
       "4           2022-09-19    Kathleen HANNA                   White-White   \n",
       "...                ...               ...                           ...   \n",
       "4995        2023-02-12    Melissa DUNCAN  and Mosley, Williams Russell   \n",
       "4996        2020-01-18         Mr. OSCAR                 Rodriguez Inc   \n",
       "4997        2019-09-05     Cathy SWANSON             Calderon and Sons   \n",
       "4998        2022-11-03     Kathryn DAVIS                    LLC Jensen   \n",
       "4999        2020-10-13    Michael HARRIS                Russell-Knight   \n",
       "\n",
       "     Insurance Provider  Billing Amount  Room Number Admission Type  \\\n",
       "0            Blue Cross    18856.281306          328         Urgent   \n",
       "1              Medicare    33643.327287          265      Emergency   \n",
       "2                 Aetna    27955.096079          205      Emergency   \n",
       "3              Medicare    37909.782410          450       Elective   \n",
       "4                 Aetna    14238.317814          458         Urgent   \n",
       "...                 ...             ...          ...            ...   \n",
       "4995              Aetna    10769.289595          177         Urgent   \n",
       "4996   UnitedHealthcare     5500.283823          490       Elective   \n",
       "4997   UnitedHealthcare     5153.940251          499         Urgent   \n",
       "4998   UnitedHealthcare     5260.553923          115       Elective   \n",
       "4999         Blue Cross     6850.203900          118      Emergency   \n",
       "\n",
       "     Discharge Date   Medication  Test Results  \n",
       "0        2024-02-02  Paracetamol        Normal  \n",
       "1        2019-08-26    Ibuprofen  Inconclusive  \n",
       "2        2022-10-07      Aspirin        Normal  \n",
       "3        2020-12-18    Ibuprofen      Abnormal  \n",
       "4        2022-10-09   Penicillin      Abnormal  \n",
       "...             ...          ...           ...  \n",
       "4995     2023-03-02   Penicillin  Inconclusive  \n",
       "4996     2020-02-08  Paracetamol  Inconclusive  \n",
       "4997     2019-09-21  Paracetamol  Inconclusive  \n",
       "4998     2022-11-20    Ibuprofen  Inconclusive  \n",
       "4999     2020-10-30      Aspirin  Inconclusive  \n",
       "\n",
       "[5000 rows x 16 columns]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df = pd.read_csv(f\"{path_data}/healthcare_dataset.csv\")\n",
    "df[\"Name\"] = df[\"Name\"].apply(\n",
    "    lambda x: f\"{x.split(' ')[0].capitalize()} {x.split(' ')[1].upper()}\"\n",
    ")\n",
    "df[\"Doctor\"] = df[\"Doctor\"].apply(\n",
    "    lambda x: f\"{x.split(' ')[0].capitalize()} {x.split(' ')[1].upper()}\"\n",
    ")\n",
    "df = create_ID_column(df)\n",
    "# Keep only 10 patients to reduce graph for now\n",
    "# You can comment the following line to generate the whole graph\n",
    "df = df.iloc[:5000, :]\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "69dae8ed-545f-4269-98aa-a0202632db2f",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "93ac42d8-6b60-4cae-8990-92ccf6ec0d84",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "3f1787e0-e4dd-4e04-8e12-965153c061f6",
   "metadata": {},
   "source": [
    "# Create graph from dataframe"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "0b321b25-9e41-42af-beab-a5acd913884d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Resulting graph : DiGraph with 14571 nodes and 45000 edges\n"
     ]
    }
   ],
   "source": [
    "label_str = \"displayName\"\n",
    "\n",
    "G = create_graph_from_df(\n",
    "    df,\n",
    "    directed=True,\n",
    "    source_node_col={\"id\": \"Patient ID\", label_str: \"Name\", \"type\": \"Patient\"},\n",
    "    attributes_source_node_cols=[\"Age\", \"Date of Admission\", \"Discharge Date\"],\n",
    "    optional_nodes_cols={\n",
    "        \"Gender\": {\"link_to_source\": True, \"edge_type_to_source\": \"is\"},\n",
    "        \"Blood Type\": {\"link_to_source\": True, \"edge_type_to_source\": \"is\"},\n",
    "        \"Medical Condition\": {\"link_to_source\": True, \"edge_type_to_source\": \"has\"},\n",
    "        \"Doctor\": {\"link_to_source\": True, \"edge_type_to_source\": \"is_treated_by\"},\n",
    "        \"Hospital\": {\n",
    "            \"attributes\": [\"Room Number\"],\n",
    "            \"link_to_source\": True,\n",
    "            \"edge_type_to_source\": \"is_treated_in\",\n",
    "        },\n",
    "        \"Insurance Provider\": {\n",
    "            \"attributes\": [\"Billing Amount\"],\n",
    "            \"link_to_source\": True,\n",
    "            \"edge_type_to_source\": \"is_client_of\",\n",
    "        },\n",
    "        \"Admission Type\": {\"link_to_source\": True},\n",
    "        \"Medication\": {\n",
    "            \"link_to_source\": True,\n",
    "            \"edge_type_to_source\": \"took_medication\",\n",
    "        },\n",
    "        \"Test Results\": {\"link_to_source\": True, \"edge_type_to_source\": \"has_result\"},\n",
    "    },\n",
    ")\n",
    "print(f\"Resulting graph : {G}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "6cf91774-7ce2-43ba-82d3-2335fea6ed28",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('00000', {'displayName': 'Bobby JACKSON', 'type': 'Patient', 'Age': 30, 'Date of Admission': '2024-01-31', 'Discharge Date': '2024-02-02'})\n",
      "('Male', {'displayName': 'Male', 'type': 'Gender'})\n",
      "('B-', {'displayName': 'B-', 'type': 'Blood Type'})\n",
      "('Cancer', {'displayName': 'Cancer', 'type': 'Medical Condition'})\n",
      "('Matthew SMITH', {'displayName': 'Matthew SMITH', 'type': 'Doctor'})\n",
      "('Sons and Miller', {'displayName': 'Sons and Miller', 'type': 'Hospital', 'Room Number': 328})\n",
      "('Blue Cross', {'displayName': 'Blue Cross', 'type': 'Insurance Provider', 'Billing Amount': 18856.281305978155})\n",
      "('Urgent', {'displayName': 'Urgent', 'type': 'Admission Type'})\n",
      "('Paracetamol', {'displayName': 'Paracetamol', 'type': 'Medication'})\n",
      "('Normal', {'displayName': 'Normal', 'type': 'Test Results'})\n",
      "('00001', {'displayName': 'Leslie TERRY', 'type': 'Patient', 'Age': 62, 'Date of Admission': '2019-08-20', 'Discharge Date': '2019-08-26'})\n",
      "('A+', {'displayName': 'A+', 'type': 'Blood Type'})\n",
      "('Obesity', {'displayName': 'Obesity', 'type': 'Medical Condition'})\n",
      "('Samantha DAVIES', {'displayName': 'Samantha DAVIES', 'type': 'Doctor'})\n",
      "('Kim Inc', {'displayName': 'Kim Inc', 'type': 'Hospital', 'Room Number': 265})\n",
      "('Medicare', {'displayName': 'Medicare', 'type': 'Insurance Provider', 'Billing Amount': 33643.327286577885})\n",
      "('Emergency', {'displayName': 'Emergency', 'type': 'Admission Type'})\n",
      "('Ibuprofen', {'displayName': 'Ibuprofen', 'type': 'Medication'})\n",
      "('Inconclusive', {'displayName': 'Inconclusive', 'type': 'Test Results'})\n",
      "('00002', {'displayName': 'Danny SMITH', 'type': 'Patient', 'Age': 76, 'Date of Admission': '2022-09-22', 'Discharge Date': '2022-10-07'})\n"
     ]
    }
   ],
   "source": [
    "# Show first few nodes with properties\n",
    "for node in list(G.nodes(data=True))[:20]:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "f1cd428b-fd78-4189-91a7-17d041edbadb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('00000', 'Male', {'type': 'is'})\n",
      "('00000', 'B-', {'type': 'is'})\n",
      "('00000', 'Cancer', {'type': 'has'})\n",
      "('00000', 'Matthew SMITH', {'type': 'is_treated_by'})\n",
      "('00000', 'Sons and Miller', {'type': 'is_treated_in'})\n",
      "('00000', 'Blue Cross', {'type': 'is_client_of'})\n",
      "('00000', 'Urgent', {})\n",
      "('00000', 'Paracetamol', {'type': 'took_medication'})\n",
      "('00000', 'Normal', {'type': 'has_result'})\n",
      "('00001', 'Male', {'type': 'is'})\n",
      "('00001', 'A+', {'type': 'is'})\n",
      "('00001', 'Obesity', {'type': 'has'})\n",
      "('00001', 'Samantha DAVIES', {'type': 'is_treated_by'})\n",
      "('00001', 'Kim Inc', {'type': 'is_treated_in'})\n",
      "('00001', 'Medicare', {'type': 'is_client_of'})\n",
      "('00001', 'Emergency', {})\n",
      "('00001', 'Ibuprofen', {'type': 'took_medication'})\n",
      "('00001', 'Inconclusive', {'type': 'has_result'})\n",
      "('00002', 'Female', {'type': 'is'})\n",
      "('00002', 'A-', {'type': 'is'})\n"
     ]
    }
   ],
   "source": [
    "# Show first few edge with properties\n",
    "for edge in list(G.edges(data=True))[:20]:\n",
    "    print(edge)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e6bd8526-9855-433b-b7a3-03a1a99bdbc1",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f1693568-0781-438d-8cac-2c92537d84d8",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "6909fbcc-ac77-4be9-8150-9bd667c56886",
   "metadata": {},
   "source": [
    "# Create Cypher CREATE command"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "82cad070-60cc-491e-b507-edbddb19ca99",
   "metadata": {},
   "source": [
    "## Build CREATE command"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "7f6faffd-77b5-4092-8401-672d72d9373b",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Cypher query will create graph with 14,571 nodes and 45,000 edges\n",
      "\n",
      "Cypher CREATE command :\n",
      "* size: 5.8096 MB\n",
      "\n",
      "****************************************************************************************************\n",
      "CREATE (:Patient {id: \"00000\", displayName: \"Bobby JACKSON\", type: \"Patient\", Age: 30, `Date of Admission`: \"2024-01-31\", `Discharge Date`: \"2024-02-02\"}),\n",
      "(:Gender {id: \"Male\", displayName: \"Male\", type: \"Gender\"}),\n",
      "(:BloodType {id: \"B-\", displayName: \"B-\", type: \"Blood Type\"}),\n",
      "(:MedicalCondition {id: \"Cancer\", displayName: \"Cancer\", type: \"Medical Condition\"}),\n",
      "(:Doctor {id: \"Matthew SMITH\", displayName: \"Matthew SMITH\", type: \"Doctor\"}),\n",
      "...\n",
      "MATCH (source {id: \"04999\"}), (target {id: \"Russell-Knight\"}) CREATE (source)-[:IS_TREATED_IN]->(target)\n",
      "MATCH (source {id: \"04999\"}), (target {id: \"Blue Cross\"}) CREATE (source)-[:IS_CLIENT_OF]->(target)\n",
      "MATCH (source {id: \"04999\"}), (target {id: \"Emergency\"}) CREATE (source)-[:CONNECTED]->(target)\n",
      "MATCH (source {id: \"04999\"}), (target {id: \"Aspirin\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04999\"}), (target {id: \"Inconclusive\"}) CREATE (source)-[:HAS_RESULT]->(target)\n",
      "****************************************************************************************************\n",
      "\n",
      "CPU times: user 136 ms, sys: 13.9 ms, total: 150 ms\n",
      "Wall time: 149 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Build CREATE command\n",
    "graph_CREATE_command = build_create_command_from_networkx(G)\n",
    "print(f\"\"\"\n",
    "Cypher CREATE command :\n",
    "* size: {len(graph_CREATE_command.encode('utf-8'))/1024/1000:.4f} MB\\n\n",
    "{100 * '*'}\n",
    "{graph_CREATE_command if len(graph_CREATE_command.split(\"\\n\")) < 10000 else \"\\n\".join(graph_CREATE_command.split('\\n')[:5]) + \"\\n...\\n\" + \"\\n\".join(graph_CREATE_command.split('\\n')[-5:])}\n",
    "{100 * '*'}\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "10e35f5c-ceee-4aa7-ab8a-0c9b81056d39",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "37dafa13-feda-424a-b91c-8d6bf924ff54",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "377208d4-b77a-4273-b921-03525216d2af",
   "metadata": {},
   "source": [
    "## Split command into chunks"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "cbc0f931-5d5d-49e1-abb0-fc17c628a874",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "✓ Split into 2 node chunk(s) and 45000 edge chunk(s)\n",
      "\n",
      "Node chunks:\n",
      "  Node chunk 1: 976.4 KB\n",
      "  Node chunk 2: 635.8 KB\n",
      "\n",
      "Edge chunks:\n",
      "  Edge chunk 1: 0.1 KB\n",
      "  Edge chunk 2: 0.1 KB\n",
      "  Edge chunk 3: 0.1 KB\n",
      "  Edge chunk 4: 0.1 KB\n",
      "  Edge chunk 5: 0.1 KB\n",
      "  Edge chunk 6: 0.1 KB\n",
      "  Edge chunk 7: 0.1 KB\n",
      "  Edge chunk 8: 0.1 KB\n",
      "  Edge chunk 9: 0.1 KB\n",
      "  Edge chunk 10: 0.1 KB\n",
      "  Edge chunk 11: 0.1 KB\n",
      "  ...\n",
      "CPU times: user 92.4 ms, sys: 4.9 ms, total: 97.3 ms\n",
      "Wall time: 96.6 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "chunks = split_cypher_commands(graph_CREATE_command, max_size_mb=1)\n",
    "\n",
    "print(f\"✓ Split into {len(chunks['node_chunks'])} node chunk(s) and {len(chunks['edge_chunks'])} edge chunk(s)\")\n",
    "\n",
    "print(\"\\nNode chunks:\")\n",
    "for i, chunk in enumerate(chunks['node_chunks']):\n",
    "    print(f\"  Node chunk {i+1}: {len(chunk.encode('utf-8'))/1024:.1f} KB\")\n",
    "    if i == 10:\n",
    "        print(\"  ...\")\n",
    "        break\n",
    "\n",
    "print(\"\\nEdge chunks:\")\n",
    "for i, chunk in enumerate(chunks['edge_chunks']):\n",
    "    print(f\"  Edge chunk {i+1}: {len(chunk.encode('utf-8'))/1024:.1f} KB\")\n",
    "    if i == 10:\n",
    "        print(\"  ...\")\n",
    "        break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "249181b3-fca0-48ce-8836-1eab49976669",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ce542cb6-5cdb-417e-bee7-455d5097299c",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b2b96327-af0c-48b6-be8f-60cb8845600c",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "067a6363-0ee7-47e2-847e-b341f1c59647",
   "metadata": {},
   "source": [
    "# Create graph using `turingdb` python package"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e31594d3-e4d5-4db3-a68f-5700675fb85e",
   "metadata": {},
   "source": [
    "<div class=\"alert alert-block alert-info\">\n",
    "    <h2>\n",
    "        See <a href=\"https://docs.turingdb.ai/quickstart\">TuringDB Get started documentation</a> for the important steps to follow :\n",
    "    </h2>\n",
    "    <h4>\n",
    "        <ul>\n",
    "            <li>Create your TuringDB account</li>\n",
    "            <li>Create your instance in the <a href=\"https://console.turingdb.ai/auth\">TuringDB Cloud UI</a></li>\n",
    "            <li>Copy your Instance ID from the Database Instances management page</li>\n",
    "            <li>Get API Key from the Settings in UI</li>\n",
    "        </ul>\n",
    "        Remember to have your instance active while working in this notebook !\n",
    "    </h4>\n",
    "</div>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "cab60ccc-e090-41e6-951e-25fe955a9045",
   "metadata": {},
   "outputs": [],
   "source": [
    "from turingdb import TuringDB\n",
    "\n",
    "# Create TuringDB client\n",
    "# set host parameter to the URL (as string) on which TuringDB is running,\n",
    "# default \"http://localhost:6666\"\n",
    "client = TuringDB(host=\"http://localhost:6666\")\n",
    "try:\n",
    "    client.warmup()\n",
    "except Exception as e:\n",
    "    print(f\"TuringDB not started, please run `uv run turingdb` in your terminal\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "826e227e-8445-414e-bfe5-f6d0e6de0b5b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get list of available graphs\n",
    "list_graphs = client.list_available_graphs()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "45e7dfa1-d83a-4074-a64a-06b6f17da571",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['crypto_orbitaal_fraud_detection1', 'citeab_antibody1', 'default']"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "client.list_loaded_graphs()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3b8a3314-7992-4cad-8c82-a67c6bc6f17d",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "b188a7bf-465e-4ca4-b0f2-cc18451204dc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'healthcare_dataset1'"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Set graph name\n",
    "graph_name_prefix = example_name\n",
    "graph_name_nb_suffix = str(\n",
    "    max(\n",
    "        [\n",
    "            int(re.sub(graph_name_prefix, \"\", g))\n",
    "            for g in list_graphs\n",
    "            if g.startswith(graph_name_prefix)\n",
    "            and re.sub(graph_name_prefix, \"\", g).isdigit()\n",
    "        ]\n",
    "        + [0]\n",
    "    )\n",
    "    + 1\n",
    ")\n",
    "graph_name = graph_name_prefix + graph_name_nb_suffix\n",
    "graph_name = re.sub(\"-\", \"_\", graph_name)\n",
    "graph_name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "7e1d3d61-8790-4946-9b7f-e4a957323a45",
   "metadata": {},
   "outputs": [],
   "source": [
    "from turingdb.exceptions import TuringDBException"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "5526def9-6253-425d-928c-2a371f7b2902",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 1.95 ms, sys: 73 μs, total: 2.02 ms\n",
      "Wall time: 8.53 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Set graph\n",
    "try:\n",
    "    client.create_graph(graph_name)\n",
    "except TuringDBException as e:\n",
    "    print(e)\n",
    "\n",
    "# Set working graph\n",
    "client.set_graph(graph_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8dd3ef0b-d325-4458-82da-2d009beb0b79",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "d287a8f6-9d75-452f-aa84-0c5bf8285902",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Current change 0\n",
      "CPU times: user 1.85 ms, sys: 67 μs, total: 1.91 ms\n",
      "Wall time: 1.42 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Create a new change on the graph\n",
    "client.checkout()\n",
    "change = client.new_change()\n",
    "print(f\"Current change {change}\")\n",
    "\n",
    "# Checkout into the change\n",
    "client.checkout(change=change)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "49b5aa8b-611f-4247-a100-96df6ec200e8",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "ad130ff6-ac4e-4efa-8320-8491c832df29",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Executing query on TuringDB...\n",
      "✓ Split into 2 node chunk(s) and 45000 edge chunk(s)\n",
      "\n",
      "Node chunks:\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "5f25f1acc1fa44f5a1e7c57f75f113b4",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "  0%|          | 0/2 [00:00<?, ?it/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "✓ 2 node chunks done\n",
      "\n",
      "Edge chunks:\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "c73cfc24c34940b0ba9f76f78197ad5d",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "  0%|          | 0/45000 [00:00<?, ?it/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "✓ 45000 edge chunks done\n",
      "\n",
      "✓ Graph created successfully in 110.12 seconds\n",
      "\n",
      "✓ Changes successfully submitted in 0.06 seconds\n",
      "CPU times: user 38.3 s, sys: 2.44 s, total: 40.7 s\n",
      "Wall time: 1min 50s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Run CREATE command\n",
    "print(\"\\nExecuting query on TuringDB...\")\n",
    "start_time = time.time()\n",
    "\n",
    "print(f\"✓ Split into {len(chunks['node_chunks'])} node chunk(s) and {len(chunks['edge_chunks'])} edge chunk(s)\")\n",
    "\n",
    "# CREATE nodes\n",
    "print(\"\\nNode chunks:\")\n",
    "for i, chunk in enumerate(tqdm(chunks['node_chunks'])):\n",
    "    result = client.query(chunk)\n",
    "# Commit the change\n",
    "client.query(\"COMMIT\")\n",
    "print(f\"✓ {len(chunks['node_chunks'])} node chunks done\")\n",
    "\n",
    "# CREATE edges\n",
    "print(\"\\nEdge chunks:\")\n",
    "for i, chunk in enumerate(tqdm(chunks['edge_chunks'])):\n",
    "    result = client.query(chunk)\n",
    "# Commit the change\n",
    "client.query(\"COMMIT\")\n",
    "print(f\"✓ {len(chunks['edge_chunks'])} edge chunks done\")\n",
    "\n",
    "execution_time = time.time() - start_time\n",
    "print(f\"\\n✓ Graph created successfully in {execution_time:.2f} seconds\")\n",
    "\n",
    "# Submit changes\n",
    "start_time = time.time()\n",
    "client.query(\"CHANGE SUBMIT\")\n",
    "execution_time = time.time() - start_time\n",
    "print(f\"\\n✓ Changes successfully submitted in {execution_time:.2f} seconds\")\n",
    "\n",
    "# Checkout into main\n",
    "client.checkout()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "afeef025-3175-47d7-b5ea-1a98113d3ed2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>commit</th>\n",
       "      <th>nodeCount</th>\n",
       "      <th>edgeCount</th>\n",
       "      <th>partCount</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>f76179e32b9ea7a2</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>702428bde18d46d7</td>\n",
       "      <td>14571</td>\n",
       "      <td>0</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>6e41926621d4891c</td>\n",
       "      <td>0</td>\n",
       "      <td>45000</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>a0fd7f3ede04ba65</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             commit  nodeCount  edgeCount  partCount\n",
       "0  f76179e32b9ea7a2          0          0          0\n",
       "1  702428bde18d46d7      14571          0          1\n",
       "2  6e41926621d4891c          0      45000          1\n",
       "3  a0fd7f3ede04ba65          0          0          0"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Returns the commit history\n",
    "client.query(\"CALL db.history()\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2186b548-4720-4a3d-ab2d-12b407949d65",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "a8d8a83c-f6dc-4988-8710-e10a3696dc82",
   "metadata": {},
   "source": [
    "<div class=\"alert alert-block alert-info\">\n",
    "    <h2>\n",
    "        Visualize your graph in TuringDB Graph Visualizer ! Now that your instance is running:\n",
    "    </h2>\n",
    "    <h3>\n",
    "        <ul>\n",
    "            <li>Go to <a href=\"https://console.turingdb.ai/databases\">TuringDB Console - Database Instances</a></li>\n",
    "            <li>In your current instance panel, click on \"Open Visualizer\" button</li>\n",
    "            <li>Visualizer opens, now you can choose your graph in the dropdown menu at the top-right corner</li>\n",
    "        </ul>\n",
    "        You can then play with your graph and visualize the nodes you want !\n",
    "    </h3>\n",
    "</div>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d29fb374-321a-4102-a2ac-b815aaff223b",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f2785a45-439e-45d7-991d-bd49d85a4e4b",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ab09d6e5-5150-463e-947a-57cc94cf674c",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "d39e6ad3-7ba2-4334-8123-b21b44cc64c8",
   "metadata": {},
   "source": [
    "# Query TuringDB"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "60b88f3d-fb6a-4376-83b0-5fca1929b912",
   "metadata": {},
   "source": [
    "## Use metaqueries to have insight on graph overall structure\n",
    "\n",
    "<h3>\n",
    "    To learn more about 📮 Metaqueries, please check TuringDB documentation on this <a href=\"https://turingdb.mintlify.app/query/cypher_subset#%F0%9F%93%AE-metaqueries\">link</a>\n",
    "</h3>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "7353cc2b-e8fb-4061-9c7b-b106f636ca5f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>propertyType</th>\n",
       "      <th>valueType</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>Date of Admission</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Age</td>\n",
       "      <td>Int64</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>type</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>Discharge Date</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>displayName</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>id</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>6</td>\n",
       "      <td>Room Number</td>\n",
       "      <td>Int64</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>7</td>\n",
       "      <td>Billing Amount</td>\n",
       "      <td>Double</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  id       propertyType valueType\n",
       "0  0  Date of Admission    String\n",
       "1  1                Age     Int64\n",
       "2  2               type    String\n",
       "3  3     Discharge Date    String\n",
       "4  4        displayName    String\n",
       "5  5                 id    String\n",
       "6  6        Room Number     Int64\n",
       "7  7     Billing Amount    Double"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.72 ms, sys: 987 μs, total: 4.71 ms\n",
      "Wall time: 3.97 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# CALL propertyTypes() - returns a column of all the different node and edge properties and their types in the database\n",
    "command = \"\"\"\n",
    "CALL db.propertyTypes()\n",
    "\"\"\"\n",
    "df_propertyTypes = client.query(command)\n",
    "if df_propertyTypes.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df_propertyTypes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "0f638258-1442-4d19-8300-d7a5136b874c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties: ['Date of Admission', 'Age', 'type', 'Discharge Date', 'displayName', 'id', 'Room Number', 'Billing Amount']\n"
     ]
    }
   ],
   "source": [
    "# Get node properties\n",
    "nodes_properties = df_propertyTypes[\"propertyType\"].values.tolist()\n",
    "print(f\"Node properties: {nodes_properties}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "b04945f1-08ea-468b-be0c-2546f8e90edb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>Patient</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Gender</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>BloodType</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>MedicalCondition</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>Doctor</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>Hospital</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>6</td>\n",
       "      <td>InsuranceProvider</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>7</td>\n",
       "      <td>AdmissionType</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>8</td>\n",
       "      <td>Medication</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>9</td>\n",
       "      <td>TestResults</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   id              label\n",
       "0   0            Patient\n",
       "1   1             Gender\n",
       "2   2          BloodType\n",
       "3   3   MedicalCondition\n",
       "4   4             Doctor\n",
       "5   5           Hospital\n",
       "6   6  InsuranceProvider\n",
       "7   7      AdmissionType\n",
       "8   8         Medication\n",
       "9   9        TestResults"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 4.05 ms, sys: 1 μs, total: 4.05 ms\n",
      "Wall time: 3.63 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# CALL labels () - returns a column of all the different node labels\n",
    "command = \"\"\"\n",
    "CALL db.labels()\n",
    "\"\"\"\n",
    "df_labels = client.query(command)\n",
    "if df_labels.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df_labels)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "c82e8fad-0480-4c6b-bbd4-7b6170d27341",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>edgeType</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>IS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>HAS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>IS_TREATED_BY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>IS_TREATED_IN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>IS_CLIENT_OF</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>CONNECTED</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>6</td>\n",
       "      <td>TOOK_MEDICATION</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>7</td>\n",
       "      <td>HAS_RESULT</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   id         edgeType\n",
       "0   0               IS\n",
       "1   1              HAS\n",
       "2   2    IS_TREATED_BY\n",
       "3   3    IS_TREATED_IN\n",
       "4   4     IS_CLIENT_OF\n",
       "5   5        CONNECTED\n",
       "6   6  TOOK_MEDICATION\n",
       "7   7       HAS_RESULT"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.93 ms, sys: 1 ms, total: 3.94 ms\n",
      "Wall time: 3.4 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# CALL edgeTypes() - returns a column of all the different edge types (edge equivalent of node labels)\n",
    "command = \"\"\"\n",
    "CALL db.edgeTypes()\n",
    "\"\"\"\n",
    "df_edgeTypes = client.query(command)\n",
    "if df_edgeTypes.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df_edgeTypes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d61d538a-cce4-4504-8014-32cfc60e82c4",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a3e59619-5a3e-4081-97df-f0b352b74b8f",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "e4d2bb6a-81fe-416a-b590-3b173ec8778c",
   "metadata": {},
   "source": [
    "## Counts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "1a5f062c-0eae-4b3c-88bb-1eabb54ff616",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Graph: 14,571 nodes and 45,000 edges\n",
      "\n",
      "CPU times: user 8.99 ms, sys: 3.08 ms, total: 12.1 ms\n",
      "Wall time: 12.9 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find number of nodes and number of edges in the graph\n",
    "n_nodes = len(client.query(\"MATCH (n) RETURN n\"))\n",
    "n_edges = len(client.query(\"MATCH (n)-->(m) RETURN n, m\"))\n",
    "print(f\"Graph: {n_nodes:,} nodes and {n_edges:,} edges\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "69038fc5-bb04-4644-8c8b-b2855ebcad2a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>14571</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(n)\n",
       "0     14571"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>45000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(n)\n",
       "0     45000"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Graph: 14,571 nodes and 45,000 edges\n",
      "\n",
      "CPU times: user 7.11 ms, sys: 944 μs, total: 8.06 ms\n",
      "Wall time: 8.52 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Count all nodes\n",
    "command = \"\"\"\n",
    "MATCH (n)\n",
    "RETURN COUNT(n)\n",
    "\"\"\"\n",
    "df_count_nodes = client.query(command)\n",
    "display(df_count_nodes)\n",
    "\n",
    "# Count all edges\n",
    "command = \"\"\"\n",
    "MATCH (n)-->()\n",
    "RETURN COUNT(n)\n",
    "\"\"\"\n",
    "df_count_edges = client.query(command)\n",
    "display(df_count_edges)\n",
    "\n",
    "# Find number of nodes and number of edges in the graph\n",
    "n_nodes = int(df_count_nodes.loc[0, \"COUNT(n)\"])\n",
    "n_edges = int(df_count_edges.loc[0, \"COUNT(n)\"])\n",
    "print(f\"Graph: {n_nodes:,} nodes and {n_edges:,} edges\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9a99b93b-c068-4e22-9847-8b108a938854",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "d336391f-61f0-4bd5-845c-90add30a658e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "----------------------------------------------------------------------------------------------------\n",
      "label: Patient\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>5000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0      5000"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n",
      "label: Gender\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0         2"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n",
      "label: BloodType\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>8</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0         8"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n",
      "label: MedicalCondition\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0         6"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n",
      "label: Doctor\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>4820</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0      4820"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n",
      "label: Hospital\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>4719</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0      4719"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n",
      "label: InsuranceProvider\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0         5"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n",
      "label: AdmissionType\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0         3"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n",
      "label: Medication\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>5</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0         5"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n",
      "label: TestResults\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0         3"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n"
     ]
    }
   ],
   "source": [
    "# Count number of nodes for each label\n",
    "for label in df_labels[\"label\"]:\n",
    "    print(100 * '-')\n",
    "    print(f\"label: {label}\")\n",
    "    df_curr_label = client.query(f\"\"\"\n",
    "    MATCH (n:{label})\n",
    "    RETURN count(n)\n",
    "    \"\"\")\n",
    "    display(df_curr_label)\n",
    "    print()\n",
    "print(100 * '-')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "53e4c229-062b-4705-a235-b1affa7e4940",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "af26a250-7f59-413e-b9c2-f9fa6ee456ca",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "3cc2b838-ee09-4c15-87c7-604fff615931",
   "metadata": {},
   "source": [
    "## Queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "82a949c6-8630-48a2-bd5a-bd8dc79c0818",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.displayName</th>\n",
       "      <th>e</th>\n",
       "      <th>m.displayName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Brett GRIFFIN</td>\n",
       "      <td>0</td>\n",
       "      <td>Male</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Brett GRIFFIN</td>\n",
       "      <td>1</td>\n",
       "      <td>A+</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Brett GRIFFIN</td>\n",
       "      <td>2</td>\n",
       "      <td>Asthma</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Brett GRIFFIN</td>\n",
       "      <td>3</td>\n",
       "      <td>David PERRY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Brett GRIFFIN</td>\n",
       "      <td>4</td>\n",
       "      <td>Nelson-Drake</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44995</th>\n",
       "      <td>Adrian BOWMAN</td>\n",
       "      <td>44995</td>\n",
       "      <td>Baldwin-Marshall</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44996</th>\n",
       "      <td>Adrian BOWMAN</td>\n",
       "      <td>44996</td>\n",
       "      <td>Julie WARREN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44997</th>\n",
       "      <td>Adrian BOWMAN</td>\n",
       "      <td>44997</td>\n",
       "      <td>Cancer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44998</th>\n",
       "      <td>Adrian BOWMAN</td>\n",
       "      <td>44998</td>\n",
       "      <td>A-</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44999</th>\n",
       "      <td>Adrian BOWMAN</td>\n",
       "      <td>44999</td>\n",
       "      <td>Female</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>45000 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       n.displayName      e     m.displayName\n",
       "0      Brett GRIFFIN      0              Male\n",
       "1      Brett GRIFFIN      1                A+\n",
       "2      Brett GRIFFIN      2            Asthma\n",
       "3      Brett GRIFFIN      3       David PERRY\n",
       "4      Brett GRIFFIN      4      Nelson-Drake\n",
       "...              ...    ...               ...\n",
       "44995  Adrian BOWMAN  44995  Baldwin-Marshall\n",
       "44996  Adrian BOWMAN  44996      Julie WARREN\n",
       "44997  Adrian BOWMAN  44997            Cancer\n",
       "44998  Adrian BOWMAN  44998                A-\n",
       "44999  Adrian BOWMAN  44999            Female\n",
       "\n",
       "[45000 rows x 3 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 14.2 ms, sys: 7.06 ms, total: 21.3 ms\n",
      "Wall time: 29.6 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Match all edges and return them\n",
    "command = \"\"\"\n",
    "MATCH (n)-[e]->(m)\n",
    "RETURN n.displayName, e, m.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "93fcec6e-0cc8-49cd-90c8-1269654dbca5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.type</th>\n",
       "      <th>n.displayName</th>\n",
       "      <th>e</th>\n",
       "      <th>m.type</th>\n",
       "      <th>m.displayName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Patient</td>\n",
       "      <td>Brett GRIFFIN</td>\n",
       "      <td>0</td>\n",
       "      <td>Gender</td>\n",
       "      <td>Male</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Patient</td>\n",
       "      <td>Brett GRIFFIN</td>\n",
       "      <td>1</td>\n",
       "      <td>Blood Type</td>\n",
       "      <td>A+</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Patient</td>\n",
       "      <td>Brett GRIFFIN</td>\n",
       "      <td>2</td>\n",
       "      <td>Medical Condition</td>\n",
       "      <td>Asthma</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Patient</td>\n",
       "      <td>Brett GRIFFIN</td>\n",
       "      <td>3</td>\n",
       "      <td>Doctor</td>\n",
       "      <td>David PERRY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Patient</td>\n",
       "      <td>Brett GRIFFIN</td>\n",
       "      <td>4</td>\n",
       "      <td>Hospital</td>\n",
       "      <td>Nelson-Drake</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44995</th>\n",
       "      <td>Patient</td>\n",
       "      <td>Adrian BOWMAN</td>\n",
       "      <td>44995</td>\n",
       "      <td>Hospital</td>\n",
       "      <td>Baldwin-Marshall</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44996</th>\n",
       "      <td>Patient</td>\n",
       "      <td>Adrian BOWMAN</td>\n",
       "      <td>44996</td>\n",
       "      <td>Doctor</td>\n",
       "      <td>Julie WARREN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44997</th>\n",
       "      <td>Patient</td>\n",
       "      <td>Adrian BOWMAN</td>\n",
       "      <td>44997</td>\n",
       "      <td>Medical Condition</td>\n",
       "      <td>Cancer</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44998</th>\n",
       "      <td>Patient</td>\n",
       "      <td>Adrian BOWMAN</td>\n",
       "      <td>44998</td>\n",
       "      <td>Blood Type</td>\n",
       "      <td>A-</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44999</th>\n",
       "      <td>Patient</td>\n",
       "      <td>Adrian BOWMAN</td>\n",
       "      <td>44999</td>\n",
       "      <td>Gender</td>\n",
       "      <td>Female</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>45000 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "        n.type  n.displayName      e             m.type     m.displayName\n",
       "0      Patient  Brett GRIFFIN      0             Gender              Male\n",
       "1      Patient  Brett GRIFFIN      1         Blood Type                A+\n",
       "2      Patient  Brett GRIFFIN      2  Medical Condition            Asthma\n",
       "3      Patient  Brett GRIFFIN      3             Doctor       David PERRY\n",
       "4      Patient  Brett GRIFFIN      4           Hospital      Nelson-Drake\n",
       "...        ...            ...    ...                ...               ...\n",
       "44995  Patient  Adrian BOWMAN  44995           Hospital  Baldwin-Marshall\n",
       "44996  Patient  Adrian BOWMAN  44996             Doctor      Julie WARREN\n",
       "44997  Patient  Adrian BOWMAN  44997  Medical Condition            Cancer\n",
       "44998  Patient  Adrian BOWMAN  44998         Blood Type                A-\n",
       "44999  Patient  Adrian BOWMAN  44999             Gender            Female\n",
       "\n",
       "[45000 rows x 5 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 18.5 ms, sys: 17 ms, total: 35.6 ms\n",
      "Wall time: 49.8 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Match all edges linking a Patient to an other node\n",
    "# Return displayName and type properties\n",
    "command = \"\"\"\n",
    "MATCH (n:Patient)-[e]->(m)\n",
    "RETURN n.type, n.displayName, e, m.type, m.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "1b64b3a7-20b7-4044-9025-46feefe7734a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p.id</th>\n",
       "      <th>p.displayName</th>\n",
       "      <th>p.Age</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>02012</td>\n",
       "      <td>Brett GRIFFIN</td>\n",
       "      <td>74</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>02011</td>\n",
       "      <td>Phillip WALLACE</td>\n",
       "      <td>75</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>04303</td>\n",
       "      <td>Victor DAVIS</td>\n",
       "      <td>42</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>02010</td>\n",
       "      <td>Chelsea MENDOZA</td>\n",
       "      <td>84</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>02009</td>\n",
       "      <td>Eugene HOFFMAN</td>\n",
       "      <td>79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4995</th>\n",
       "      <td>00070</td>\n",
       "      <td>Carol PATTERSON</td>\n",
       "      <td>29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4996</th>\n",
       "      <td>00138</td>\n",
       "      <td>Melissa SCOTT</td>\n",
       "      <td>38</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4997</th>\n",
       "      <td>00071</td>\n",
       "      <td>Jose LOPEZ</td>\n",
       "      <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4998</th>\n",
       "      <td>01136</td>\n",
       "      <td>Hannah CAREY</td>\n",
       "      <td>60</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4999</th>\n",
       "      <td>00988</td>\n",
       "      <td>Adrian BOWMAN</td>\n",
       "      <td>25</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5000 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       p.id    p.displayName  p.Age\n",
       "0     02012    Brett GRIFFIN     74\n",
       "1     02011  Phillip WALLACE     75\n",
       "2     04303     Victor DAVIS     42\n",
       "3     02010  Chelsea MENDOZA     84\n",
       "4     02009   Eugene HOFFMAN     79\n",
       "...     ...              ...    ...\n",
       "4995  00070  Carol PATTERSON     29\n",
       "4996  00138    Melissa SCOTT     38\n",
       "4997  00071       Jose LOPEZ     18\n",
       "4998  01136     Hannah CAREY     60\n",
       "4999  00988    Adrian BOWMAN     25\n",
       "\n",
       "[5000 rows x 3 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 8.94 ms, sys: 0 ns, total: 8.94 ms\n",
      "Wall time: 9.49 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all patients\n",
    "command = \"\"\"\n",
    "MATCH (p:Patient)\n",
    "RETURN p.id, p.displayName, p.Age\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "d79cbf3e-153a-40d8-9a81-cca96ab109ee",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>d.displayName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Matthew THOMAS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Laurie GATES</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Catherine MORA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Kathryn ROJAS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Erica WILLIAMS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4815</th>\n",
       "      <td>Kaitlyn ROGERS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4816</th>\n",
       "      <td>Wayne MORALES</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4817</th>\n",
       "      <td>Kristen AGUIRRE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4818</th>\n",
       "      <td>Ashley JOHNSTON</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4819</th>\n",
       "      <td>Patricia COLE</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>4820 rows × 1 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "        d.displayName\n",
       "0      Matthew THOMAS\n",
       "1        Laurie GATES\n",
       "2      Catherine MORA\n",
       "3       Kathryn ROJAS\n",
       "4      Erica WILLIAMS\n",
       "...               ...\n",
       "4815   Kaitlyn ROGERS\n",
       "4816    Wayne MORALES\n",
       "4817  Kristen AGUIRRE\n",
       "4818  Ashley JOHNSTON\n",
       "4819    Patricia COLE\n",
       "\n",
       "[4820 rows x 1 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.33 ms, sys: 1.03 ms, total: 4.36 ms\n",
      "Wall time: 4.11 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all doctors\n",
    "command = \"\"\"\n",
    "MATCH (d:Doctor)\n",
    "RETURN d.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "0e5c6737-a86a-4c54-b1b0-6fbfe7dcdc5e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>d.displayName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Aspirin</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Lipitor</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Ibuprofen</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Penicillin</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Paracetamol</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  d.displayName\n",
       "0       Aspirin\n",
       "1       Lipitor\n",
       "2     Ibuprofen\n",
       "3    Penicillin\n",
       "4   Paracetamol"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.8 ms, sys: 992 μs, total: 3.8 ms\n",
      "Wall time: 9.33 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all medications\n",
    "command = \"\"\"\n",
    "MATCH (d:Medication)\n",
    "RETURN d.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "da98ac68-560a-442d-8f9b-300ac2c2ed93",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "      <th>p.id</th>\n",
       "      <th>p.displayName</th>\n",
       "      <th>p.type</th>\n",
       "      <th>p.Age</th>\n",
       "      <th>p.`Date of Admission`</th>\n",
       "      <th>p.`Discharge Date`</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>4953</td>\n",
       "      <td>00000</td>\n",
       "      <td>Bobby JACKSON</td>\n",
       "      <td>Patient</td>\n",
       "      <td>30</td>\n",
       "      <td>2024-01-31</td>\n",
       "      <td>2024-02-02</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      p   p.id  p.displayName   p.type  p.Age p.`Date of Admission`  \\\n",
       "0  4953  00000  Bobby JACKSON  Patient     30            2024-01-31   \n",
       "\n",
       "  p.`Discharge Date`  \n",
       "0         2024-02-02  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 5.16 ms, sys: 1.02 ms, total: 6.17 ms\n",
      "Wall time: 8 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find patient with specific ID and return all their information\n",
    "command = \"\"\"\n",
    "MATCH (p:Patient)\n",
    "WHERE p.id = \"00000\"\n",
    "RETURN p, p.id, p.displayName, p.type, p.Age, p.`Date of Admission`, p.`Discharge Date`\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "e0d27665-b147-4d4a-9dda-03c3ea7e8177",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p.displayName</th>\n",
       "      <th>p.Age</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Victor DAVIS</td>\n",
       "      <td>42</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Chelsea MENDOZA</td>\n",
       "      <td>84</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Adrian GREEN</td>\n",
       "      <td>37</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Kelly HARRIS</td>\n",
       "      <td>77</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Katrina ADAMS</td>\n",
       "      <td>81</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2473</th>\n",
       "      <td>Tony SALAS</td>\n",
       "      <td>58</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2474</th>\n",
       "      <td>Carol PATTERSON</td>\n",
       "      <td>29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2475</th>\n",
       "      <td>Melissa SCOTT</td>\n",
       "      <td>38</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2476</th>\n",
       "      <td>Hannah CAREY</td>\n",
       "      <td>60</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2477</th>\n",
       "      <td>Adrian BOWMAN</td>\n",
       "      <td>25</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>2478 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "        p.displayName  p.Age\n",
       "0        Victor DAVIS     42\n",
       "1     Chelsea MENDOZA     84\n",
       "2        Adrian GREEN     37\n",
       "3        Kelly HARRIS     77\n",
       "4       Katrina ADAMS     81\n",
       "...               ...    ...\n",
       "2473       Tony SALAS     58\n",
       "2474  Carol PATTERSON     29\n",
       "2475    Melissa SCOTT     38\n",
       "2476     Hannah CAREY     60\n",
       "2477    Adrian BOWMAN     25\n",
       "\n",
       "[2478 rows x 2 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 4.88 ms, sys: 59 μs, total: 4.94 ms\n",
      "Wall time: 6.98 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find female patients\n",
    "command = \"\"\"\n",
    "MATCH (p:Patient)-[:IS]->(g:Gender)\n",
    "WHERE g.displayName = \"Female\"\n",
    "RETURN p.displayName, p.Age\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "ae90d9a3-2bdf-4aef-87fd-3ee06b92f8de",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p.displayName</th>\n",
       "      <th>p.Age</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Chelsea MENDOZA</td>\n",
       "      <td>84</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Eugene HOFFMAN</td>\n",
       "      <td>79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Matthew GLOVER</td>\n",
       "      <td>35</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Luis PATTERSON</td>\n",
       "      <td>27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Leah TAYLOR</td>\n",
       "      <td>49</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>857</th>\n",
       "      <td>Marcus BROWN</td>\n",
       "      <td>41</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>858</th>\n",
       "      <td>Kevin SMITH</td>\n",
       "      <td>48</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>859</th>\n",
       "      <td>Carol PATTERSON</td>\n",
       "      <td>29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>860</th>\n",
       "      <td>Hannah CAREY</td>\n",
       "      <td>60</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>861</th>\n",
       "      <td>Adrian BOWMAN</td>\n",
       "      <td>25</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>862 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       p.displayName  p.Age\n",
       "0    Chelsea MENDOZA     84\n",
       "1     Eugene HOFFMAN     79\n",
       "2     Matthew GLOVER     35\n",
       "3     Luis PATTERSON     27\n",
       "4        Leah TAYLOR     49\n",
       "..               ...    ...\n",
       "857     Marcus BROWN     41\n",
       "858      Kevin SMITH     48\n",
       "859  Carol PATTERSON     29\n",
       "860     Hannah CAREY     60\n",
       "861    Adrian BOWMAN     25\n",
       "\n",
       "[862 rows x 2 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 4.34 ms, sys: 91 μs, total: 4.43 ms\n",
      "Wall time: 5.48 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find patients with Cancer\n",
    "command = \"\"\"\n",
    "MATCH (p:Patient)-[:HAS]->(mc:MedicalCondition)\n",
    "WHERE mc.displayName = \"Cancer\"\n",
    "RETURN p.displayName, p.Age\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "c2346f6c-0c4d-48a9-b6c2-466b0f72e0be",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p.displayName</th>\n",
       "      <th>d.displayName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Brett GRIFFIN</td>\n",
       "      <td>David PERRY</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Phillip WALLACE</td>\n",
       "      <td>William TAYLOR</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Victor DAVIS</td>\n",
       "      <td>Michelle CRUZ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Chelsea MENDOZA</td>\n",
       "      <td>Robyn HOWARD</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Eugene HOFFMAN</td>\n",
       "      <td>Justin TAPIA</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4995</th>\n",
       "      <td>Carol PATTERSON</td>\n",
       "      <td>Jamie BAKER</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4996</th>\n",
       "      <td>Melissa SCOTT</td>\n",
       "      <td>Kari MOORE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4997</th>\n",
       "      <td>Jose LOPEZ</td>\n",
       "      <td>Erika JACKSON</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4998</th>\n",
       "      <td>Hannah CAREY</td>\n",
       "      <td>Emma YANG</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4999</th>\n",
       "      <td>Adrian BOWMAN</td>\n",
       "      <td>Julie WARREN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>5000 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "        p.displayName   d.displayName\n",
       "0       Brett GRIFFIN     David PERRY\n",
       "1     Phillip WALLACE  William TAYLOR\n",
       "2        Victor DAVIS   Michelle CRUZ\n",
       "3     Chelsea MENDOZA    Robyn HOWARD\n",
       "4      Eugene HOFFMAN    Justin TAPIA\n",
       "...               ...             ...\n",
       "4995  Carol PATTERSON     Jamie BAKER\n",
       "4996    Melissa SCOTT      Kari MOORE\n",
       "4997       Jose LOPEZ   Erika JACKSON\n",
       "4998     Hannah CAREY       Emma YANG\n",
       "4999    Adrian BOWMAN    Julie WARREN\n",
       "\n",
       "[5000 rows x 2 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.46 ms, sys: 2.05 ms, total: 5.51 ms\n",
      "Wall time: 6.9 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all patients who are treated by a doctor\n",
    "command = \"\"\"\n",
    "MATCH (p:Patient)-[:IS_TREATED_BY]->(d:Doctor)\n",
    "RETURN p.displayName, d.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "cdd4cf79-3633-4816-bc61-ba3e6c636674",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p.displayName</th>\n",
       "      <th>d.displayName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Edward EDWARDS</td>\n",
       "      <td>Kelly OLSON</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    p.displayName d.displayName\n",
       "0  Edward EDWARDS   Kelly OLSON"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.77 ms, sys: 990 μs, total: 3.76 ms\n",
      "Wall time: 4.7 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all patients treated by doctor Kelly OLSON\n",
    "command = \"\"\"\n",
    "MATCH (p:Patient)-[:IS_TREATED_BY]->(d:Doctor)\n",
    "WHERE d.displayName = \"Kelly OLSON\"\n",
    "RETURN p.displayName, d.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "b0d3eb99-347f-4f9f-a14d-20c37e148a90",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p.displayName</th>\n",
       "      <th>p.Age</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Brett GRIFFIN</td>\n",
       "      <td>74</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Phillip WALLACE</td>\n",
       "      <td>75</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Eugene HOFFMAN</td>\n",
       "      <td>79</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Katrina ADAMS</td>\n",
       "      <td>81</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Kelly WILLIAMS</td>\n",
       "      <td>75</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>640</th>\n",
       "      <td>Cynthia BRYANT</td>\n",
       "      <td>70</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>641</th>\n",
       "      <td>Mr. KENNETH</td>\n",
       "      <td>34</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>642</th>\n",
       "      <td>Tammy COLE</td>\n",
       "      <td>28</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>643</th>\n",
       "      <td>Linda JONES</td>\n",
       "      <td>82</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>644</th>\n",
       "      <td>Steven JAMES</td>\n",
       "      <td>19</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>645 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       p.displayName  p.Age\n",
       "0      Brett GRIFFIN     74\n",
       "1    Phillip WALLACE     75\n",
       "2     Eugene HOFFMAN     79\n",
       "3      Katrina ADAMS     81\n",
       "4     Kelly WILLIAMS     75\n",
       "..               ...    ...\n",
       "640   Cynthia BRYANT     70\n",
       "641      Mr. KENNETH     34\n",
       "642       Tammy COLE     28\n",
       "643      Linda JONES     82\n",
       "644     Steven JAMES     19\n",
       "\n",
       "[645 rows x 2 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.35 ms, sys: 1.03 ms, total: 4.38 ms\n",
      "Wall time: 5.77 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all patients with blood type A+\n",
    "command = \"\"\"\n",
    "MATCH (p:Patient)-[:IS]->(bt:BloodType)\n",
    "WHERE bt.displayName = \"A+\"\n",
    "RETURN p.displayName, p.Age\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "bd25e708-3349-44ff-9793-8aa78d59bb26",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Patient ID</th>\n",
       "      <th>Patient Name</th>\n",
       "      <th>Medication</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>02012</td>\n",
       "      <td>Brett GRIFFIN</td>\n",
       "      <td>Paracetamol</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>02004</td>\n",
       "      <td>Kelly WILLIAMS</td>\n",
       "      <td>Paracetamol</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>01998</td>\n",
       "      <td>Holly NELSON</td>\n",
       "      <td>Paracetamol</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>01995</td>\n",
       "      <td>Leroy PRICE</td>\n",
       "      <td>Paracetamol</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>02027</td>\n",
       "      <td>Shawn RAMIREZ</td>\n",
       "      <td>Paracetamol</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>941</th>\n",
       "      <td>00072</td>\n",
       "      <td>Kevin SIMMONS</td>\n",
       "      <td>Paracetamol</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>942</th>\n",
       "      <td>01097</td>\n",
       "      <td>Jasmine LUNA</td>\n",
       "      <td>Paracetamol</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>943</th>\n",
       "      <td>04983</td>\n",
       "      <td>Melissa MCDONALD</td>\n",
       "      <td>Paracetamol</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>944</th>\n",
       "      <td>00139</td>\n",
       "      <td>Gary HOPKINS</td>\n",
       "      <td>Paracetamol</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>945</th>\n",
       "      <td>04622</td>\n",
       "      <td>Kevin SMITH</td>\n",
       "      <td>Paracetamol</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>946 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    Patient ID      Patient Name   Medication\n",
       "0        02012     Brett GRIFFIN  Paracetamol\n",
       "1        02004    Kelly WILLIAMS  Paracetamol\n",
       "2        01998      Holly NELSON  Paracetamol\n",
       "3        01995       Leroy PRICE  Paracetamol\n",
       "4        02027     Shawn RAMIREZ  Paracetamol\n",
       "..         ...               ...          ...\n",
       "941      00072     Kevin SIMMONS  Paracetamol\n",
       "942      01097      Jasmine LUNA  Paracetamol\n",
       "943      04983  Melissa MCDONALD  Paracetamol\n",
       "944      00139      Gary HOPKINS  Paracetamol\n",
       "945      04622       Kevin SMITH  Paracetamol\n",
       "\n",
       "[946 rows x 3 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 4.92 ms, sys: 0 ns, total: 4.92 ms\n",
      "Wall time: 6.01 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all patients who took Paracetamol\n",
    "command = \"\"\"\n",
    "MATCH (p:Patient)-[:TOOK_MEDICATION]->(m:Medication)\n",
    "WHERE m.displayName = \"Paracetamol\"\n",
    "RETURN p.id, p.displayName, m.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "df.columns = [\"Patient ID\", \"Patient Name\", \"Medication\"]\n",
    "display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "00d30ae3-022c-4a70-b5e0-4c837178998a",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4ed6aef0-6d7d-43e6-b006-93e344565c2b",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "28531f03-46a5-425e-956c-3303e9cc4475",
   "metadata": {},
   "source": [
    "# Create subgraph to visualise"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "358c78d0-86c3-4619-b2aa-dc11c0b54e24",
   "metadata": {},
   "outputs": [],
   "source": [
    "import numpy as np"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "a067f8ee-da55-45e1-b2ed-46ac0d9e1c4b",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "DiGraph with 102 nodes and 101 edges\n",
      "Cypher query will create graph with 102 nodes and 101 edges\n",
      "\n",
      "Cypher CREATE command :\n",
      "* size: 0.0250 MB\n",
      "\n",
      "****************************************************************************************************\n",
      "CREATE (:Patient {id: \"02399\", displayName: \"Thomas JOHNSON\", type: \"Patient\", Age: 39, `Date of Admission`: \"2022-06-16\", `Discharge Date`: \"2022-07-08\"}),\n",
      "(:Patient {id: \"02333\", displayName: \"David WARREN\", type: \"Patient\", Age: 60, `Date of Admission`: \"2021-07-16\", `Discharge Date`: \"2021-07-20\"}),\n",
      "(:Patient {id: \"04301\", displayName: \"Joseph SANTIAGO\", type: \"Patient\", Age: 59, `Date of Admission`: \"2024-04-15\", `Discharge Date`: \"2024-04-17\"}),\n",
      "(:Patient {id: \"04196\", displayName: \"Kendra JOHNSON\", type: \"Patient\", Age: 57, `Date of Admission`: \"2021-09-20\", `Discharge Date`: \"2021-10-05\"}),\n",
      "(:Patient {id: \"01825\", displayName: \"Lucas WILSON\", type: \"Patient\", Age: 39, `Date of Admission`: \"2019-07-28\", `Discharge Date`: \"2019-08-02\"}),\n",
      "(:Patient {id: \"02313\", displayName: \"John BAUER\", type: \"Patient\", Age: 51, `Date of Admission`: \"2024-04-24\", `Discharge Date`: \"2024-05-03\"}),\n",
      "(:Patient {id: \"01854\", displayName: \"Brittney CHEN\", type: \"Patient\", Age: 85, `Date of Admission`: \"2020-10-08\", `Discharge Date`: \"2020-11-07\"}),\n",
      "(:Patient {id: \"04376\", displayName: \"Dr. PAMELA\", type: \"Patient\", Age: 71, `Date of Admission`: \"2022-03-13\", `Discharge Date`: \"2022-03-25\"}),\n",
      "(:Patient {id: \"01995\", displayName: \"Leroy PRICE\", type: \"Patient\", Age: 42, `Date of Admission`: \"2022-04-18\", `Discharge Date`: \"2022-04-22\"}),\n",
      "(:Patient {id: \"02403\", displayName: \"Jeffrey BAKER\", type: \"Patient\", Age: 82, `Date of Admission`: \"2022-01-22\", `Discharge Date`: \"2022-02-05\"}),\n",
      "(:Patient {id: \"04344\", displayName: \"James KRAMER\", type: \"Patient\", Age: 36, `Date of Admission`: \"2023-09-23\", `Discharge Date`: \"2023-10-06\"}),\n",
      "(:Patient {id: \"02341\", displayName: \"Sheri HOUSTON\", type: \"Patient\", Age: 38, `Date of Admission`: \"2020-07-31\", `Discharge Date`: \"2020-08-08\"}),\n",
      "(:Patient {id: \"01897\", displayName: \"Lisa GILMORE\", type: \"Patient\", Age: 23, `Date of Admission`: \"2020-09-16\", `Discharge Date`: \"2020-10-08\"}),\n",
      "(:Patient {id: \"01820\", displayName: \"Jennifer DIXON\", type: \"Patient\", Age: 45, `Date of Admission`: \"2023-06-12\", `Discharge Date`: \"2023-06-19\"}),\n",
      "(:Patient {id: \"02015\", displayName: \"James BENSON\", type: \"Patient\", Age: 79, `Date of Admission`: \"2021-11-18\", `Discharge Date`: \"2021-12-15\"}),\n",
      "(:Patient {id: \"02424\", displayName: \"Robert MARTINEZ\", type: \"Patient\", Age: 37, `Date of Admission`: \"2022-05-22\", `Discharge Date`: \"2022-06-20\"}),\n",
      "(:Patient {id: \"01954\", displayName: \"Kristen DUARTE\", type: \"Patient\", Age: 38, `Date of Admission`: \"2024-02-20\", `Discharge Date`: \"2024-03-18\"}),\n",
      "(:Patient {id: \"02060\", displayName: \"Christopher THOMAS\", type: \"Patient\", Age: 43, `Date of Admission`: \"2021-05-19\", `Discharge Date`: \"2021-05-30\"}),\n",
      "(:Patient {id: \"02100\", displayName: \"Jennifer NAVARRO\", type: \"Patient\", Age: 70, `Date of Admission`: \"2021-01-30\", `Discharge Date`: \"2021-02-13\"}),\n",
      "(:Patient {id: \"02327\", displayName: \"Matthew LOPEZ\", type: \"Patient\", Age: 59, `Date of Admission`: \"2022-12-01\", `Discharge Date`: \"2022-12-15\"}),\n",
      "(:Patient {id: \"01965\", displayName: \"Keith ALLEN\", type: \"Patient\", Age: 76, `Date of Admission`: \"2020-03-31\", `Discharge Date`: \"2020-04-15\"}),\n",
      "(:Patient {id: \"01811\", displayName: \"John FLORES\", type: \"Patient\", Age: 82, `Date of Admission`: \"2021-10-01\", `Discharge Date`: \"2021-10-29\"}),\n",
      "(:Patient {id: \"02289\", displayName: \"Amy KIRK\", type: \"Patient\", Age: 32, `Date of Admission`: \"2023-03-06\", `Discharge Date`: \"2023-03-30\"}),\n",
      "(:Patient {id: \"01818\", displayName: \"Robert JONES\", type: \"Patient\", Age: 51, `Date of Admission`: \"2023-07-29\", `Discharge Date`: \"2023-08-19\"}),\n",
      "(:Patient {id: \"01963\", displayName: \"Alicia FIELDS\", type: \"Patient\", Age: 20, `Date of Admission`: \"2023-11-20\", `Discharge Date`: \"2023-11-21\"}),\n",
      "(:Patient {id: \"01951\", displayName: \"Timothy GEORGE\", type: \"Patient\", Age: 67, `Date of Admission`: \"2022-05-01\", `Discharge Date`: \"2022-05-23\"}),\n",
      "(:Patient {id: \"02285\", displayName: \"Mr. JAMES\", type: \"Patient\", Age: 80, `Date of Admission`: \"2023-02-01\", `Discharge Date`: \"2023-02-24\"}),\n",
      "(:Patient {id: \"01798\", displayName: \"Victoria CRAWFORD\", type: \"Patient\", Age: 34, `Date of Admission`: \"2021-01-23\", `Discharge Date`: \"2021-02-19\"}),\n",
      "(:Patient {id: \"02040\", displayName: \"Benjamin BERNARD\", type: \"Patient\", Age: 76, `Date of Admission`: \"2022-06-29\", `Discharge Date`: \"2022-07-13\"}),\n",
      "(:Patient {id: \"02312\", displayName: \"Cathy RODRIGUEZ\", type: \"Patient\", Age: 39, `Date of Admission`: \"2023-08-13\", `Discharge Date`: \"2023-08-14\"}),\n",
      "(:Patient {id: \"01964\", displayName: \"Hannah SANCHEZ\", type: \"Patient\", Age: 44, `Date of Admission`: \"2023-12-18\", `Discharge Date`: \"2024-01-10\"}),\n",
      "(:Patient {id: \"02044\", displayName: \"Kevin MARSHALL\", type: \"Patient\", Age: 22, `Date of Admission`: \"2021-05-11\", `Discharge Date`: \"2021-05-16\"}),\n",
      "(:Patient {id: \"04371\", displayName: \"Teresa WILSON\", type: \"Patient\", Age: 73, `Date of Admission`: \"2022-07-27\", `Discharge Date`: \"2022-07-29\"}),\n",
      "(:Patient {id: \"02016\", displayName: \"Frederick MCFARLAND\", type: \"Patient\", Age: 38, `Date of Admission`: \"2022-04-21\", `Discharge Date`: \"2022-05-03\"}),\n",
      "(:Patient {id: \"01826\", displayName: \"Ronald BROWN\", type: \"Patient\", Age: 55, `Date of Admission`: \"2022-05-10\", `Discharge Date`: \"2022-05-12\"}),\n",
      "(:Patient {id: \"02295\", displayName: \"Katherine ANDERSON\", type: \"Patient\", Age: 64, `Date of Admission`: \"2019-11-28\", `Discharge Date`: \"2019-12-22\"}),\n",
      "(:Patient {id: \"01882\", displayName: \"Michael OBRIEN\", type: \"Patient\", Age: 66, `Date of Admission`: \"2022-12-30\", `Discharge Date`: \"2023-01-15\"}),\n",
      "(:Patient {id: \"01945\", displayName: \"Dr. KEVIN\", type: \"Patient\", Age: 25, `Date of Admission`: \"2023-06-27\", `Discharge Date`: \"2023-07-04\"}),\n",
      "(:Patient {id: \"04322\", displayName: \"Tracy SULLIVAN\", type: \"Patient\", Age: 81, `Date of Admission`: \"2021-06-03\", `Discharge Date`: \"2021-06-06\"}),\n",
      "(:Patient {id: \"01939\", displayName: \"Angelica MARTINEZ\", type: \"Patient\", Age: 47, `Date of Admission`: \"2022-05-29\", `Discharge Date`: \"2022-06-18\"}),\n",
      "(:Patient {id: \"01903\", displayName: \"Tara ADAMS\", type: \"Patient\", Age: 46, `Date of Admission`: \"2021-03-13\", `Discharge Date`: \"2021-04-08\"}),\n",
      "(:Patient {id: \"02092\", displayName: \"Elizabeth WANG\", type: \"Patient\", Age: 74, `Date of Admission`: \"2021-07-05\", `Discharge Date`: \"2021-07-15\"}),\n",
      "(:Medication {id: \"Paracetamol\", displayName: \"Paracetamol\", type: \"Medication\"}),\n",
      "(:Patient {id: \"02012\", displayName: \"Brett GRIFFIN\", type: \"Patient\", Age: 74, `Date of Admission`: \"2020-07-02\", `Discharge Date`: \"2020-07-05\"}),\n",
      "(:Patient {id: \"04359\", displayName: \"Margaret BROWN\", type: \"Patient\", Age: 33, `Date of Admission`: \"2023-03-25\", `Discharge Date`: \"2023-04-19\"}),\n",
      "(:Patient {id: \"01929\", displayName: \"Michael WILKINS\", type: \"Patient\", Age: 57, `Date of Admission`: \"2023-10-17\", `Discharge Date`: \"2023-10-30\"}),\n",
      "(:Patient {id: \"02308\", displayName: \"John CURTIS\", type: \"Patient\", Age: 25, `Date of Admission`: \"2019-12-17\", `Discharge Date`: \"2020-01-05\"}),\n",
      "(:Patient {id: \"01891\", displayName: \"Alex WHITE\", type: \"Patient\", Age: 63, `Date of Admission`: \"2021-09-15\", `Discharge Date`: \"2021-09-22\"}),\n",
      "(:Patient {id: \"02284\", displayName: \"Janice BRIGGS\", type: \"Patient\", Age: 71, `Date of Admission`: \"2019-09-20\", `Discharge Date`: \"2019-10-14\"}),\n",
      "(:Patient {id: \"04199\", displayName: \"Veronica BOWEN\", type: \"Patient\", Age: 35, `Date of Admission`: \"2022-03-29\", `Discharge Date`: \"2022-04-24\"}),\n",
      "(:Patient {id: \"01857\", displayName: \"Valerie CHAVEZ\", type: \"Patient\", Age: 28, `Date of Admission`: \"2020-06-01\", `Discharge Date`: \"2020-06-05\"}),\n",
      "(:Patient {id: \"01904\", displayName: \"Melissa MORGAN\", type: \"Patient\", Age: 45, `Date of Admission`: \"2023-12-20\", `Discharge Date`: \"2024-01-09\"}),\n",
      "(:Patient {id: \"04163\", displayName: \"Shannon ANDERSON\", type: \"Patient\", Age: 47, `Date of Admission`: \"2021-06-11\", `Discharge Date`: \"2021-07-08\"}),\n",
      "(:Patient {id: \"02042\", displayName: \"Sarah MORRIS\", type: \"Patient\", Age: 41, `Date of Admission`: \"2023-06-11\", `Discharge Date`: \"2023-06-13\"}),\n",
      "(:Patient {id: \"04174\", displayName: \"Christopher CORTEZ\", type: \"Patient\", Age: 41, `Date of Admission`: \"2020-06-26\", `Discharge Date`: \"2020-07-23\"}),\n",
      "(:Patient {id: \"01988\", displayName: \"Matthew SHAW\", type: \"Patient\", Age: 30, `Date of Admission`: \"2020-06-25\", `Discharge Date`: \"2020-07-10\"}),\n",
      "(:Patient {id: \"02045\", displayName: \"Jessica EVANS\", type: \"Patient\", Age: 46, `Date of Admission`: \"2021-03-21\", `Discharge Date`: \"2021-04-19\"}),\n",
      "(:Patient {id: \"04285\", displayName: \"Kyle PHAM\", type: \"Patient\", Age: 75, `Date of Admission`: \"2022-06-18\", `Discharge Date`: \"2022-07-13\"}),\n",
      "(:Patient {id: \"02303\", displayName: \"Patrick COX\", type: \"Patient\", Age: 30, `Date of Admission`: \"2022-04-30\", `Discharge Date`: \"2022-05-08\"}),\n",
      "(:Patient {id: \"04168\", displayName: \"Luis AVILA\", type: \"Patient\", Age: 46, `Date of Admission`: \"2019-12-02\", `Discharge Date`: \"2019-12-06\"}),\n",
      "(:Patient {id: \"02004\", displayName: \"Kelly WILLIAMS\", type: \"Patient\", Age: 75, `Date of Admission`: \"2024-03-04\", `Discharge Date`: \"2024-03-18\"}),\n",
      "(:Patient {id: \"02434\", displayName: \"Calvin STOKES\", type: \"Patient\", Age: 81, `Date of Admission`: \"2022-05-14\", `Discharge Date`: \"2022-05-22\"}),\n",
      "(:Patient {id: \"01862\", displayName: \"Priscilla SANDERS\", type: \"Patient\", Age: 38, `Date of Admission`: \"2021-12-08\", `Discharge Date`: \"2021-12-14\"}),\n",
      "(:Patient {id: \"04275\", displayName: \"Morgan DAY\", type: \"Patient\", Age: 43, `Date of Admission`: \"2022-12-19\", `Discharge Date`: \"2022-12-21\"}),\n",
      "(:Patient {id: \"01916\", displayName: \"Willie COX\", type: \"Patient\", Age: 21, `Date of Admission`: \"2020-01-27\", `Discharge Date`: \"2020-02-18\"}),\n",
      "(:Patient {id: \"01911\", displayName: \"John GARCIA\", type: \"Patient\", Age: 35, `Date of Admission`: \"2023-07-24\", `Discharge Date`: \"2023-07-30\"}),\n",
      "(:Patient {id: \"02311\", displayName: \"Edward CLARK\", type: \"Patient\", Age: 72, `Date of Admission`: \"2022-05-17\", `Discharge Date`: \"2022-06-12\"}),\n",
      "(:Patient {id: \"04195\", displayName: \"Chelsey LIU\", type: \"Patient\", Age: 21, `Date of Admission`: \"2020-07-05\", `Discharge Date`: \"2020-07-21\"}),\n",
      "(:Patient {id: \"01973\", displayName: \"Alyssa LITTLE\", type: \"Patient\", Age: 38, `Date of Admission`: \"2024-04-15\", `Discharge Date`: \"2024-05-09\"}),\n",
      "(:Patient {id: \"02351\", displayName: \"Thomas WILLIAMS\", type: \"Patient\", Age: 41, `Date of Admission`: \"2020-12-09\", `Discharge Date`: \"2021-01-02\"}),\n",
      "(:Patient {id: \"02331\", displayName: \"Kimberly EVANS\", type: \"Patient\", Age: 70, `Date of Admission`: \"2020-08-13\", `Discharge Date`: \"2020-09-03\"}),\n",
      "(:Patient {id: \"01962\", displayName: \"Brianna BELL\", type: \"Patient\", Age: 68, `Date of Admission`: \"2022-07-28\", `Discharge Date`: \"2022-08-07\"}),\n",
      "(:Patient {id: \"04367\", displayName: \"Nichole LEE\", type: \"Patient\", Age: 85, `Date of Admission`: \"2021-06-27\", `Discharge Date`: \"2021-07-05\"}),\n",
      "(:Patient {id: \"02027\", displayName: \"Shawn RAMIREZ\", type: \"Patient\", Age: 40, `Date of Admission`: \"2022-04-25\", `Discharge Date`: \"2022-04-29\"}),\n",
      "(:Patient {id: \"02346\", displayName: \"Michael DECKER\", type: \"Patient\", Age: 41, `Date of Admission`: \"2019-06-26\", `Discharge Date`: \"2019-07-10\"}),\n",
      "(:Patient {id: \"01907\", displayName: \"Brenda COLLINS\", type: \"Patient\", Age: 70, `Date of Admission`: \"2021-05-03\", `Discharge Date`: \"2021-06-02\"}),\n",
      "(:Patient {id: \"04334\", displayName: \"Latoya GARCIA\", type: \"Patient\", Age: 62, `Date of Admission`: \"2022-10-15\", `Discharge Date`: \"2022-10-27\"}),\n",
      "(:Patient {id: \"04351\", displayName: \"Cody OLIVER\", type: \"Patient\", Age: 75, `Date of Admission`: \"2019-10-03\", `Discharge Date`: \"2019-10-17\"}),\n",
      "(:Patient {id: \"02355\", displayName: \"Jason CHUNG\", type: \"Patient\", Age: 63, `Date of Admission`: \"2022-12-22\", `Discharge Date`: \"2023-01-04\"}),\n",
      "(:Patient {id: \"04280\", displayName: \"Timothy SIMMONS\", type: \"Patient\", Age: 48, `Date of Admission`: \"2024-01-07\", `Discharge Date`: \"2024-01-28\"}),\n",
      "(:Patient {id: \"04201\", displayName: \"Daniel HOWARD\", type: \"Patient\", Age: 65, `Date of Admission`: \"2022-12-20\", `Discharge Date`: \"2023-01-07\"}),\n",
      "(:Patient {id: \"04321\", displayName: \"Casey TUCKER\", type: \"Patient\", Age: 38, `Date of Admission`: \"2020-11-13\", `Discharge Date`: \"2020-12-02\"}),\n",
      "(:Patient {id: \"04326\", displayName: \"Mark JONES\", type: \"Patient\", Age: 83, `Date of Admission`: \"2019-07-06\", `Discharge Date`: \"2019-07-19\"}),\n",
      "(:Patient {id: \"02288\", displayName: \"Rose LEWIS\", type: \"Patient\", Age: 47, `Date of Admission`: \"2024-01-14\", `Discharge Date`: \"2024-02-08\"}),\n",
      "(:Patient {id: \"04327\", displayName: \"Jennifer JAMES\", type: \"Patient\", Age: 66, `Date of Admission`: \"2023-07-06\", `Discharge Date`: \"2023-07-07\"}),\n",
      "(:Patient {id: \"02097\", displayName: \"Paul ROSS\", type: \"Patient\", Age: 85, `Date of Admission`: \"2023-09-16\", `Discharge Date`: \"2023-10-04\"}),\n",
      "(:Patient {id: \"02018\", displayName: \"Abigail TUCKER\", type: \"Patient\", Age: 66, `Date of Admission`: \"2020-08-10\", `Discharge Date`: \"2020-08-26\"}),\n",
      "(:Patient {id: \"04310\", displayName: \"Jeffrey TAPIA\", type: \"Patient\", Age: 82, `Date of Admission`: \"2021-01-02\", `Discharge Date`: \"2021-01-23\"}),\n",
      "(:Patient {id: \"02056\", displayName: \"Karen FERGUSON\", type: \"Patient\", Age: 57, `Date of Admission`: \"2024-01-24\", `Discharge Date`: \"2024-02-17\"}),\n",
      "(:Patient {id: \"01998\", displayName: \"Holly NELSON\", type: \"Patient\", Age: 50, `Date of Admission`: \"2022-06-20\", `Discharge Date`: \"2022-06-29\"}),\n",
      "(:Patient {id: \"04299\", displayName: \"Ashley TUCKER\", type: \"Patient\", Age: 32, `Date of Admission`: \"2023-05-06\", `Discharge Date`: \"2023-05-26\"}),\n",
      "(:Patient {id: \"01855\", displayName: \"David GRAHAM\", type: \"Patient\", Age: 26, `Date of Admission`: \"2022-08-10\", `Discharge Date`: \"2022-08-30\"}),\n",
      "(:Patient {id: \"01972\", displayName: \"Rebecca FLORES\", type: \"Patient\", Age: 22, `Date of Admission`: \"2024-02-22\", `Discharge Date`: \"2024-03-06\"}),\n",
      "(:Patient {id: \"01833\", displayName: \"Gary REEVES\", type: \"Patient\", Age: 52, `Date of Admission`: \"2022-10-13\", `Discharge Date`: \"2022-10-25\"}),\n",
      "(:Patient {id: \"01905\", displayName: \"Joshua SMITH\", type: \"Patient\", Age: 44, `Date of Admission`: \"2019-10-19\", `Discharge Date`: \"2019-11-06\"}),\n",
      "(:Patient {id: \"04277\", displayName: \"Laura DAVIS\", type: \"Patient\", Age: 56, `Date of Admission`: \"2021-08-02\", `Discharge Date`: \"2021-08-30\"}),\n",
      "(:Patient {id: \"04324\", displayName: \"Andrew EVANS\", type: \"Patient\", Age: 53, `Date of Admission`: \"2019-05-22\", `Discharge Date`: \"2019-06-10\"}),\n",
      "(:Patient {id: \"02064\", displayName: \"Benjamin TAYLOR\", type: \"Patient\", Age: 71, `Date of Admission`: \"2023-11-12\", `Discharge Date`: \"2023-11-13\"}),\n",
      "(:Patient {id: \"02046\", displayName: \"Robert GRANT\", type: \"Patient\", Age: 30, `Date of Admission`: \"2019-05-11\", `Discharge Date`: \"2019-06-01\"}),\n",
      "(:Patient {id: \"02414\", displayName: \"Gregory BROWN\", type: \"Patient\", Age: 24, `Date of Admission`: \"2023-02-20\", `Discharge Date`: \"2023-03-04\"}),\n",
      "(:Patient {id: \"02422\", displayName: \"Robert MIRANDA\", type: \"Patient\", Age: 46, `Date of Admission`: \"2020-07-21\", `Discharge Date`: \"2020-07-26\"}),\n",
      "(:Patient {id: \"04366\", displayName: \"Robert THOMPSON\", type: \"Patient\", Age: 76, `Date of Admission`: \"2020-03-20\", `Discharge Date`: \"2020-03-30\"})\n",
      "MATCH (source {id: \"02399\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02333\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04301\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04196\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01825\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02313\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01854\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04376\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01995\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02403\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04344\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02341\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01897\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01820\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02015\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02424\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01954\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02060\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02100\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02327\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01965\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01811\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02289\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01818\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01963\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01951\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02285\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01798\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02040\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02312\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01964\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02044\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04371\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02016\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01826\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02295\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01882\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01945\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04322\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01939\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01903\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02092\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02012\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04359\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01929\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02308\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01891\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02284\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04199\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01857\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01904\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04163\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02042\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04174\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01988\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02045\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04285\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02303\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04168\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02004\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02434\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01862\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04275\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01916\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01911\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02311\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04195\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01973\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02351\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02331\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01962\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04367\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02027\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02346\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01907\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04334\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04351\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02355\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04280\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04201\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04321\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04326\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02288\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04327\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02097\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02018\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04310\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02056\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01998\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04299\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01855\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01972\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01833\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"01905\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04277\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04324\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02064\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02046\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02414\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"02422\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "MATCH (source {id: \"04366\"}), (target {id: \"Paracetamol\"}) CREATE (source)-[:TOOK_MEDICATION]->(target)\n",
      "****************************************************************************************************\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Get subgraph\n",
    "subset_nodes = np.unique(df.loc[:100, [\"Patient ID\", \"Medication\"]].values).tolist()\n",
    "subG = G.subgraph(subset_nodes).copy()\n",
    "print(subG)\n",
    "\n",
    "# Build CREATE command from subgraph\n",
    "create_command_subG = build_create_command_from_networkx(subG)\n",
    "print(f\"\"\"\n",
    "Cypher CREATE command :\n",
    "* size: {len(create_command_subG.encode('utf-8'))/1024/1000:.4f} MB\\n\n",
    "{100 * '*'}\n",
    "{create_command_subG \\\n",
    "if len(create_command_subG.split(\"\\n\")) < 10000 \\\n",
    "else \"\\n\".join(create_command_subG.split('\\n')[:5]) + \"\\n...\\n\" + \"\\n\".join(create_command_subG.split('\\n')[-5:])}\n",
    "{100 * '*'}\n",
    "\"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "762c66fd-9402-4cae-bda5-0ae932725d26",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "b244bb77-c4a2-4c86-ae37-a173e7b8cf81",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'healthcare_dataset1_subgraph'"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "subgraph_name = f\"{graph_name}_subgraph\"\n",
    "subgraph_name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "9d5cef06-0d4d-4c24-846d-8841e3025e5c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Current change 0\n",
      "CPU times: user 2.71 ms, sys: 0 ns, total: 2.71 ms\n",
      "Wall time: 9.39 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Set graph\n",
    "try:\n",
    "    client.create_graph(subgraph_name)\n",
    "except TuringDBException as e:\n",
    "    print(e)\n",
    "\n",
    "# Set working graph\n",
    "client.set_graph(subgraph_name)\n",
    "\n",
    "# Create a new change on the graph\n",
    "client.checkout()\n",
    "change = client.new_change()\n",
    "print(f\"Current change {change}\")\n",
    "\n",
    "# Checkout into the change\n",
    "client.checkout(change=change)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "b0a2eef7-05c5-4c3f-83ba-359241226b38",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "✓ Split into 1 node chunk(s) and 101 edge chunk(s)\n",
      "\n",
      "Node chunks:\n",
      "  Node chunk 1: 14.8 KB\n",
      "\n",
      "Edge chunks:\n",
      "  Edge chunk 1: 0.1 KB\n",
      "  Edge chunk 2: 0.1 KB\n",
      "  Edge chunk 3: 0.1 KB\n",
      "  Edge chunk 4: 0.1 KB\n",
      "  Edge chunk 5: 0.1 KB\n",
      "  Edge chunk 6: 0.1 KB\n",
      "  Edge chunk 7: 0.1 KB\n",
      "  Edge chunk 8: 0.1 KB\n",
      "  Edge chunk 9: 0.1 KB\n",
      "  Edge chunk 10: 0.1 KB\n",
      "  Edge chunk 11: 0.1 KB\n",
      "  ...\n",
      "CPU times: user 989 μs, sys: 0 ns, total: 989 μs\n",
      "Wall time: 964 μs\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "chunks = split_cypher_commands(create_command_subG, max_size_mb=1)\n",
    "\n",
    "print(f\"✓ Split into {len(chunks['node_chunks'])} node chunk(s) and {len(chunks['edge_chunks'])} edge chunk(s)\")\n",
    "\n",
    "print(\"\\nNode chunks:\")\n",
    "for i, chunk in enumerate(chunks['node_chunks']):\n",
    "    print(f\"  Node chunk {i+1}: {len(chunk.encode('utf-8'))/1024:.1f} KB\")\n",
    "    if i == 10:\n",
    "        print(\"  ...\")\n",
    "        break\n",
    "\n",
    "print(\"\\nEdge chunks:\")\n",
    "for i, chunk in enumerate(chunks['edge_chunks']):\n",
    "    print(f\"  Edge chunk {i+1}: {len(chunk.encode('utf-8'))/1024:.1f} KB\")\n",
    "    if i == 10:\n",
    "        print(\"  ...\")\n",
    "        break"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "145a9be4-0bc5-4c67-bc3e-738e473b9ea9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Executing query on TuringDB...\n",
      "✓ Split into 1 node chunk(s) and 101 edge chunk(s)\n",
      "\n",
      "Node chunks:\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "b65e8058226c4dda812ed78035424b03",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "  0%|          | 0/1 [00:00<?, ?it/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "✓ 1 node chunks done\n",
      "\n",
      "Edge chunks:\n"
     ]
    },
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "e35197d14a1543aaab29446ff83bd54b",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "  0%|          | 0/101 [00:00<?, ?it/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "✓ 101 edge chunks done\n",
      "\n",
      "✓ Graph created successfully in 0.09 seconds\n",
      "\n",
      "✓ Changes successfully submitted in 0.05 seconds\n",
      "CPU times: user 90.9 ms, sys: 8.22 ms, total: 99.1 ms\n",
      "Wall time: 141 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Run CREATE command\n",
    "print(\"\\nExecuting query on TuringDB...\")\n",
    "start_time = time.time()\n",
    "\n",
    "print(f\"✓ Split into {len(chunks['node_chunks'])} node chunk(s) and {len(chunks['edge_chunks'])} edge chunk(s)\")\n",
    "\n",
    "# CREATE nodes\n",
    "print(\"\\nNode chunks:\")\n",
    "for i, chunk in enumerate(tqdm(chunks['node_chunks'])):\n",
    "    result = client.query(chunk)\n",
    "# Commit the change\n",
    "client.query(\"COMMIT\")\n",
    "print(f\"✓ {len(chunks['node_chunks'])} node chunks done\")\n",
    "\n",
    "# CREATE edges\n",
    "print(\"\\nEdge chunks:\")\n",
    "for i, chunk in enumerate(tqdm(chunks['edge_chunks'])):\n",
    "    result = client.query(chunk)\n",
    "# Commit the change\n",
    "client.query(\"COMMIT\")\n",
    "print(f\"✓ {len(chunks['edge_chunks'])} edge chunks done\")\n",
    "\n",
    "execution_time = time.time() - start_time\n",
    "print(f\"\\n✓ Graph created successfully in {execution_time:.2f} seconds\")\n",
    "\n",
    "# Submit changes\n",
    "start_time = time.time()\n",
    "client.query(\"CHANGE SUBMIT\")\n",
    "execution_time = time.time() - start_time\n",
    "print(f\"\\n✓ Changes successfully submitted in {execution_time:.2f} seconds\")\n",
    "\n",
    "# Checkout into main\n",
    "client.checkout()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4e8f5630-0f4e-400a-a5cf-fd68b07fdac0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "c1df39dd-70ec-484a-a3b4-1ca025fbcbef",
   "metadata": {},
   "source": [
    "<div class=\"alert alert-block alert-info\">\n",
    "    <h2>\n",
    "        You can visualise the subgraph directly in the notebook below. For more details on nodes and edges, you can go to TuringDB visualizer (running on your instance)\n",
    "    </h2>\n",
    "</div>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5368ecc0-cdb6-462e-9660-07d39309061b",
   "metadata": {},
   "source": [
    "<div class=\"alert alert-block alert-info\">\n",
    "    <h2>\n",
    "        Visualize your graph in TuringDB Graph Visualizer ! Now that your instance is running:\n",
    "    </h2>\n",
    "    <h3>\n",
    "        <ul>\n",
    "            <li>Go to <a href=\"https://console.turingdb.ai/databases\">TuringDB Console - Database Instances</a></li>\n",
    "            <li>In your current instance panel, click on \"Open Visualizer\" button</li>\n",
    "            <li>Visualizer opens, now you can choose your graph in the dropdown menu at the top-right corner</li>\n",
    "        </ul>\n",
    "        You can then play with your graph and visualize the nodes you want !\n",
    "    </h3>\n",
    "</div>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "b30a6f48-1481-4891-a9f9-755fc543283d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Warning: When  cdn_resources is 'local' jupyter notebook has issues displaying graphics on chrome/safari. Use cdn_resources='in_line' or cdn_resources='remote' if you have issues viewing graphics in a notebook.\n",
      "healthcare_dataset_subgraph.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"750px\"\n",
       "            src=\"healthcare_dataset_subgraph.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7bf2b44a8c20>"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from pyvis.network import Network\n",
    "\n",
    "net = Network(\n",
    "    height=\"750px\",\n",
    "    width=\"100%\",\n",
    "    notebook=True,\n",
    "    bgcolor=\"#f8f9fa\",\n",
    "    font_color=\"#212529\",\n",
    "    directed=True,\n",
    ")\n",
    "\n",
    "# Node type colors\n",
    "type_colors = {\"Patient\": \"#3498db\", \"Medication\": \"#e74c3c\"}\n",
    "\n",
    "for node, data in subG.nodes(data=True):\n",
    "    node_type = data.get(\"type\", \"Unknown\")\n",
    "    color = type_colors.get(node_type, \"#7f8c8d\")\n",
    "\n",
    "    label = data.get(\"displayName\", str(node))\n",
    "\n",
    "    # Build title based on node type\n",
    "    if node_type == \"Patient\":\n",
    "        title = f\"<b>{label}</b><br>Age: {data.get('Age', 'N/A')}<br>Admitted: {data.get('Date of Admission', 'N/A')}<br>Discharged: {data.get('Discharge Date', 'N/A')}\"\n",
    "    else:\n",
    "        title = f\"<b>{label}</b><br>Type: {node_type}\"\n",
    "\n",
    "    net.add_node(node, label=label, color=color, title=title, size=25)\n",
    "\n",
    "# Edge colors by type\n",
    "edge_colors = {\"took_medication\": \"#27ae60\"}\n",
    "\n",
    "for source, target, data in subG.edges(data=True):\n",
    "    edge_type = data.get(\"type\", \"\")\n",
    "    color = edge_colors.get(edge_type, \"#95a5a6\")\n",
    "    net.add_edge(source, target, title=edge_type, color=color, width=3)\n",
    "\n",
    "net.toggle_physics(True)\n",
    "net.show(f\"{example_name}_subgraph.html\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ff9c2681-23d6-4e4b-a5ac-874986683a7e",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bfb09e77-3164-4112-bc1e-f22b8381b72e",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6118ce1d-bd8f-4bea-96fe-0f49cd40aa1a",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "3e0a3918-7e0e-4a05-8329-29d9270389c6",
   "metadata": {},
   "source": [
    "# Use LLM to generate Cypher query"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "08de7092-1063-492b-8968-35733a15c089",
   "metadata": {},
   "source": [
    "Before running this section, create a `.env` file in the project root with your API keys:\n",
    "\n",
    "```env\n",
    "ANTHROPIC_API_KEY=your_key_here\n",
    "OPENAI_API_KEY=your_key_here\n",
    "MISTRAL_API_KEY=your_key_here"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "4c86faff-5458-49f2-9407-21685eacbd4b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "# Load environment variables from .env file\n",
    "load_dotenv()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "314991e3-3412-4f35-95f2-f031f2c88b90",
   "metadata": {},
   "outputs": [],
   "source": [
    "api_keys = {\n",
    "    \"Anthropic\": os.getenv(\"ANTHROPIC_API_KEY\"),\n",
    "    \"Mistral\": os.getenv(\"MISTRAL_API_KEY\"),\n",
    "    \"OpenAI\": os.getenv(\"OPENAI_API_KEY\"),\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "id": "2cee46ad-a561-4971-a525-f65de4ce6a4c",
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Build system prompt with TuringDB schema and examples\"\"\"\n",
    "\n",
    "turingdb_cypher_system_prompt = \"\"\"\n",
    "You are an expert at converting natural language questions into TuringDB queries.\n",
    "\n",
    "Your task is to generate syntactically correct TuringDB queries based on natural language input.\n",
    "\n",
    "VERY IMPORTANT - TuringDB Syntax Guidelines:\n",
    "1. Return ONLY the TuringDB query, no explanations or markdown formatting\n",
    "2. Use MATCH, CREATE and WHERE operations only\n",
    "3. Nodes: (n:Label {property = \"value\"}) or (n:Label {property: value})\n",
    "4. Edges: Use DIRECTED syntax with ->\n",
    "5. Pattern matching: MATCH (n)-[e]->(m)\n",
    "6. Property matching: Use = operator for exact matching\n",
    "7. Multiple constraints: (n:Person:Engineer {name = \"John\", age = 30})\n",
    "8. Return all matched entities: RETURN n, e, m or use RETURN * for all\n",
    "9. Filter using WHERE clause: MATCH (n:Person) WHERE n.name = 'John' RETURN n.firstname, n.lastname\n",
    "\n",
    "VERY IMPORTANT - FORBIDDEN in TuringDB:\n",
    "- Do NOT use AS aliases\n",
    "- Do NOT use LIMIT, SKIP clauses\n",
    "- Do NOT use WITH clauses\n",
    "- Do NOT use CALL (except for metaqueries)\n",
    "- Do NOT use toLower() or other functions\n",
    "\n",
    "Supported TuringDB Operations:\n",
    "- MATCH queries: MATCH (n:Label)-[e:Type]->(m) RETURN n, m\n",
    "- CREATE queries: CREATE (n:Label{property=\"value\"})-[e:Type]->(m:Label)\n",
    "- Metaqueries: CALL db.propertyTypes(), CALL db.labels(), CALL db.edgeTypes()\n",
    "- Property types: String (\"text\" or `text`), Boolean (true/false), Integer (20), Double (20.5)\n",
    "\n",
    "Examples for few-shot learning:\n",
    "- Find all persons: MATCH (n:Person) RETURN n\n",
    "- Find connections: MATCH (n:Person)-[e]->(m:Person) RETURN n, e, m\n",
    "- Create person: CREATE (n:Person{name=\"John\", age=30})\n",
    "- Match person with specific name: MATCH (p:Person) WHERE p.name = \"John\" RETURN p\n",
    "- Path with 1 hop between Station Paddington and Blackfriars:  MATCH (start:Station{displayName:\"Paddington\"})-[e1:CONNECTED]->(end:Station{displayName=\"Blackfriars\"}) RETURN start, start.displayName, start.Note, e1.Line, end, end.displayName, end.Note\n",
    "- Path with 2 hops between Station Paddington and Blackfriars: MATCH (start:Station{displayName:\"Paddington\"})-[e1:CONNECTED]->(s1:Station)-[e2:CONNECTED]->(end:Station{displayName=\"Blackfriars\"}) RETURN start, start.displayName, start.Note, e1.Line, s1, s1.displayName, s1.Note, e2.Line, end, end.displayName, end.Note\n",
    "- Path with 8 hops between Station Paddington and Blackfriars: MATCH (start:Station{displayName:\"Paddington\"})-[e1:CONNECTED]->(s1:Station)-[e2:CONNECTED]->(s2:Station)-[e3:CONNECTED]->(s3:Station)-[e4:CONNECTED]->(s4:Station)-[e5:CONNECTED]->(s5:Station)-[e6:CONNECTED]->(s6:Station)-[e7:CONNECTED]->(s7:Station)-[e8:CONNECTED]->(end:Station{displayName=\"Blackfriars\"}) RETURN start, start.displayName, start.Note, e1.Line, s1, s1.displayName, s1.Note, e2.Line, s2, s2.displayName, s2.Note, e3.Line, s3, s3.displayName, s3.Note, e4.Line, s4, s4.displayName, s4.Note, e5.Line, s5, s5.displayName, s5.Note, e6.Line, s6, s6.displayName, s6.Note, e7.Line, s7, s7.displayName, s7.Note, e8.Line, end, end.displayName, end.Note\n",
    "- Find all Chinese providers and what they supply: MATCH (n{provider_country:\"CHN\"}) RETURN n, n.provider_name, n.displayName, n.share_provided, n.type\n",
    "- Find all deposition tools and their types: MATCH (specific)-[e:IS_TYPE_OF]->(general:Tool_Resource{displayName:\"Deposition tools\"}) RETURN specific, specific.displayName, specific.provider_name, e, general, general.displayName\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e91d8148-4025-41d8-a677-ce2959c88384",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 48,
   "id": "bf4d181b-f913-4862-b8bb-2530a58f3aac",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get subset of CREATE command to avoid exceeding context window\n",
    "create_command_subset = create_command_subG.split(\"\\n\")[:5] + create_command_subG.split(\"\\n\")[-5:]\n",
    "\n",
    "# Create system_prompt\n",
    "system_prompt = f\"\"\"\n",
    "TuringDB Cypher prompt :\n",
    "{turingdb_cypher_system_prompt}\n",
    "\n",
    "Here is a subset of the CREATE command used to create the graph, this way you know graph structure.\n",
    "Only a subset is passed because the whole command is to long :\n",
    "{create_command_subset}\n",
    "\n",
    "Here is also the output of \"CALL LABELS ()\" command, showing the different node types of the graph :\n",
    "{client.query(\"CALL db.labels()\")}\n",
    "\n",
    "Here is also the output of \"CALL EDGETYPES ()\" command, showing the different edge types of the graph :\n",
    "{client.query(\"CALL db.edgeTypes()\")}\n",
    "\n",
    "Very important :\n",
    "- You MUST follow current TuringDB Syntax Guidelines\n",
    "- You MUST NOT USE what is FORBIDDEN in TuringDB\n",
    "- By default, RETURN ALL THE MATCHED NODES AND EDGES AND THEIR PROPERTIES in the RETURN section (except contrary demand from user)\n",
    "- Use the correct node and edge properties name in the MATCH section.\n",
    "- Use the correct node and edge properties name in the RETURN section.\n",
    "- Pay attention to which properties come from nodes or edges, to create a functioning query\n",
    "- Pay attention to lower and uppercases in properties\n",
    "- If some properties contain spaces, be careful to wrap them\n",
    "\n",
    "Give me the query FOLLOWING TURINGDB GUIDELINES AND NOT USING WHAT IS FORBIDDEN for this specific question :\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "967d5b44-cf42-48b4-8104-549f06278cc0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "485b82ae-a613-4804-9fef-fb436f72c7e0",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Set natural language query\n",
    "question = \"\"\"\n",
    "Find all patients who took Paracetamol\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "650b7a05-d319-432d-b1b9-740fcd12ebea",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "cypher_query : MATCH (p:Patient)-[e:TOOK_MEDICATION]->(m:Medication{displayName:\"Paracetamol\"}) RETURN p, e, m, p.id, p.displayName, p.Age, p.`Date of Admission`, p.`Discharge Date`\n",
      "CPU times: user 183 ms, sys: 15.1 ms, total: 198 ms\n",
      "Wall time: 2.09 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "provider = \"Anthropic\"\n",
    "\n",
    "cypher_query = natural_language_to_cypher(\n",
    "    question=question,\n",
    "    system_prompt=system_prompt,\n",
    "    provider=provider,\n",
    "    api_key=api_keys[provider],\n",
    ")\n",
    "print(f\"cypher_query : {cypher_query}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "08c2d3a0-be98-434c-998f-04a9f82b21bb",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>p</th>\n",
       "      <th>e</th>\n",
       "      <th>m</th>\n",
       "      <th>p.id</th>\n",
       "      <th>p.displayName</th>\n",
       "      <th>p.Age</th>\n",
       "      <th>p.`Date of Admission`</th>\n",
       "      <th>p.`Discharge Date`</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>101</td>\n",
       "      <td>01907</td>\n",
       "      <td>Brenda COLLINS</td>\n",
       "      <td>70</td>\n",
       "      <td>2021-05-03</td>\n",
       "      <td>2021-06-02</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>1</td>\n",
       "      <td>101</td>\n",
       "      <td>02346</td>\n",
       "      <td>Michael DECKER</td>\n",
       "      <td>41</td>\n",
       "      <td>2019-06-26</td>\n",
       "      <td>2019-07-10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>2</td>\n",
       "      <td>101</td>\n",
       "      <td>02027</td>\n",
       "      <td>Shawn RAMIREZ</td>\n",
       "      <td>40</td>\n",
       "      <td>2022-04-25</td>\n",
       "      <td>2022-04-29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>3</td>\n",
       "      <td>101</td>\n",
       "      <td>04367</td>\n",
       "      <td>Nichole LEE</td>\n",
       "      <td>85</td>\n",
       "      <td>2021-06-27</td>\n",
       "      <td>2021-07-05</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>4</td>\n",
       "      <td>101</td>\n",
       "      <td>01962</td>\n",
       "      <td>Brianna BELL</td>\n",
       "      <td>68</td>\n",
       "      <td>2022-07-28</td>\n",
       "      <td>2022-08-07</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>96</td>\n",
       "      <td>96</td>\n",
       "      <td>101</td>\n",
       "      <td>02312</td>\n",
       "      <td>Cathy RODRIGUEZ</td>\n",
       "      <td>39</td>\n",
       "      <td>2023-08-13</td>\n",
       "      <td>2023-08-14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>97</td>\n",
       "      <td>97</td>\n",
       "      <td>101</td>\n",
       "      <td>02040</td>\n",
       "      <td>Benjamin BERNARD</td>\n",
       "      <td>76</td>\n",
       "      <td>2022-06-29</td>\n",
       "      <td>2022-07-13</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>98</td>\n",
       "      <td>98</td>\n",
       "      <td>101</td>\n",
       "      <td>01798</td>\n",
       "      <td>Victoria CRAWFORD</td>\n",
       "      <td>34</td>\n",
       "      <td>2021-01-23</td>\n",
       "      <td>2021-02-19</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99</th>\n",
       "      <td>99</td>\n",
       "      <td>99</td>\n",
       "      <td>101</td>\n",
       "      <td>02285</td>\n",
       "      <td>Mr. JAMES</td>\n",
       "      <td>80</td>\n",
       "      <td>2023-02-01</td>\n",
       "      <td>2023-02-24</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>100</th>\n",
       "      <td>100</td>\n",
       "      <td>100</td>\n",
       "      <td>101</td>\n",
       "      <td>01951</td>\n",
       "      <td>Timothy GEORGE</td>\n",
       "      <td>67</td>\n",
       "      <td>2022-05-01</td>\n",
       "      <td>2022-05-23</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>101 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       p    e    m   p.id      p.displayName  p.Age p.`Date of Admission`  \\\n",
       "0      0    0  101  01907     Brenda COLLINS     70            2021-05-03   \n",
       "1      1    1  101  02346     Michael DECKER     41            2019-06-26   \n",
       "2      2    2  101  02027      Shawn RAMIREZ     40            2022-04-25   \n",
       "3      3    3  101  04367        Nichole LEE     85            2021-06-27   \n",
       "4      4    4  101  01962       Brianna BELL     68            2022-07-28   \n",
       "..   ...  ...  ...    ...                ...    ...                   ...   \n",
       "96    96   96  101  02312    Cathy RODRIGUEZ     39            2023-08-13   \n",
       "97    97   97  101  02040   Benjamin BERNARD     76            2022-06-29   \n",
       "98    98   98  101  01798  Victoria CRAWFORD     34            2021-01-23   \n",
       "99    99   99  101  02285          Mr. JAMES     80            2023-02-01   \n",
       "100  100  100  101  01951     Timothy GEORGE     67            2022-05-01   \n",
       "\n",
       "    p.`Discharge Date`  \n",
       "0           2021-06-02  \n",
       "1           2019-07-10  \n",
       "2           2022-04-29  \n",
       "3           2021-07-05  \n",
       "4           2022-08-07  \n",
       "..                 ...  \n",
       "96          2023-08-14  \n",
       "97          2022-07-13  \n",
       "98          2021-02-19  \n",
       "99          2023-02-24  \n",
       "100         2022-05-23  \n",
       "\n",
       "[101 rows x 8 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "df_path = client.query(cypher_query)\n",
    "if df_path.empty:\n",
    "    print(\"--> No result found\\n\")\n",
    "else:\n",
    "    display(df_path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6da60b5f-2fae-44b8-95d2-bb80fb4094b0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "b2fed7d7-feac-469f-bf30-5f35b66acdee",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "28c47571-a3da-4550-820b-aa73a1eb0d73",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "0c6a009d-6dc7-4269-98ed-9ffc2db579cb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Notebook finished !\n"
     ]
    }
   ],
   "source": [
    "print(\"Notebook finished !\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "08ddb6e0-04d3-4a4e-954d-da7ec29db2b6",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5983e63d-bb19-4902-bf65-971c706470d7",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a6708e53-5076-406c-a58c-4f82c369858b",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
