{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "db6a6d85-4ba4-438b-944e-b811120df13a",
   "metadata": {},
   "source": [
    "<div class=\"alert alert-block alert-success\">\n",
    "    <h1>\n",
    "        Example notebook - London Tube\n",
    "    </h1>\n",
    "    <p>\n",
    "        Link to dataset : <a href=\"https://drive.google.com/drive/folders/1Tfl7D5Khh1uiQDMy20XngdFggaGyj6Vy?usp=drive_link\">Google Drive</a>\n",
    "    </p>\n",
    "</div>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "34b987fa-2bdf-452b-8ee5-0ca12f5e3dff",
   "metadata": {},
   "source": [
    "# Import modules and functions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "26a28df1-3a9e-47d6-b75e-b85d145eb3bc",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import pandas as pd\n",
    "import re\n",
    "from IPython.display import display, Markdown\n",
    "import numpy as np\n",
    "import time\n",
    "from tqdm.auto import tqdm\n",
    "\n",
    "from turingdb_examples.graph import (\n",
    "    create_graph_from_df,\n",
    "    networkx_to_jsonl\n",
    ")\n",
    "from turingdb_examples.llm import query_llm, natural_language_to_cypher"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "9a8d77f0-4d29-409d-9bd8-20a3753e0c49",
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext autoreload\n",
    "%autoreload 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d7a98400-1aaf-4681-aa78-c600a27e92c7",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e1968381-79ad-4712-a9c2-12a6e1928185",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "446eb53a-4927-4030-bd13-7e3cc7c8346c",
   "metadata": {},
   "source": [
    "# Check data files are available"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "f1d4687b-045f-44de-8396-e2c0ba2e77dd",
   "metadata": {},
   "outputs": [],
   "source": [
    "example_name = \"london_transport_TfL\"\n",
    "path_data = f\"{os.getcwd()}/data/{example_name}\"\n",
    "if not os.path.exists(path_data):\n",
    "    raise ValueError(f\"{path_data} does not exists\")\n",
    "\n",
    "list_csv_files = sorted(os.listdir(path_data))\n",
    "if not all([file in list_csv_files for file in [\n",
    "    \"TfL_london_transport_tube.csv\",\n",
    "    \"TfL_london_transport_tube_sightseeing.csv\",\n",
    "    \"TfL_london_transport_tube_stations.csv\",\n",
    "]]):  \n",
    "    raise ValueError(\n",
    "        f\"{filename} csv file is not available in {path_data}\"\n",
    "    )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "029d82a2-3899-45e4-8036-443c6085e037",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7d2a3403-3541-4456-a664-789eb5d5477d",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "1a6ee38f-72d6-4329-a63f-cc5aa24c6879",
   "metadata": {},
   "source": [
    "# Import and format data"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "db473c32-c474-4dee-a870-9266ff22b530",
   "metadata": {},
   "source": [
    "## Import dataframe containing linkage between each station"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "8e4c11e7-15da-4b8d-bf2e-63c97ecb9d32",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Line</th>\n",
       "      <th>Order</th>\n",
       "      <th>From_Station</th>\n",
       "      <th>To_Station</th>\n",
       "      <th>Total</th>\n",
       "      <th>PM Peak</th>\n",
       "      <th>Evening</th>\n",
       "      <th>Late</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bakerloo</td>\n",
       "      <td>1</td>\n",
       "      <td>Elephant &amp; Castle</td>\n",
       "      <td>Lambeth North</td>\n",
       "      <td>13.432</td>\n",
       "      <td>4.118</td>\n",
       "      <td>1.288</td>\n",
       "      <td>398.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Bakerloo</td>\n",
       "      <td>2</td>\n",
       "      <td>Lambeth North</td>\n",
       "      <td>Waterloo</td>\n",
       "      <td>18.597</td>\n",
       "      <td>5.718</td>\n",
       "      <td>1.916</td>\n",
       "      <td>580.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Bakerloo</td>\n",
       "      <td>3</td>\n",
       "      <td>Waterloo</td>\n",
       "      <td>Embankment</td>\n",
       "      <td>46.020</td>\n",
       "      <td>13.746</td>\n",
       "      <td>4.609</td>\n",
       "      <td>1.466</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Bakerloo</td>\n",
       "      <td>4</td>\n",
       "      <td>Embankment</td>\n",
       "      <td>Charing Cross</td>\n",
       "      <td>55.475</td>\n",
       "      <td>17.155</td>\n",
       "      <td>5.959</td>\n",
       "      <td>1.940</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bakerloo</td>\n",
       "      <td>5</td>\n",
       "      <td>Charing Cross</td>\n",
       "      <td>Piccadilly Circus</td>\n",
       "      <td>63.929</td>\n",
       "      <td>20.112</td>\n",
       "      <td>7.712</td>\n",
       "      <td>3.035</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>859</th>\n",
       "      <td>Victoria</td>\n",
       "      <td>13</td>\n",
       "      <td>Pimlico</td>\n",
       "      <td>Vauxhall</td>\n",
       "      <td>94.853</td>\n",
       "      <td>37.711</td>\n",
       "      <td>24.553</td>\n",
       "      <td>10.574</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>860</th>\n",
       "      <td>Victoria</td>\n",
       "      <td>14</td>\n",
       "      <td>Vauxhall</td>\n",
       "      <td>Stockwell</td>\n",
       "      <td>66.561</td>\n",
       "      <td>27.117</td>\n",
       "      <td>18.342</td>\n",
       "      <td>7.992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>861</th>\n",
       "      <td>Victoria</td>\n",
       "      <td>15</td>\n",
       "      <td>Stockwell</td>\n",
       "      <td>Brixton</td>\n",
       "      <td>41.178</td>\n",
       "      <td>15.972</td>\n",
       "      <td>11.553</td>\n",
       "      <td>5.361</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>862</th>\n",
       "      <td>Waterloo &amp; City</td>\n",
       "      <td>1</td>\n",
       "      <td>Waterloo</td>\n",
       "      <td>Bank and Monument</td>\n",
       "      <td>5.554</td>\n",
       "      <td>5.197</td>\n",
       "      <td>1.465</td>\n",
       "      <td>386.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>863</th>\n",
       "      <td>Waterloo &amp; City</td>\n",
       "      <td>1</td>\n",
       "      <td>Bank and Monument</td>\n",
       "      <td>Waterloo</td>\n",
       "      <td>6.348</td>\n",
       "      <td>18.237</td>\n",
       "      <td>6.517</td>\n",
       "      <td>1.374</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>864 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                Line  Order        From_Station         To_Station   Total  \\\n",
       "0           Bakerloo      1  Elephant & Castle       Lambeth North  13.432   \n",
       "1           Bakerloo      2       Lambeth North          Waterloo   18.597   \n",
       "2           Bakerloo      3           Waterloo          Embankment  46.020   \n",
       "3           Bakerloo      4          Embankment     Charing Cross   55.475   \n",
       "4           Bakerloo      5      Charing Cross   Piccadilly Circus  63.929   \n",
       "..               ...    ...                 ...                ...     ...   \n",
       "859         Victoria     13             Pimlico          Vauxhall   94.853   \n",
       "860         Victoria     14           Vauxhall           Stockwell  66.561   \n",
       "861         Victoria     15           Stockwell           Brixton   41.178   \n",
       "862  Waterloo & City      1           Waterloo   Bank and Monument   5.554   \n",
       "863  Waterloo & City      1   Bank and Monument          Waterloo    6.348   \n",
       "\n",
       "     PM Peak     Evening        Late  \n",
       "0         4.118       1.288  398.000  \n",
       "1         5.718       1.916  580.000  \n",
       "2        13.746       4.609    1.466  \n",
       "3        17.155       5.959    1.940  \n",
       "4        20.112       7.712    3.035  \n",
       "..          ...         ...      ...  \n",
       "859      37.711      24.553   10.574  \n",
       "860      27.117      18.342    7.992  \n",
       "861      15.972      11.553    5.361  \n",
       "862       5.197       1.465  386.000  \n",
       "863      18.237       6.517    1.374  \n",
       "\n",
       "[864 rows x 8 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Number of unique stations: 266\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Line</th>\n",
       "      <th>Order</th>\n",
       "      <th>From_Station</th>\n",
       "      <th>To_Station</th>\n",
       "      <th>Total</th>\n",
       "      <th>PM Peak</th>\n",
       "      <th>Evening</th>\n",
       "      <th>Late</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bakerloo</td>\n",
       "      <td>1</td>\n",
       "      <td>Elephant &amp; Castle</td>\n",
       "      <td>Lambeth North</td>\n",
       "      <td>13.432</td>\n",
       "      <td>4.118</td>\n",
       "      <td>1.288</td>\n",
       "      <td>398.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Bakerloo</td>\n",
       "      <td>2</td>\n",
       "      <td>Lambeth North</td>\n",
       "      <td>Waterloo</td>\n",
       "      <td>18.597</td>\n",
       "      <td>5.718</td>\n",
       "      <td>1.916</td>\n",
       "      <td>580.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Bakerloo</td>\n",
       "      <td>3</td>\n",
       "      <td>Waterloo</td>\n",
       "      <td>Embankment</td>\n",
       "      <td>46.020</td>\n",
       "      <td>13.746</td>\n",
       "      <td>4.609</td>\n",
       "      <td>1.466</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Bakerloo</td>\n",
       "      <td>4</td>\n",
       "      <td>Embankment</td>\n",
       "      <td>Charing Cross</td>\n",
       "      <td>55.475</td>\n",
       "      <td>17.155</td>\n",
       "      <td>5.959</td>\n",
       "      <td>1.940</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bakerloo</td>\n",
       "      <td>5</td>\n",
       "      <td>Charing Cross</td>\n",
       "      <td>Piccadilly Circus</td>\n",
       "      <td>63.929</td>\n",
       "      <td>20.112</td>\n",
       "      <td>7.712</td>\n",
       "      <td>3.035</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>859</th>\n",
       "      <td>Victoria</td>\n",
       "      <td>13</td>\n",
       "      <td>Pimlico</td>\n",
       "      <td>Vauxhall</td>\n",
       "      <td>94.853</td>\n",
       "      <td>37.711</td>\n",
       "      <td>24.553</td>\n",
       "      <td>10.574</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>860</th>\n",
       "      <td>Victoria</td>\n",
       "      <td>14</td>\n",
       "      <td>Vauxhall</td>\n",
       "      <td>Stockwell</td>\n",
       "      <td>66.561</td>\n",
       "      <td>27.117</td>\n",
       "      <td>18.342</td>\n",
       "      <td>7.992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>861</th>\n",
       "      <td>Victoria</td>\n",
       "      <td>15</td>\n",
       "      <td>Stockwell</td>\n",
       "      <td>Brixton</td>\n",
       "      <td>41.178</td>\n",
       "      <td>15.972</td>\n",
       "      <td>11.553</td>\n",
       "      <td>5.361</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>862</th>\n",
       "      <td>Waterloo &amp; City</td>\n",
       "      <td>1</td>\n",
       "      <td>Waterloo</td>\n",
       "      <td>Bank &amp; Monument</td>\n",
       "      <td>5.554</td>\n",
       "      <td>5.197</td>\n",
       "      <td>1.465</td>\n",
       "      <td>386.000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>863</th>\n",
       "      <td>Waterloo &amp; City</td>\n",
       "      <td>1</td>\n",
       "      <td>Bank &amp; Monument</td>\n",
       "      <td>Waterloo</td>\n",
       "      <td>6.348</td>\n",
       "      <td>18.237</td>\n",
       "      <td>6.517</td>\n",
       "      <td>1.374</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>714 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                Line  Order       From_Station         To_Station   Total  \\\n",
       "0           Bakerloo      1  Elephant & Castle      Lambeth North  13.432   \n",
       "1           Bakerloo      2      Lambeth North           Waterloo  18.597   \n",
       "2           Bakerloo      3           Waterloo         Embankment  46.020   \n",
       "3           Bakerloo      4         Embankment      Charing Cross  55.475   \n",
       "4           Bakerloo      5      Charing Cross  Piccadilly Circus  63.929   \n",
       "..               ...    ...                ...                ...     ...   \n",
       "859         Victoria     13            Pimlico           Vauxhall  94.853   \n",
       "860         Victoria     14           Vauxhall          Stockwell  66.561   \n",
       "861         Victoria     15          Stockwell            Brixton  41.178   \n",
       "862  Waterloo & City      1           Waterloo    Bank & Monument   5.554   \n",
       "863  Waterloo & City      1    Bank & Monument           Waterloo   6.348   \n",
       "\n",
       "     PM Peak     Evening        Late  \n",
       "0         4.118       1.288  398.000  \n",
       "1         5.718       1.916  580.000  \n",
       "2        13.746       4.609    1.466  \n",
       "3        17.155       5.959    1.940  \n",
       "4        20.112       7.712    3.035  \n",
       "..          ...         ...      ...  \n",
       "859      37.711      24.553   10.574  \n",
       "860      27.117      18.342    7.992  \n",
       "861      15.972      11.553    5.361  \n",
       "862       5.197       1.465  386.000  \n",
       "863      18.237       6.517    1.374  \n",
       "\n",
       "[714 rows x 8 columns]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_link_stations = pd.read_csv(\n",
    "    f\"{path_data}/TfL_london_transport_tube.csv\", decimal=\",\"\n",
    ")\n",
    "display(df_link_stations)\n",
    "df_link_stations = df_link_stations.apply(\n",
    "    lambda x: x.str.strip() if x.dtype == \"object\" else x\n",
    ")\n",
    "\n",
    "# Remove two unrelevant lines 'Docklands Light Railway' and 'East London'\n",
    "df_link_stations = df_link_stations[~df_link_stations[\"Line\"].isin(['Docklands Light Railway', 'East London'])]\n",
    "\n",
    "# Replace all \"and\" by \"&\" in all station names \n",
    "df_link_stations[\"From_Station\"] = df_link_stations[\"From_Station\"].str.replace(\" and \", \" & \")\n",
    "df_link_stations[\"To_Station\"] = df_link_stations[\"To_Station\"].str.replace(\" and \", \" & \")\n",
    "\n",
    "# Replace \"Bank\" by \"Bank & Monument\" for convenience\n",
    "df_link_stations[\"From_Station\"] = df_link_stations[\"From_Station\"].str.replace(\"^Bank$\", \"Bank & Monument\", regex=True)\n",
    "df_link_stations[\"To_Station\"] = df_link_stations[\"To_Station\"].str.replace(\"^Bank$\", \"Bank & Monument\", regex=True)\n",
    "\n",
    "# Remove (B) and (C) from Edgware Road for convenience\n",
    "df_link_stations[\"From_Station\"] = df_link_stations[\"From_Station\"].str.replace(r\" \\([B|C]\\)\", \"\", regex=True)\n",
    "df_link_stations[\"To_Station\"] = df_link_stations[\"To_Station\"].str.replace(r\" \\([B|C]\\)\", \"\", regex=True)\n",
    "\n",
    "# Add spaces in \"Heathrow Terminals 123\"\n",
    "df_link_stations[\"From_Station\"] = df_link_stations[\"From_Station\"].str.replace(\"Heathrow Terminals 123\", \"Heathrow Terminals 1 2 3\", regex=False)\n",
    "df_link_stations[\"To_Station\"] = df_link_stations[\"To_Station\"].str.replace(\"Heathrow Terminals 123\", \"Heathrow Terminals 1 2 3\", regex=False)\n",
    "\n",
    "# Unique stations\n",
    "unique_stations = list(np.unique(df_link_stations[[\"From_Station\", \"To_Station\"]].values.flatten()))\n",
    "print(f\"Number of unique stations: {len(unique_stations)}\")\n",
    "\n",
    "df_link_stations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f5b6b253-dc6c-4371-b8ed-a6ef9bd10edf",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "8da9ad91-8ea7-4d82-9213-f61f19dd5ee0",
   "metadata": {},
   "source": [
    "## Import dataframe containing station information"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "bd52d85a-cafa-423f-a1ac-8c7db8387ef6",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Station</th>\n",
       "      <th>OS X</th>\n",
       "      <th>OS Y</th>\n",
       "      <th>Latitude</th>\n",
       "      <th>Longitude</th>\n",
       "      <th>Zone</th>\n",
       "      <th>Postcode</th>\n",
       "      <th>Zone_original</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Abbey Road</td>\n",
       "      <td>539081</td>\n",
       "      <td>183352</td>\n",
       "      <td>51.531952</td>\n",
       "      <td>0.003723</td>\n",
       "      <td>3</td>\n",
       "      <td>E15 3NB</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Abbey Wood</td>\n",
       "      <td>547297</td>\n",
       "      <td>179002</td>\n",
       "      <td>51.490784</td>\n",
       "      <td>0.120272</td>\n",
       "      <td>4</td>\n",
       "      <td>SE2 9RH</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Acton Central</td>\n",
       "      <td>520613</td>\n",
       "      <td>180299</td>\n",
       "      <td>51.508757</td>\n",
       "      <td>-0.263430</td>\n",
       "      <td>2</td>\n",
       "      <td>W3 6BH</td>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Acton Main Line</td>\n",
       "      <td>520296</td>\n",
       "      <td>181196</td>\n",
       "      <td>51.516886</td>\n",
       "      <td>-0.267690</td>\n",
       "      <td>3</td>\n",
       "      <td>W3 9EH</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Acton Town</td>\n",
       "      <td>519457</td>\n",
       "      <td>179639</td>\n",
       "      <td>51.503071</td>\n",
       "      <td>-0.280303</td>\n",
       "      <td>3</td>\n",
       "      <td>W3 8HN</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>648</th>\n",
       "      <td>Woodside Park</td>\n",
       "      <td>525725</td>\n",
       "      <td>192564</td>\n",
       "      <td>51.617868</td>\n",
       "      <td>-0.185426</td>\n",
       "      <td>4</td>\n",
       "      <td>N12 8SE</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>649</th>\n",
       "      <td>Woolwich</td>\n",
       "      <td>543931</td>\n",
       "      <td>178994</td>\n",
       "      <td>51.491578</td>\n",
       "      <td>0.071819</td>\n",
       "      <td>4</td>\n",
       "      <td>SE18 6EU</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>650</th>\n",
       "      <td>Woolwich Arsenal</td>\n",
       "      <td>543754</td>\n",
       "      <td>178803</td>\n",
       "      <td>51.489907</td>\n",
       "      <td>0.069194</td>\n",
       "      <td>4</td>\n",
       "      <td>SE18 6HX</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>651</th>\n",
       "      <td>Woolwich Dockyard</td>\n",
       "      <td>542738</td>\n",
       "      <td>178908</td>\n",
       "      <td>51.491108</td>\n",
       "      <td>0.054612</td>\n",
       "      <td>3</td>\n",
       "      <td>SE18 5JY</td>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>652</th>\n",
       "      <td>Worcester Park</td>\n",
       "      <td>522192</td>\n",
       "      <td>166133</td>\n",
       "      <td>51.381104</td>\n",
       "      <td>-0.245575</td>\n",
       "      <td>4</td>\n",
       "      <td>KT4 7ND</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>653 rows × 8 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "               Station    OS X    OS Y   Latitude  Longitude  Zone  Postcode  \\\n",
       "0           Abbey Road  539081  183352  51.531952   0.003723     3   E15 3NB   \n",
       "1           Abbey Wood  547297  179002  51.490784   0.120272     4   SE2 9RH   \n",
       "2        Acton Central  520613  180299  51.508757  -0.263430     2    W3 6BH   \n",
       "3      Acton Main Line  520296  181196  51.516886  -0.267690     3    W3 9EH   \n",
       "4           Acton Town  519457  179639  51.503071  -0.280303     3    W3 8HN   \n",
       "..                 ...     ...     ...        ...        ...   ...       ...   \n",
       "648      Woodside Park  525725  192564  51.617868  -0.185426     4   N12 8SE   \n",
       "649           Woolwich  543931  178994  51.491578   0.071819     4  SE18 6EU   \n",
       "650   Woolwich Arsenal  543754  178803  51.489907   0.069194     4  SE18 6HX   \n",
       "651  Woolwich Dockyard  542738  178908  51.491108   0.054612     3  SE18 5JY   \n",
       "652     Worcester Park  522192  166133  51.381104  -0.245575     4   KT4 7ND   \n",
       "\n",
       "    Zone_original  \n",
       "0               3  \n",
       "1               4  \n",
       "2               2  \n",
       "3               3  \n",
       "4               3  \n",
       "..            ...  \n",
       "648             4  \n",
       "649             4  \n",
       "650             4  \n",
       "651             3  \n",
       "652             4  \n",
       "\n",
       "[653 rows x 8 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Duplicated stations:\n",
      "Station\n",
      "Hammersmith     2\n",
      "Edgware Road    2\n",
      "Name: count, dtype: int64\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Station</th>\n",
       "      <th>Latitude</th>\n",
       "      <th>Longitude</th>\n",
       "      <th>Zone</th>\n",
       "      <th>Postcode</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Acton Town</td>\n",
       "      <td>51.503071</td>\n",
       "      <td>-0.280303</td>\n",
       "      <td>3</td>\n",
       "      <td>W3 8HN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Aldgate</td>\n",
       "      <td>51.514342</td>\n",
       "      <td>-0.075627</td>\n",
       "      <td>1</td>\n",
       "      <td>EC3N 1AH</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Aldgate East</td>\n",
       "      <td>51.515082</td>\n",
       "      <td>-0.073001</td>\n",
       "      <td>1</td>\n",
       "      <td>E1 7PT</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Alperton</td>\n",
       "      <td>51.541209</td>\n",
       "      <td>-0.299516</td>\n",
       "      <td>4</td>\n",
       "      <td>HA0 4LL</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Amersham</td>\n",
       "      <td>51.674128</td>\n",
       "      <td>-0.606514</td>\n",
       "      <td>9</td>\n",
       "      <td>HP6 5AZ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>261</th>\n",
       "      <td>Wimbledon Park</td>\n",
       "      <td>51.434581</td>\n",
       "      <td>-0.199186</td>\n",
       "      <td>3</td>\n",
       "      <td>SW19 7DZ</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>262</th>\n",
       "      <td>Wood Green</td>\n",
       "      <td>51.597454</td>\n",
       "      <td>-0.109527</td>\n",
       "      <td>3</td>\n",
       "      <td>N22 8HH</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263</th>\n",
       "      <td>Wood Lane</td>\n",
       "      <td>51.509658</td>\n",
       "      <td>-0.224473</td>\n",
       "      <td>2</td>\n",
       "      <td>W12 7DS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>264</th>\n",
       "      <td>Woodford</td>\n",
       "      <td>51.607202</td>\n",
       "      <td>0.034056</td>\n",
       "      <td>4</td>\n",
       "      <td>IG8 7QE</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265</th>\n",
       "      <td>Woodside Park</td>\n",
       "      <td>51.617868</td>\n",
       "      <td>-0.185426</td>\n",
       "      <td>4</td>\n",
       "      <td>N12 8SE</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>266 rows × 5 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "            Station   Latitude  Longitude  Zone  Postcode\n",
       "0        Acton Town  51.503071  -0.280303     3    W3 8HN\n",
       "1           Aldgate  51.514342  -0.075627     1  EC3N 1AH\n",
       "2      Aldgate East  51.515082  -0.073001     1    E1 7PT\n",
       "3          Alperton  51.541209  -0.299516     4   HA0 4LL\n",
       "4          Amersham  51.674128  -0.606514     9   HP6 5AZ\n",
       "..              ...        ...        ...   ...       ...\n",
       "261  Wimbledon Park  51.434581  -0.199186     3  SW19 7DZ\n",
       "262      Wood Green  51.597454  -0.109527     3   N22 8HH\n",
       "263       Wood Lane  51.509658  -0.224473     2   W12 7DS\n",
       "264        Woodford  51.607202   0.034056     4   IG8 7QE\n",
       "265   Woodside Park  51.617868  -0.185426     4   N12 8SE\n",
       "\n",
       "[266 rows x 5 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_stations = pd.read_csv(f\"{path_data}/TfL_london_transport_tube_stations.csv\")\n",
    "display(df_stations)\n",
    "df_stations = df_stations.drop([\"Zone_original\", \"OS X\", \"OS Y\"], axis=1)\n",
    "df_stations = df_stations.apply(lambda x: x.str.strip() if x.dtype == \"object\" else x)\n",
    "df_stations[\"Station\"] = df_stations[\"Station\"].str.replace(\" and \", \" & \")\n",
    "\n",
    "# Keep only first occurence of station info (e.g. \"Edgware Road\" appears twice)\n",
    "count_stations = df_stations[\"Station\"].value_counts()\n",
    "duplicated_stations = count_stations[count_stations > 1]\n",
    "print(f\"Duplicated stations:\\n{duplicated_stations}\\n\")\n",
    "df_stations = df_stations.drop_duplicates(\"Station\", keep=\"first\")\n",
    "\n",
    "# Replace \"Bank\" by \"Bank & Monument\" for convenience\n",
    "df_stations[\"Station\"] = df_stations[\"Station\"].str.replace(\"^Bank$\", \"Bank & Monument\", regex=True)\n",
    "df_stations = df_stations.drop(df_stations[df_stations[\"Station\"] == \"Monument\"].index, axis=0)\n",
    "\n",
    "# Add apostrophe in \"Earls Court\", \"Kings Cross St. Pancras\", \"Queen's Park\",\n",
    "# \"Regent's Park\", \"Shepherd's Bush\", \"Shepherd's Bush Market\", \"St. John's Wood\", \"St. Paul's\"\n",
    "df_stations[\"Station\"] = df_stations[\"Station\"].str.replace(\"^Earls\", \"Earl's\", regex=True)\n",
    "df_stations[\"Station\"] = df_stations[\"Station\"].str.replace(\"^Kings Cross St. Pancras\", \"King's Cross St. Pancras\", regex=True)\n",
    "df_stations[\"Station\"] = df_stations[\"Station\"].str.replace(\"^Queens Park\", \"Queen's Park\", regex=True)\n",
    "df_stations[\"Station\"] = df_stations[\"Station\"].str.replace(\"^Regents Park\", \"Regent's Park\", regex=True)\n",
    "df_stations[\"Station\"] = df_stations[\"Station\"].str.replace(\"^Shepherds Bush\", \"Shepherd's Bush\", regex=True)\n",
    "df_stations[\"Station\"] = df_stations[\"Station\"].str.replace(\"^Shepherds Bush Market\", \"Shepherd's Bush Market\", regex=True)\n",
    "df_stations[\"Station\"] = df_stations[\"Station\"].str.replace(\"^St. Johns Wood\", \"St. John's Wood\", regex=True)\n",
    "df_stations[\"Station\"] = df_stations[\"Station\"].str.replace(\"^St. Pauls\", \"St. Paul's\", regex=True)\n",
    "\n",
    "# Add info about Kensington (Olympia) station\n",
    "df_stations.loc[-1] = {\n",
    "    \"Station\": \"Kensington (Olympia)\",\n",
    "    \"Latitude\": 51.4979934,\n",
    "    \"Longitude\": -0.2099576,\n",
    "    \"Zone\": 2,\n",
    "    \"Postcode\": \"W14 0NE\"\n",
    "}\n",
    "\n",
    "# Keep only stations present in linkage dataframe above\n",
    "all_stations = df_stations[\"Station\"].values.tolist()\n",
    "df_stations = df_stations[df_stations[\"Station\"].isin(unique_stations)]\n",
    "\n",
    "# Set clean index and sort rows alphabetically\n",
    "df_stations = df_stations.sort_values(\"Station\")\n",
    "df_stations.index = range(len(df_stations))\n",
    "\n",
    "df_stations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "a812ead8-ed71-4c98-8dcb-81e0b7ff179b",
   "metadata": {},
   "outputs": [],
   "source": [
    "#assert not (set(unique_stations) - set(all_stations)), \"Some station information have not been found\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a5f1b344-8965-4bf3-8708-507f5a7a70d5",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "85855b57-fb1e-4c9e-81fc-45a78bc938b2",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "98f57fc8-d67a-4009-b65b-893d6650f690",
   "metadata": {},
   "source": [
    "## Import dataframe containing tube station information"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "3fb0b5eb-ff38-43d3-a30d-638206520334",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Station</th>\n",
       "      <th>Note</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Abbey Road</td>\n",
       "      <td>Explore the historic House Mill and the Three ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Acton Town</td>\n",
       "      <td>Gunnersbury Park and Museum offer landscaped g...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Aldgate</td>\n",
       "      <td>See the historic Aldgate Pump and visit the ne...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Aldgate East</td>\n",
       "      <td>Head to Brick Lane for famous curry houses, vi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>All Saints</td>\n",
       "      <td>Chrisp Street Market and the Lansbury Estate s...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>294</th>\n",
       "      <td>Wimbledon Park</td>\n",
       "      <td>Row on the lake at Wimbledon Park and watch te...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>295</th>\n",
       "      <td>Wood Green</td>\n",
       "      <td>Take in the views from Alexandra Palace and sh...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>296</th>\n",
       "      <td>Woodford</td>\n",
       "      <td>Explore Epping Forest and play golf at Woodfor...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>297</th>\n",
       "      <td>Woodside Park</td>\n",
       "      <td>Walk the Dollis Valley Greenwalk and shop alon...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>298</th>\n",
       "      <td>Woolwich Arsenal</td>\n",
       "      <td>Explore the Royal Arsenal Riverside and take t...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>296 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "              Station                                               Note\n",
       "0          Abbey Road  Explore the historic House Mill and the Three ...\n",
       "1          Acton Town  Gunnersbury Park and Museum offer landscaped g...\n",
       "2             Aldgate  See the historic Aldgate Pump and visit the ne...\n",
       "3        Aldgate East  Head to Brick Lane for famous curry houses, vi...\n",
       "4          All Saints  Chrisp Street Market and the Lansbury Estate s...\n",
       "..                ...                                                ...\n",
       "294    Wimbledon Park  Row on the lake at Wimbledon Park and watch te...\n",
       "295        Wood Green  Take in the views from Alexandra Palace and sh...\n",
       "296          Woodford  Explore Epping Forest and play golf at Woodfor...\n",
       "297     Woodside Park  Walk the Dollis Valley Greenwalk and shop alon...\n",
       "298  Woolwich Arsenal  Explore the Royal Arsenal Riverside and take t...\n",
       "\n",
       "[296 rows x 2 columns]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_sightseeing = pd.read_csv(\n",
    "    f\"{path_data}/TfL_london_transport_tube_sightseeing.csv\", sep=\";\", header=1\n",
    ")\n",
    "df_sightseeing = df_sightseeing.T.drop_duplicates().T.rename(columns={\"Blurb\": \"Note\"})\n",
    "df_sightseeing = df_sightseeing.apply(\n",
    "    lambda x: x.str.strip() if x.dtype == \"object\" else x\n",
    ")\n",
    "df_sightseeing[\"Station\"] = df_sightseeing[\"Station\"].str.replace(\" and \", \" & \")\n",
    "\n",
    "# Replace \"Bank\" by \"Bank & Monument\" for convenience\n",
    "df_sightseeing[\"Station\"] = df_sightseeing[\"Station\"].str.replace(\"^Bank$\", \"Bank & Monument\", regex=True)\n",
    "df_sightseeing = df_sightseeing.drop(df_sightseeing[df_sightseeing[\"Station\"] == \"Monument\"].index, axis=0)\n",
    "\n",
    "# Remove lines from Docklands Light Railway (DLR) line\n",
    "df_sightseeing = df_sightseeing[~df_sightseeing[\"Station\"].isin([\n",
    "    \"Crossharbour\", \"Custom House for ExCeL\"\n",
    "])]\n",
    "\n",
    "# Remove (B) and (C) from Edgware Road\n",
    "df_sightseeing[\"Station\"] = df_sightseeing[\"Station\"].str.replace(r\" \\((Bakerloo|H & C)\\)\", \"\", regex=True)\n",
    "\n",
    "# Remove (District & Picc) from Hammersmith\n",
    "df_sightseeing[\"Station\"] = df_sightseeing[\"Station\"].str.replace(r\" \\(District & Picc\\)\", \"\", regex=True)\n",
    "\n",
    "# Add dashes to Harrow on the Hill station\n",
    "df_sightseeing[\"Station\"] = df_sightseeing[\"Station\"].str.replace(\"Harrow on the Hill\", \"Harrow-on-the-Hill\", regex=True)\n",
    "\n",
    "# Add spaces in \"Heathrow Terminals 123\"\n",
    "df_sightseeing[\"Station\"] = df_sightseeing[\"Station\"].str.replace(\"Heathrow Terminals 123\", \"Heathrow Terminals 1 2 3\", regex=False)\n",
    "\n",
    "# Add dot in King's Cross St Pancras, St John's Wood and St Paul's\n",
    "df_sightseeing[\"Station\"] = df_sightseeing[\"Station\"].str.replace(\"King's Cross St Pancras\", \"King's Cross St. Pancras\", regex=False)\n",
    "df_sightseeing[\"Station\"] = df_sightseeing[\"Station\"].str.replace(\"St John's Wood\", \"St. John's Wood\", regex=False)\n",
    "df_sightseeing[\"Station\"] = df_sightseeing[\"Station\"].str.replace(\"St Paul's\", \"St. Paul's\", regex=False)\n",
    "\n",
    "df_sightseeing"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "c3c47064-9652-4a34-bb64-5e517d561e35",
   "metadata": {},
   "outputs": [],
   "source": [
    "#assert not (set(df_sightseeing[\"Station\"]) - set(df_stations[\"Station\"])), \"Some station information have not been found\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "76e36e37-a4ba-4f98-aa56-583b2d974416",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "349972b7-5104-46d0-b110-9ad7772ebe70",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "a546ef40-50e8-4e63-bfd7-4ec7abfa1118",
   "metadata": {},
   "source": [
    "## Merge station information"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "04542c63-cce9-47fb-ada1-2174c7dbfc75",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Station</th>\n",
       "      <th>Latitude</th>\n",
       "      <th>Longitude</th>\n",
       "      <th>Zone</th>\n",
       "      <th>Postcode</th>\n",
       "      <th>Note</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Acton Town</td>\n",
       "      <td>51.503071</td>\n",
       "      <td>-0.280303</td>\n",
       "      <td>3</td>\n",
       "      <td>W3 8HN</td>\n",
       "      <td>Gunnersbury Park and Museum offer landscaped g...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Aldgate</td>\n",
       "      <td>51.514342</td>\n",
       "      <td>-0.075627</td>\n",
       "      <td>1</td>\n",
       "      <td>EC3N 1AH</td>\n",
       "      <td>See the historic Aldgate Pump and visit the ne...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Aldgate East</td>\n",
       "      <td>51.515082</td>\n",
       "      <td>-0.073001</td>\n",
       "      <td>1</td>\n",
       "      <td>E1 7PT</td>\n",
       "      <td>Head to Brick Lane for famous curry houses, vi...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Alperton</td>\n",
       "      <td>51.541209</td>\n",
       "      <td>-0.299516</td>\n",
       "      <td>4</td>\n",
       "      <td>HA0 4LL</td>\n",
       "      <td>Walk along the Grand Union Canal or explore th...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Amersham</td>\n",
       "      <td>51.674128</td>\n",
       "      <td>-0.606514</td>\n",
       "      <td>9</td>\n",
       "      <td>HP6 5AZ</td>\n",
       "      <td>Wander through the picturesque old town of Ame...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263</th>\n",
       "      <td>Wimbledon Park</td>\n",
       "      <td>51.434581</td>\n",
       "      <td>-0.199186</td>\n",
       "      <td>3</td>\n",
       "      <td>SW19 7DZ</td>\n",
       "      <td>Row on the lake at Wimbledon Park and watch te...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>264</th>\n",
       "      <td>Wood Green</td>\n",
       "      <td>51.597454</td>\n",
       "      <td>-0.109527</td>\n",
       "      <td>3</td>\n",
       "      <td>N22 8HH</td>\n",
       "      <td>Take in the views from Alexandra Palace and sh...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265</th>\n",
       "      <td>Wood Lane</td>\n",
       "      <td>51.509658</td>\n",
       "      <td>-0.224473</td>\n",
       "      <td>2</td>\n",
       "      <td>W12 7DS</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>266</th>\n",
       "      <td>Woodford</td>\n",
       "      <td>51.607202</td>\n",
       "      <td>0.034056</td>\n",
       "      <td>4</td>\n",
       "      <td>IG8 7QE</td>\n",
       "      <td>Explore Epping Forest and play golf at Woodfor...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>267</th>\n",
       "      <td>Woodside Park</td>\n",
       "      <td>51.617868</td>\n",
       "      <td>-0.185426</td>\n",
       "      <td>4</td>\n",
       "      <td>N12 8SE</td>\n",
       "      <td>Walk the Dollis Valley Greenwalk and shop alon...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>268 rows × 6 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "            Station   Latitude  Longitude  Zone  Postcode  \\\n",
       "0        Acton Town  51.503071  -0.280303     3    W3 8HN   \n",
       "1           Aldgate  51.514342  -0.075627     1  EC3N 1AH   \n",
       "2      Aldgate East  51.515082  -0.073001     1    E1 7PT   \n",
       "3          Alperton  51.541209  -0.299516     4   HA0 4LL   \n",
       "4          Amersham  51.674128  -0.606514     9   HP6 5AZ   \n",
       "..              ...        ...        ...   ...       ...   \n",
       "263  Wimbledon Park  51.434581  -0.199186     3  SW19 7DZ   \n",
       "264      Wood Green  51.597454  -0.109527     3   N22 8HH   \n",
       "265       Wood Lane  51.509658  -0.224473     2   W12 7DS   \n",
       "266        Woodford  51.607202   0.034056     4   IG8 7QE   \n",
       "267   Woodside Park  51.617868  -0.185426     4   N12 8SE   \n",
       "\n",
       "                                                  Note  \n",
       "0    Gunnersbury Park and Museum offer landscaped g...  \n",
       "1    See the historic Aldgate Pump and visit the ne...  \n",
       "2    Head to Brick Lane for famous curry houses, vi...  \n",
       "3    Walk along the Grand Union Canal or explore th...  \n",
       "4    Wander through the picturesque old town of Ame...  \n",
       "..                                                 ...  \n",
       "263  Row on the lake at Wimbledon Park and watch te...  \n",
       "264  Take in the views from Alexandra Palace and sh...  \n",
       "265                                                NaN  \n",
       "266  Explore Epping Forest and play golf at Woodfor...  \n",
       "267  Walk the Dollis Valley Greenwalk and shop alon...  \n",
       "\n",
       "[268 rows x 6 columns]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "if \"Note\" not in df_stations.columns:\n",
    "    df_stations = pd.merge(df_stations, df_sightseeing, on=\"Station\", how=\"left\")\n",
    "df_stations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0fc92270-b391-4603-82cd-e80b369199c8",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "40367f6f-6e12-4470-9463-4afdcaa9fd2d",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "db7cf79d-554d-4602-8714-995a37a7a754",
   "metadata": {},
   "source": [
    "## Compute distances between stations (using euclidian distance between station coordinates)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "d773cbdf-22c3-4c9e-abf8-45a223d8e3c4",
   "metadata": {},
   "outputs": [],
   "source": [
    "import numpy as np\n",
    "\n",
    "def euclidean_distance_geo_coord(df_coordinates, latitude_deg=51.5):  # lat1, lon1, lat2, lon2):\n",
    "    \"\"\"\n",
    "    Euclidean distance in meters.\n",
    "    Accurate enough for distances < 5km.\n",
    "\n",
    "    By default, latitude is set to London (51.5°)\n",
    "    \"\"\"\n",
    "    # Meters per degree at London's latitude (51.5°)\n",
    "    meters_per_lat = 111320  # Constant everywhere\n",
    "    meters_per_lon = 111320 * np.cos(latitude_deg)\n",
    "    \n",
    "    dy = (df_coordinates.iloc[0, 0] - df_coordinates.iloc[1, 0]) * meters_per_lat\n",
    "    dx = (df_coordinates.iloc[0, 1] - df_coordinates.iloc[1, 1]) * meters_per_lon\n",
    "    \n",
    "    return np.sqrt(dx**2 + dy**2)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "7388f92b-2c1e-4962-bc3b-b8a251d2b43b",
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_stations_distances(df_link_stations):\n",
    "    list_dist_stations = []\n",
    "\n",
    "    for row in tqdm(df_link_stations.itertuples(), total=len(df_link_stations)):\n",
    "        # Get origin and destination stations\n",
    "        from_station = row.From_Station\n",
    "        to_station = row.To_Station\n",
    "        #print(f\"From {from_station} to {to_station}\")\n",
    "    \n",
    "        # Get stations coordinates\n",
    "        df_coordinates = df_stations[df_stations[\"Station\"].isin([from_station, to_station])].loc[:, [\"Latitude\", \"Longitude\"]]\n",
    "        \n",
    "        # Compute euclidean distance between stations coordinates and get data in meters\n",
    "        dist = int(euclidean_distance_geo_coord(df_coordinates))\n",
    "        #print(f\"Euclidean distance: {dist}\")\n",
    "    \n",
    "        # Save for df_link_stations\n",
    "        list_dist_stations.append(dist)\n",
    "    \n",
    "    assert len(list_dist_stations) == len(df_link_stations), \"List of distances should be the same size as df_links_stations\"\n",
    "\n",
    "    # Add Distance column to df_link_stations\n",
    "    df_link_stations[\"DistanceMeters\"] = list_dist_stations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "8fe1b908-f53e-48c8-9267-cb717f9ddb73",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "fc0eb70d87c048c2a137fc35f108f9d3",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "  0%|          | 0/714 [00:00<?, ?it/s]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Euclidean distance successfully added\n"
     ]
    }
   ],
   "source": [
    "# Add Distance column to df_link_stations\n",
    "if \"DistanceMeters\" not in df_link_stations.columns:\n",
    "    add_stations_distances(df_link_stations)\n",
    "    print(\"Euclidean distance successfully added\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "79f9c829-e490-4aac-90e6-a15038568355",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "e881d44e-18f7-4d60-8122-d0d3dec7e911",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Line</th>\n",
       "      <th>Order</th>\n",
       "      <th>From_Station</th>\n",
       "      <th>To_Station</th>\n",
       "      <th>Total</th>\n",
       "      <th>PM Peak</th>\n",
       "      <th>Evening</th>\n",
       "      <th>Late</th>\n",
       "      <th>DistanceMeters</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bakerloo</td>\n",
       "      <td>1</td>\n",
       "      <td>Elephant &amp; Castle</td>\n",
       "      <td>Lambeth North</td>\n",
       "      <td>13.432</td>\n",
       "      <td>4.118</td>\n",
       "      <td>1.288</td>\n",
       "      <td>398.000</td>\n",
       "      <td>545</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Bakerloo</td>\n",
       "      <td>2</td>\n",
       "      <td>Lambeth North</td>\n",
       "      <td>Waterloo</td>\n",
       "      <td>18.597</td>\n",
       "      <td>5.718</td>\n",
       "      <td>1.916</td>\n",
       "      <td>580.000</td>\n",
       "      <td>450</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Bakerloo</td>\n",
       "      <td>3</td>\n",
       "      <td>Waterloo</td>\n",
       "      <td>Embankment</td>\n",
       "      <td>46.020</td>\n",
       "      <td>13.746</td>\n",
       "      <td>4.609</td>\n",
       "      <td>1.466</td>\n",
       "      <td>571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Bakerloo</td>\n",
       "      <td>4</td>\n",
       "      <td>Embankment</td>\n",
       "      <td>Charing Cross</td>\n",
       "      <td>55.475</td>\n",
       "      <td>17.155</td>\n",
       "      <td>5.959</td>\n",
       "      <td>1.940</td>\n",
       "      <td>146</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bakerloo</td>\n",
       "      <td>5</td>\n",
       "      <td>Charing Cross</td>\n",
       "      <td>Piccadilly Circus</td>\n",
       "      <td>63.929</td>\n",
       "      <td>20.112</td>\n",
       "      <td>7.712</td>\n",
       "      <td>3.035</td>\n",
       "      <td>359</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>859</th>\n",
       "      <td>Victoria</td>\n",
       "      <td>13</td>\n",
       "      <td>Pimlico</td>\n",
       "      <td>Vauxhall</td>\n",
       "      <td>94.853</td>\n",
       "      <td>37.711</td>\n",
       "      <td>24.553</td>\n",
       "      <td>10.574</td>\n",
       "      <td>544</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>860</th>\n",
       "      <td>Victoria</td>\n",
       "      <td>14</td>\n",
       "      <td>Vauxhall</td>\n",
       "      <td>Stockwell</td>\n",
       "      <td>66.561</td>\n",
       "      <td>27.117</td>\n",
       "      <td>18.342</td>\n",
       "      <td>7.992</td>\n",
       "      <td>1511</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>861</th>\n",
       "      <td>Victoria</td>\n",
       "      <td>15</td>\n",
       "      <td>Stockwell</td>\n",
       "      <td>Brixton</td>\n",
       "      <td>41.178</td>\n",
       "      <td>15.972</td>\n",
       "      <td>11.553</td>\n",
       "      <td>5.361</td>\n",
       "      <td>1092</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>862</th>\n",
       "      <td>Waterloo &amp; City</td>\n",
       "      <td>1</td>\n",
       "      <td>Waterloo</td>\n",
       "      <td>Bank &amp; Monument</td>\n",
       "      <td>5.554</td>\n",
       "      <td>5.197</td>\n",
       "      <td>1.465</td>\n",
       "      <td>386.000</td>\n",
       "      <td>1443</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>863</th>\n",
       "      <td>Waterloo &amp; City</td>\n",
       "      <td>1</td>\n",
       "      <td>Bank &amp; Monument</td>\n",
       "      <td>Waterloo</td>\n",
       "      <td>6.348</td>\n",
       "      <td>18.237</td>\n",
       "      <td>6.517</td>\n",
       "      <td>1.374</td>\n",
       "      <td>1443</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>714 rows × 9 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                Line  Order       From_Station         To_Station   Total  \\\n",
       "0           Bakerloo      1  Elephant & Castle      Lambeth North  13.432   \n",
       "1           Bakerloo      2      Lambeth North           Waterloo  18.597   \n",
       "2           Bakerloo      3           Waterloo         Embankment  46.020   \n",
       "3           Bakerloo      4         Embankment      Charing Cross  55.475   \n",
       "4           Bakerloo      5      Charing Cross  Piccadilly Circus  63.929   \n",
       "..               ...    ...                ...                ...     ...   \n",
       "859         Victoria     13            Pimlico           Vauxhall  94.853   \n",
       "860         Victoria     14           Vauxhall          Stockwell  66.561   \n",
       "861         Victoria     15          Stockwell            Brixton  41.178   \n",
       "862  Waterloo & City      1           Waterloo    Bank & Monument   5.554   \n",
       "863  Waterloo & City      1    Bank & Monument           Waterloo   6.348   \n",
       "\n",
       "     PM Peak     Evening        Late  DistanceMeters  \n",
       "0         4.118       1.288  398.000             545  \n",
       "1         5.718       1.916  580.000             450  \n",
       "2        13.746       4.609    1.466             571  \n",
       "3        17.155       5.959    1.940             146  \n",
       "4        20.112       7.712    3.035             359  \n",
       "..          ...         ...      ...             ...  \n",
       "859      37.711      24.553   10.574             544  \n",
       "860      27.117      18.342    7.992            1511  \n",
       "861      15.972      11.553    5.361            1092  \n",
       "862       5.197       1.465  386.000            1443  \n",
       "863      18.237       6.517    1.374            1443  \n",
       "\n",
       "[714 rows x 9 columns]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df_link_stations"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "24caf17f-f563-4154-b3dd-4a88dac2f92a",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "93ac42d8-6b60-4cae-8990-92ccf6ec0d84",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "3f1787e0-e4dd-4e04-8e12-965153c061f6",
   "metadata": {},
   "source": [
    "# Create graph from dataframe"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "4f1da7fc-020e-464e-b918-82687fe9a31d",
   "metadata": {},
   "outputs": [],
   "source": [
    "G = create_graph_from_df(\n",
    "    df_link_stations,\n",
    "    source_node_col={\"id\": \"From_Station\", \"type\": \"Station\"},\n",
    "    target_node_col={\"id\": \"To_Station\", \"type\": \"Station\"},\n",
    "    node_attributes_df=df_stations,\n",
    "    node_attributes_key_col=\"Station\",\n",
    "    #edge_col=\"Line\",\n",
    "    attributes_edges=[\"Line\", \"DistanceMeters\"]\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "593ed5f3-2820-4aec-9a30-ae4ade5e5ad7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('Elephant & Castle', {'displayName': 'Elephant & Castle', 'type': 'Station', 'Latitude': 51.4958492200292, 'Longitude': -0.100738714256282, 'Zone': 1, 'Postcode': 'SE1 6LW', 'Note': 'Visit the Imperial War Museum or catch a show at Southwark Playhouse.'})\n",
      "('Lambeth North', {'displayName': 'Lambeth North', 'type': 'Station', 'Latitude': 51.4991297653886, 'Longitude': -0.111768260460206, 'Zone': 1, 'Postcode': 'SE1 7XG', 'Note': 'Visit the Imperial War Museum and browse the Saturday market on Lower Marsh.'})\n",
      "('Waterloo', {'displayName': 'Waterloo', 'type': 'Station', 'Latitude': 51.5031464567835, 'Longitude': -0.113259251258196, 'Zone': 1, 'Postcode': 'SE1 7NY', 'Note': 'Ride the London Eye, stroll along the South Bank and see a play at the National Theatre.'})\n",
      "('Embankment', {'displayName': 'Embankment', 'type': 'Station', 'Latitude': 51.5073122969468, 'Longitude': -0.12236733566212, 'Zone': 1, 'Postcode': 'WC2N 6NS', 'Note': 'Relax in Victoria Embankment Gardens and see Cleopatra’s Needle along the Thames.'})\n",
      "('Charing Cross', {'displayName': 'Charing Cross', 'type': 'Station', 'Latitude': 51.5083584281862, 'Longitude': -0.124802937233044, 'Zone': 1, 'Postcode': 'WC2N 5HS', 'Note': 'Stand in Trafalgar Square beneath Nelson’s Column and explore the National Gallery.'})\n",
      "('Piccadilly Circus', {'displayName': 'Piccadilly Circus', 'type': 'Station', 'Latitude': 51.5096965321706, 'Longitude': -0.133711596159076, 'Zone': 1, 'Postcode': 'W1J 9HS', 'Note': 'See the bright lights of Piccadilly Circus, meet Eros at the Shaftesbury Memorial Fountain and visit the Criterion Theatre.'})\n",
      "('Oxford Circus', {'displayName': 'Oxford Circus', 'type': 'Station', 'Latitude': 51.5152231744017, 'Longitude': -0.140836170133341, 'Zone': 1, 'Postcode': 'W1C 2JS', 'Note': 'Shop on Oxford Street and Regent Street and visit Hamleys, the world’s oldest toy store.'})\n",
      "(\"Regent's Park\", {'displayName': \"Regent's Park\", 'type': 'Station', 'Latitude': 51.5238104377728, 'Longitude': -0.145344409720596, 'Zone': 1, 'Postcode': 'NW1 5HA', 'Note': 'Explore Regent’s Park’s formal gardens and visit ZSL London Zoo.'})\n",
      "('Baker Street', {'displayName': 'Baker Street', 'type': 'Station', 'Latitude': 51.5231293660588, 'Longitude': -0.156904192986185, 'Zone': 1, 'Postcode': 'NW1 5LA', 'Note': 'Step into Sherlock Holmes’ world at 221B Baker Street or meet wax celebrities at Madame\\xa0Tussauds.'})\n",
      "('Marylebone', {'displayName': 'Marylebone', 'type': 'Station', 'Latitude': 51.5223964032654, 'Longitude': -0.163492562310913, 'Zone': 1, 'Postcode': 'NW1 6JJ', 'Note': 'Shop on Marylebone High Street and tour Madame Tussauds.'})\n"
     ]
    }
   ],
   "source": [
    "# Show 10 first nodes\n",
    "for node in list(G.nodes(data=True))[:10]:\n",
    "    print(node)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "f1cd428b-fd78-4189-91a7-17d041edbadb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "('Elephant & Castle', 'Lambeth North', {'Line': 'Bakerloo', 'DistanceMeters': 545})\n",
      "('Elephant & Castle', 'Borough', {'Line': 'Northern', 'DistanceMeters': 626})\n",
      "('Elephant & Castle', 'Kennington', {'Line': 'Northern', 'DistanceMeters': 815})\n",
      "('Lambeth North', 'Waterloo', {'Line': 'Bakerloo', 'DistanceMeters': 450})\n",
      "('Lambeth North', 'Elephant & Castle', {'Line': 'Bakerloo', 'DistanceMeters': 545})\n",
      "('Waterloo', 'Embankment', {'Line': 'Northern', 'DistanceMeters': 571})\n",
      "('Waterloo', 'Lambeth North', {'Line': 'Bakerloo', 'DistanceMeters': 450})\n",
      "('Waterloo', 'Westminster', {'Line': 'Jubilee', 'DistanceMeters': 473})\n",
      "('Waterloo', 'Southwark', {'Line': 'Jubilee', 'DistanceMeters': 285})\n",
      "('Waterloo', 'Kennington', {'Line': 'Northern', 'DistanceMeters': 1640})\n"
     ]
    }
   ],
   "source": [
    "# Show 10 first edges\n",
    "for edge in list(G.edges(data=True))[:10]:\n",
    "    print(edge)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "d53b4483-e6ef-44d2-8401-2f2e97954dff",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "DiGraph with 266 nodes and 614 edges\n"
     ]
    }
   ],
   "source": [
    "print(G)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "48b423f4-d0f7-48f6-a73f-ce87e9e6cf4b",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0ab79286-c6f9-492d-9fad-6b62b423ee6c",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "c3e378b5-821e-4e9b-9625-9bf764b3d994",
   "metadata": {},
   "source": [
    "# Create `turingdb` python client"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "14a3f1de-812b-404e-a21b-4d7ea4373b17",
   "metadata": {},
   "source": [
    "<div class=\"alert alert-block alert-info\">\n",
    "    <h2>\n",
    "        See <a href=\"https://docs.turingdb.ai/quickstart\">TuringDB Get started documentation</a> for the important steps to follow :\n",
    "    </h2>\n",
    "    <h3>\n",
    "        Remember to have your <code>turingdb</code> server running while working in this notebook !\n",
    "    </h3>\n",
    "</div>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "215a4856-7bf2-47b6-91a3-d597236011fb",
   "metadata": {},
   "outputs": [],
   "source": [
    "from turingdb import TuringDB\n",
    "\n",
    "# Create TuringDB client\n",
    "# set host parameter to the URL (as string) on which TuringDB is running,\n",
    "# default \"http://localhost:6666\"\n",
    "client = TuringDB(host=\"http://localhost:6666\")\n",
    "try:\n",
    "    client.warmup()\n",
    "except Exception as e:\n",
    "    print(f\"TuringDB not started, please run `uv run turingdb` in your terminal\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "7a02797b-454f-41ca-84e9-282f22235cb3",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get list of available graphs\n",
    "list_graphs = client.list_available_graphs()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "318da0f7-6474-42e2-9ef6-a2ed3c660d06",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['wine_ontology1',\n",
       " 'healthcare_dataset1_subgraph',\n",
       " 'healthcare_dataset1',\n",
       " 'crypto_orbitaal_fraud_detection1',\n",
       " 'default']"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Get list of loaded graphs\n",
    "client.list_loaded_graphs()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "11f2e9bc-700d-4fda-8f66-4fe3e8b1290f",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "68c003c4-6bf5-45ec-a93e-bffaaa79f813",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "46e9cdcd-a5a8-4f43-b0c9-18e6a0bdf753",
   "metadata": {},
   "source": [
    "# Set graph name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "44265880-499e-47de-8a08-da6f51ea7698",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'london_transport_TfL1'"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Set graph name\n",
    "graph_name_prefix = example_name\n",
    "graph_name_nb_suffix = str(\n",
    "    max(\n",
    "        [\n",
    "            int(re.sub(graph_name_prefix, \"\", g))\n",
    "            for g in list_graphs\n",
    "            if g.startswith(graph_name_prefix)\n",
    "            and re.sub(graph_name_prefix, \"\", g).isdigit()\n",
    "        ]\n",
    "        + [0]\n",
    "    )\n",
    "    + 1\n",
    ")\n",
    "graph_name = graph_name_prefix + graph_name_nb_suffix\n",
    "graph_name = re.sub(\"-\", \"_\", graph_name)\n",
    "graph_name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "62285f61-a7f4-47f7-a3e9-2731e19f33e8",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "96b8389c-f555-424c-b3aa-df769fdd6b17",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "4805cef1-702d-417f-8f68-a815629642aa",
   "metadata": {},
   "source": [
    "# Create JSONL file"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "a9d08928-6f59-4ec7-a563-86d13e71014a",
   "metadata": {},
   "outputs": [],
   "source": [
    "turingdb_dir = os.path.expanduser(\"~/.turing/data\")\n",
    "if not os.path.exists(turingdb_dir):\n",
    "    raise ValueError(f\"\"\"\n",
    "    TuringDB directory {turingdb_dir} does not exist.\n",
    "    Make sure the value you set here is the same you set when running turingdb.\n",
    "    \"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "b9b33218-1273-426e-8c79-4068c1e5598f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Writing graph to JSONL...\n",
      "JSONL file written to: /home/ubuntu/.turing/data/london_transport_TfL1.jsonl\n",
      "Graph: 266 nodes, 614 edges\n",
      "CPU times: user 3.49 ms, sys: 22 μs, total: 3.51 ms\n",
      "Wall time: 3.31 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Write graph to JSONL format\n",
    "print(\"Writing graph to JSONL...\")\n",
    "jsonl_filename = networkx_to_jsonl(\n",
    "    G,\n",
    "    graph_name,\n",
    "    node_type_key=\"type\",\n",
    "    edge_type_key=\"CONNECTION\",\n",
    "    data_dir=turingdb_dir\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8c454d6e-dc24-4a67-91a3-f6f5c0f20823",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "167deb83-e46f-418b-b29c-828b2d027bf9",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "9915936f-260a-4f4a-a53f-189627bcc7ad",
   "metadata": {},
   "source": [
    "# Create `turingdb` graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "010df8c2-5fc9-48d3-8f63-4c735c02b42e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Creating graph: london_transport_TfL1\n"
     ]
    }
   ],
   "source": [
    "print(f\"Creating graph: {graph_name}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "b97163ce-6504-4473-a7dc-aa7025787d55",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Loading JSONL into TuringDB as graph 'london_transport_TfL1' ...\n",
      "\n",
      "✓ Graph 'london_transport_TfL1' created in 0.06 seconds\n",
      "CPU times: user 2.12 ms, sys: 53 μs, total: 2.18 ms\n",
      "Wall time: 57.2 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "start_time = time.time()\n",
    "\n",
    "# Load JSONL into TuringDB\n",
    "print(f\"\\nLoading JSONL into TuringDB as graph '{graph_name}' ...\")\n",
    "client.query(f\"LOAD JSONL '{jsonl_filename}' AS {graph_name}\")\n",
    "\n",
    "execution_time = time.time() - start_time\n",
    "print(f\"\\n\\u2713 Graph '{graph_name}' created in {execution_time:.2f} seconds\")\n",
    "\n",
    "# Set active graph for querying\n",
    "client.set_graph(graph_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "eeb4b2bb-81e6-4a81-af48-1760acf310e2",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "a9c070ec-13fb-4b86-b728-fd514c0726c9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>commit</th>\n",
       "      <th>nodeCount</th>\n",
       "      <th>edgeCount</th>\n",
       "      <th>partCount</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1c0ff94bb9fd0c68</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>c6fefec2392817c3</td>\n",
       "      <td>266</td>\n",
       "      <td>614</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             commit  nodeCount  edgeCount  partCount\n",
       "0  1c0ff94bb9fd0c68          0          0          0\n",
       "1  c6fefec2392817c3        266        614          1"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Returns the commit history\n",
    "client.query(\"CALL db.history()\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "754ee7df-e5c3-464a-b90a-779eb51e68ea",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6f0a8bc8-7762-4c11-8c90-c5726f9b590b",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "b85ffd44-c7b1-48b3-b794-fa3d9bab8a82",
   "metadata": {},
   "source": [
    "# Query `turingdb` graph"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9c32454c-2594-4423-ac49-c872c09767f6",
   "metadata": {},
   "source": [
    "## Use metaqueries to have insight on graph overall structure\n",
    "\n",
    "<h3>\n",
    "    To learn more about 📮 Metaqueries, please check TuringDB documentation on this <a href=\"https://turingdb.mintlify.app/query/cypher_subset#%F0%9F%93%AE-metaqueries\">link</a>\n",
    "</h3>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "dabaddee-4f11-4e74-b87d-4ffefb081fe9",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>propertyType</th>\n",
       "      <th>valueType</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>Latitude</td>\n",
       "      <td>Double</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Longitude</td>\n",
       "      <td>Double</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>Note</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>Postcode</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>Zone</td>\n",
       "      <td>Int64</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>displayName</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>6</td>\n",
       "      <td>id</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>7</td>\n",
       "      <td>type</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>8</td>\n",
       "      <td>DistanceMeters</td>\n",
       "      <td>Int64</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>9</td>\n",
       "      <td>Line</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  id    propertyType valueType\n",
       "0  0        Latitude    Double\n",
       "1  1       Longitude    Double\n",
       "2  2            Note    String\n",
       "3  3        Postcode    String\n",
       "4  4            Zone     Int64\n",
       "5  5     displayName    String\n",
       "6  6              id    String\n",
       "7  7            type    String\n",
       "8  8  DistanceMeters     Int64\n",
       "9  9            Line    String"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.14 ms, sys: 10 μs, total: 3.15 ms\n",
      "Wall time: 2.88 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# CALL propertyTypes() - returns a column of all the different node and edge properties and their types in the database\n",
    "command = \"\"\"\n",
    "CALL db.propertyTypes()\n",
    "\"\"\"\n",
    "df_propertyTypes = client.query(command)\n",
    "if df_propertyTypes.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df_propertyTypes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "7a8be71e-8712-47b3-9033-8e9748905e7d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties: ['Latitude', 'Longitude', 'Note', 'Postcode', 'Zone', 'displayName', 'id', 'type', 'DistanceMeters', 'Line']\n"
     ]
    }
   ],
   "source": [
    "# Get node properties\n",
    "nodes_properties = df_propertyTypes[\"propertyType\"].values.tolist()\n",
    "print(f\"Node properties: {nodes_properties}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "865bad39-08dc-4754-bbeb-623b919f01b5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>Station</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   id    label\n",
       "0   0  Station"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.57 ms, sys: 27 μs, total: 2.6 ms\n",
      "Wall time: 2.47 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# CALL labels () - returns a column of all the different node labels\n",
    "command = \"\"\"\n",
    "CALL db.labels()\n",
    "\"\"\"\n",
    "df_labels = client.query(command)\n",
    "if df_labels.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df_labels)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "db0487a7-795e-4470-a50b-28a6450e228b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>edgeType</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>CONNECTION</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   id    edgeType\n",
       "0   0  CONNECTION"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.59 ms, sys: 0 ns, total: 2.59 ms\n",
      "Wall time: 2.5 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# CALL edgeTypes() - returns a column of all the different edge types (edge equivalent of node labels)\n",
    "command = \"\"\"\n",
    "CALL db.edgeTypes()\n",
    "\"\"\"\n",
    "df_edgeTypes = client.query(command)\n",
    "if df_edgeTypes.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df_edgeTypes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "46b6b645-a0de-4e89-89b5-8cbba993c1ea",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "530a81c9-d3bb-4a19-8628-a49a67481945",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "1336d872-72e1-4f44-ac2b-dc5af787b352",
   "metadata": {},
   "source": [
    "## Counts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "08205524-f43a-4f7d-9dbd-dcbeb8ac3f6e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Graph: 266 nodes and 614 edges\n",
      "CPU times: user 2.16 ms, sys: 8 μs, total: 2.17 ms\n",
      "Wall time: 2.11 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find number of nodes and number of edges in the graph\n",
    "n_nodes = len(client.query(\"MATCH (n) RETURN n\"))\n",
    "n_edges = len(client.query(\"MATCH (n)-->(m) RETURN n, m\"))\n",
    "print(f\"Graph: {n_nodes:,} nodes and {n_edges:,} edges\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "829c0107-9d76-4877-94d5-b617e8076a0e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>266</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(n)\n",
       "0       266"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>614</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(n)\n",
       "0       614"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Graph: 266 nodes and 614 edges\n",
      "CPU times: user 3.53 ms, sys: 1.03 ms, total: 4.55 ms\n",
      "Wall time: 4.2 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Count all nodes\n",
    "command = \"\"\"\n",
    "MATCH (n)\n",
    "RETURN COUNT(n)\n",
    "\"\"\"\n",
    "df_count_nodes = client.query(command)\n",
    "display(df_count_nodes)\n",
    "\n",
    "# Count all edges\n",
    "command = \"\"\"\n",
    "MATCH (n)-->()\n",
    "RETURN COUNT(n)\n",
    "\"\"\"\n",
    "df_count_edges = client.query(command)\n",
    "display(df_count_edges)\n",
    "\n",
    "# Find number of nodes and number of edges in the graph\n",
    "n_nodes = int(df_count_nodes.loc[0, \"COUNT(n)\"])\n",
    "n_edges = int(df_count_edges.loc[0, \"COUNT(n)\"])\n",
    "print(f\"Graph: {n_nodes:,} nodes and {n_edges:,} edges\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3feefd0f-35a5-44dd-9c68-0a6f86800032",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "29470976-c240-46d0-b74b-388039672744",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "----------------------------------------------------------------------------------------------------\n",
      "label: Station\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.displayName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Northwood Hills</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Northwood</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Moor Park</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Croxley</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Watford</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>261</th>\n",
       "      <td>Wimbledon Park</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>262</th>\n",
       "      <td>Wimbledon</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>263</th>\n",
       "      <td>Earl's Court</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>264</th>\n",
       "      <td>West Kensington</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>265</th>\n",
       "      <td>Barons Court</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>266 rows × 1 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       n.displayName\n",
       "0    Northwood Hills\n",
       "1          Northwood\n",
       "2          Moor Park\n",
       "3            Croxley\n",
       "4            Watford\n",
       "..               ...\n",
       "261   Wimbledon Park\n",
       "262        Wimbledon\n",
       "263     Earl's Court\n",
       "264  West Kensington\n",
       "265     Barons Court\n",
       "\n",
       "[266 rows x 1 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>266</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0       266"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n"
     ]
    }
   ],
   "source": [
    "# Count number of nodes for each label\n",
    "for label in df_labels[\"label\"]:\n",
    "    print(100 * '-')\n",
    "    print(f\"label: {label}\")\n",
    "    df_curr_label = client.query(f\"\"\"\n",
    "    MATCH (n:{label})\n",
    "    RETURN n.displayName\n",
    "    \"\"\")\n",
    "    df_curr_label_count = client.query(f\"\"\"\n",
    "    MATCH (n:{label})\n",
    "    RETURN count(n)\n",
    "    \"\"\")\n",
    "    display(df_curr_label)\n",
    "    display(df_curr_label_count)\n",
    "    \n",
    "    print()\n",
    "print(100 * '-')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d4877074-a2fa-4aaf-92c4-c995f6f9ab4e",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "73ab0a9f-fb85-47ee-a976-2a0ae9db914a",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "8386b186-3a45-444c-89e6-30e2a38d91b1",
   "metadata": {},
   "source": [
    "## Queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "93fcec6e-0cc8-49cd-90c8-1269654dbca5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.displayName</th>\n",
       "      <th>e.Line</th>\n",
       "      <th>m.displayName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Northwood Hills</td>\n",
       "      <td>Metropolitan</td>\n",
       "      <td>Northwood</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Northwood Hills</td>\n",
       "      <td>Metropolitan</td>\n",
       "      <td>Pinner</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Northwood</td>\n",
       "      <td>Metropolitan</td>\n",
       "      <td>Moor Park</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Northwood</td>\n",
       "      <td>Metropolitan</td>\n",
       "      <td>Northwood Hills</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Moor Park</td>\n",
       "      <td>Metropolitan</td>\n",
       "      <td>Croxley</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>609</th>\n",
       "      <td>West Kensington</td>\n",
       "      <td>District</td>\n",
       "      <td>Earl's Court</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>610</th>\n",
       "      <td>West Kensington</td>\n",
       "      <td>District</td>\n",
       "      <td>Barons Court</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>611</th>\n",
       "      <td>Barons Court</td>\n",
       "      <td>District</td>\n",
       "      <td>West Kensington</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>612</th>\n",
       "      <td>Barons Court</td>\n",
       "      <td>Piccadilly</td>\n",
       "      <td>Hammersmith</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>613</th>\n",
       "      <td>Barons Court</td>\n",
       "      <td>Piccadilly</td>\n",
       "      <td>Earl's Court</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>614 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "       n.displayName        e.Line    m.displayName\n",
       "0    Northwood Hills  Metropolitan        Northwood\n",
       "1    Northwood Hills  Metropolitan           Pinner\n",
       "2          Northwood  Metropolitan        Moor Park\n",
       "3          Northwood  Metropolitan  Northwood Hills\n",
       "4          Moor Park  Metropolitan          Croxley\n",
       "..               ...           ...              ...\n",
       "609  West Kensington      District     Earl's Court\n",
       "610  West Kensington      District     Barons Court\n",
       "611     Barons Court      District  West Kensington\n",
       "612     Barons Court    Piccadilly      Hammersmith\n",
       "613     Barons Court    Piccadilly     Earl's Court\n",
       "\n",
       "[614 rows x 3 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.7 ms, sys: 36 μs, total: 3.74 ms\n",
      "Wall time: 3.42 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Match all edges and return them - all links between two stations\n",
    "command = \"\"\"\n",
    "MATCH (n)-[e]->(m)\n",
    "RETURN n.displayName, e.Line, m.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "445983c7-812c-4dbc-84e0-e9351487ecf6",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "No result found\n",
      "CPU times: user 1.54 ms, sys: 0 ns, total: 1.54 ms\n",
      "Wall time: 1.56 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Check if there exists a path between Hoxton Station and South Kensington in 1 hop\n",
    "command = \"\"\"\n",
    "MATCH (departure)-[link]->(arrival)\n",
    "WHERE departure.displayName = 'Hoxton Station'\n",
    "AND arrival.displayName = 'South Kensington'\n",
    "RETURN departure.displayName, link, arrival.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "1428bab6-f114-4e2a-8708-a83787259968",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>departure.displayName</th>\n",
       "      <th>link.Line</th>\n",
       "      <th>link.DistanceMeters</th>\n",
       "      <th>arrival.displayName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Blackfriars</td>\n",
       "      <td>Circle</td>\n",
       "      <td>328</td>\n",
       "      <td>Mansion House</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  departure.displayName link.Line  link.DistanceMeters arrival.displayName\n",
       "0           Blackfriars    Circle                  328       Mansion House"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.88 ms, sys: 0 ns, total: 2.88 ms\n",
      "Wall time: 2.72 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Check if there exists a path between Blackfriars and Mansion House in 1 hop\n",
    "command = \"\"\"\n",
    "MATCH (departure)-[link]->(arrival)\n",
    "WHERE departure.displayName = 'Blackfriars'\n",
    "AND arrival.displayName = 'Mansion House'\n",
    "RETURN departure.displayName, link.Line, link.DistanceMeters, arrival.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "51a19a2e-e456-4ebe-b69a-79950907d422",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>departure.displayName</th>\n",
       "      <th>intermediate.displayName</th>\n",
       "      <th>arrival.displayName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Victoria</td>\n",
       "      <td>Sloane Square</td>\n",
       "      <td>South Kensington</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  departure.displayName intermediate.displayName arrival.displayName\n",
       "0              Victoria            Sloane Square    South Kensington"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.75 ms, sys: 0 ns, total: 2.75 ms\n",
      "Wall time: 2.53 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Check if there exists a path between Victoria and South Kensington in 2 hops\n",
    "command = \"\"\"\n",
    "MATCH (departure)-->(intermediate)-->(arrival)\n",
    "WHERE departure.displayName = 'Victoria'\n",
    "AND arrival.displayName = 'South Kensington'\n",
    "RETURN departure.displayName, intermediate.displayName, arrival.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "f55ad425-2abf-4176-ba6d-011438d044ff",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>departure.displayName</th>\n",
       "      <th>l1.Line</th>\n",
       "      <th>intermediate.displayName</th>\n",
       "      <th>l2.Line</th>\n",
       "      <th>arrival.displayName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Victoria</td>\n",
       "      <td>Circle</td>\n",
       "      <td>Sloane Square</td>\n",
       "      <td>Circle</td>\n",
       "      <td>South Kensington</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  departure.displayName l1.Line intermediate.displayName l2.Line  \\\n",
       "0              Victoria  Circle            Sloane Square  Circle   \n",
       "\n",
       "  arrival.displayName  \n",
       "0    South Kensington  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.05 ms, sys: 2 μs, total: 3.05 ms\n",
      "Wall time: 3.11 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Check if there exists a path between Victoria and South Kensington in 2 hops returning connections\n",
    "command = \"\"\"\n",
    "MATCH (departure)-[l1:CONNECTION]->(intermediate)-[l2:CONNECTION]->(arrival)\n",
    "WHERE departure.displayName = 'Victoria'\n",
    "AND arrival.displayName = 'South Kensington'\n",
    "RETURN departure.displayName, l1.Line, intermediate.displayName, l2.Line, arrival.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "4c684889-d694-4a9d-b08d-c01d48c1a722",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "No result found\n",
      "CPU times: user 1.44 ms, sys: 24 μs, total: 1.46 ms\n",
      "Wall time: 1.39 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Check if there exists a path between Victoria and South Kensington in 2 hops using District Line only\n",
    "command = \"\"\"\n",
    "MATCH (departure)-[l1:CONNECTION]->(intermediate)-[l2:CONNECTION]->(arrival)\n",
    "WHERE departure.displayName = 'Victoria'\n",
    "AND arrival.displayName = 'South Kensington'\n",
    "AND l1.Line = 'District Line'\n",
    "AND l2.Line = 'District Line'\n",
    "RETURN departure.displayName, l1.Line, intermediate.displayName, l2.Line, arrival.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "2ca59102-21aa-4686-ab6c-78e0329644b7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>departure.displayName</th>\n",
       "      <th>l1.Line</th>\n",
       "      <th>intermediate.displayName</th>\n",
       "      <th>l2.Line</th>\n",
       "      <th>arrival.displayName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Victoria</td>\n",
       "      <td>Circle</td>\n",
       "      <td>Sloane Square</td>\n",
       "      <td>Circle</td>\n",
       "      <td>South Kensington</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  departure.displayName l1.Line intermediate.displayName l2.Line  \\\n",
       "0              Victoria  Circle            Sloane Square  Circle   \n",
       "\n",
       "  arrival.displayName  \n",
       "0    South Kensington  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.95 ms, sys: 0 ns, total: 2.95 ms\n",
      "Wall time: 2.86 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Check if there exists a path between Victoria and South Kensington in 2 hops using Circle Line only\n",
    "command = \"\"\"\n",
    "MATCH (departure)-[l1:CONNECTION]->(intermediate)-[l2:CONNECTION]->(arrival)\n",
    "WHERE departure.displayName = 'Victoria'\n",
    "AND arrival.displayName = 'South Kensington'\n",
    "AND l1.Line = 'Circle'\n",
    "AND l2.Line = 'Circle'\n",
    "RETURN departure.displayName, l1.Line, intermediate.displayName, l2.Line, arrival.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "a26f80fc-1191-4573-8fef-b85d56534c4f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>departure.displayName</th>\n",
       "      <th>l1.Line</th>\n",
       "      <th>l1.DistanceMeters</th>\n",
       "      <th>i1.displayName</th>\n",
       "      <th>l2.Line</th>\n",
       "      <th>l2.DistanceMeters</th>\n",
       "      <th>i2.displayName</th>\n",
       "      <th>l3.Line</th>\n",
       "      <th>l3.DistanceMeters</th>\n",
       "      <th>arrival.displayName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Stratford</td>\n",
       "      <td>Central</td>\n",
       "      <td>2110</td>\n",
       "      <td>Mile End</td>\n",
       "      <td>Central</td>\n",
       "      <td>860</td>\n",
       "      <td>Bethnal Green</td>\n",
       "      <td>Central</td>\n",
       "      <td>1453</td>\n",
       "      <td>Liverpool Street</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  departure.displayName  l1.Line  l1.DistanceMeters i1.displayName  l2.Line  \\\n",
       "0             Stratford  Central               2110       Mile End  Central   \n",
       "\n",
       "   l2.DistanceMeters i2.displayName  l3.Line  l3.DistanceMeters  \\\n",
       "0                860  Bethnal Green  Central               1453   \n",
       "\n",
       "  arrival.displayName  \n",
       "0    Liverpool Street  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.86 ms, sys: 0 ns, total: 3.86 ms\n",
      "Wall time: 3.78 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Get route between Stratford and Liverpool Street getting distances between stations\n",
    "command = \"\"\"\n",
    "MATCH (departure)-[l1:CONNECTION]->(i1)-[l2:CONNECTION]->(i2)-[l3:CONNECTION]->(arrival)\n",
    "WHERE departure.displayName = 'Stratford'\n",
    "AND arrival.displayName = 'Liverpool Street'\n",
    "RETURN departure.displayName, l1.Line, l1.DistanceMeters,\n",
    "i1.displayName, l2.Line, l2.DistanceMeters,\n",
    "i2.displayName, l3.Line, l3.DistanceMeters,\n",
    "arrival.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c2b44fb8-394f-46ee-886c-456e215661b0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "33cbd804-cc61-4017-aa6b-0958b3df4954",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "1bf5595c-0b01-4668-8d20-403beecb7a7f",
   "metadata": {},
   "source": [
    "# Python functions to construct Cypher queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "ec073bb0-4b0c-4794-a7ca-4efdfc01be77",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define build_query_hops_with_edge function\n",
    "def build_query_hops_with_edge(\n",
    "    departure_station: str, arrival_station: str, hopCount: int\n",
    ") -> tuple[str, list[str]]:\n",
    "    \"\"\"\n",
    "    Build query string and corresponding column names.\n",
    "\n",
    "    Returns:\n",
    "        tuple: (query_string, column_names)\n",
    "    \"\"\"\n",
    "    #query = \"MATCH \"\n",
    "    #query += '(departure:Station{displayName:\"'\n",
    "    #query += departure_station\n",
    "    #query += '\"})'\n",
    "    query = \"MATCH (departure:Station)\"\n",
    "\n",
    "    for k in range(1, hopCount):\n",
    "        query += f\"-[c{k}:CONNECTION]->(st{k}:Station)\"\n",
    "\n",
    "    query += f\"\"\"-[c{hopCount}:CONNECTION]->(arrival:Station)\\n\n",
    "    WHERE departure.displayName = '{departure_station}'\n",
    "    AND arrival.displayName = '{arrival_station}'\n",
    "    \"\"\"\n",
    "\n",
    "    query += \" RETURN departure, departure.displayName, departure.Note, \"\n",
    "    for k in range(1, hopCount):\n",
    "        query += f\"c{k}.Line, st{k}, st{k}.displayName, st{k}.Note, \"\n",
    "    query += f\"c{hopCount}.Line, arrival, arrival.displayName, arrival.Note\"\n",
    "\n",
    "    return re.sub(' +', ' ', query.replace('\\n', ''))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "704cd4c3-118e-4186-af89-6dfb6d5de708",
   "metadata": {},
   "outputs": [],
   "source": [
    "departure_station = \"Paddington\"\n",
    "arrival_station = \"Blackfriars\"\n",
    "\n",
    "distmax = 14"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "167d7556-e683-4986-987d-0d9ebb76ca95",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "id": "aa5d4a9a-d266-4bee-bf95-cabcd517887d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "****************************************************************************************************\n",
      "*** k = 1\n",
      "\n",
      "query_str :\n",
      "MATCH (departure:Station)-[c1:CONNECTION]->(arrival:Station) WHERE departure.displayName = 'Paddington' AND arrival.displayName = 'Blackfriars' RETURN departure, departure.displayName, departure.Note, c1.Line, arrival, arrival.displayName, arrival.Note\n",
      "****************************************************************************************************\n",
      "*** k = 2\n",
      "\n",
      "query_str :\n",
      "MATCH (departure:Station)-[c1:CONNECTION]->(st1:Station)-[c2:CONNECTION]->(arrival:Station) WHERE departure.displayName = 'Paddington' AND arrival.displayName = 'Blackfriars' RETURN departure, departure.displayName, departure.Note, c1.Line, st1, st1.displayName, st1.Note, c2.Line, arrival, arrival.displayName, arrival.Note\n",
      "****************************************************************************************************\n",
      "*** k = 3\n",
      "\n",
      "query_str :\n",
      "MATCH (departure:Station)-[c1:CONNECTION]->(st1:Station)-[c2:CONNECTION]->(st2:Station)-[c3:CONNECTION]->(arrival:Station) WHERE departure.displayName = 'Paddington' AND arrival.displayName = 'Blackfriars' RETURN departure, departure.displayName, departure.Note, c1.Line, st1, st1.displayName, st1.Note, c2.Line, st2, st2.displayName, st2.Note, c3.Line, arrival, arrival.displayName, arrival.Note\n",
      "****************************************************************************************************\n",
      "*** k = 4\n",
      "\n",
      "query_str :\n",
      "MATCH (departure:Station)-[c1:CONNECTION]->(st1:Station)-[c2:CONNECTION]->(st2:Station)-[c3:CONNECTION]->(st3:Station)-[c4:CONNECTION]->(arrival:Station) WHERE departure.displayName = 'Paddington' AND arrival.displayName = 'Blackfriars' RETURN departure, departure.displayName, departure.Note, c1.Line, st1, st1.displayName, st1.Note, c2.Line, st2, st2.displayName, st2.Note, c3.Line, st3, st3.displayName, st3.Note, c4.Line, arrival, arrival.displayName, arrival.Note\n",
      "****************************************************************************************************\n",
      "*** k = 5\n",
      "\n",
      "query_str :\n",
      "MATCH (departure:Station)-[c1:CONNECTION]->(st1:Station)-[c2:CONNECTION]->(st2:Station)-[c3:CONNECTION]->(st3:Station)-[c4:CONNECTION]->(st4:Station)-[c5:CONNECTION]->(arrival:Station) WHERE departure.displayName = 'Paddington' AND arrival.displayName = 'Blackfriars' RETURN departure, departure.displayName, departure.Note, c1.Line, st1, st1.displayName, st1.Note, c2.Line, st2, st2.displayName, st2.Note, c3.Line, st3, st3.displayName, st3.Note, c4.Line, st4, st4.displayName, st4.Note, c5.Line, arrival, arrival.displayName, arrival.Note\n",
      "****************************************************************************************************\n",
      "*** k = 6\n",
      "\n",
      "query_str :\n",
      "MATCH (departure:Station)-[c1:CONNECTION]->(st1:Station)-[c2:CONNECTION]->(st2:Station)-[c3:CONNECTION]->(st3:Station)-[c4:CONNECTION]->(st4:Station)-[c5:CONNECTION]->(st5:Station)-[c6:CONNECTION]->(arrival:Station) WHERE departure.displayName = 'Paddington' AND arrival.displayName = 'Blackfriars' RETURN departure, departure.displayName, departure.Note, c1.Line, st1, st1.displayName, st1.Note, c2.Line, st2, st2.displayName, st2.Note, c3.Line, st3, st3.displayName, st3.Note, c4.Line, st4, st4.displayName, st4.Note, c5.Line, st5, st5.displayName, st5.Note, c6.Line, arrival, arrival.displayName, arrival.Note\n",
      "****************************************************************************************************\n",
      "*** k = 7\n",
      "\n",
      "query_str :\n",
      "MATCH (departure:Station)-[c1:CONNECTION]->(st1:Station)-[c2:CONNECTION]->(st2:Station)-[c3:CONNECTION]->(st3:Station)-[c4:CONNECTION]->(st4:Station)-[c5:CONNECTION]->(st5:Station)-[c6:CONNECTION]->(st6:Station)-[c7:CONNECTION]->(arrival:Station) WHERE departure.displayName = 'Paddington' AND arrival.displayName = 'Blackfriars' RETURN departure, departure.displayName, departure.Note, c1.Line, st1, st1.displayName, st1.Note, c2.Line, st2, st2.displayName, st2.Note, c3.Line, st3, st3.displayName, st3.Note, c4.Line, st4, st4.displayName, st4.Note, c5.Line, st5, st5.displayName, st5.Note, c6.Line, st6, st6.displayName, st6.Note, c7.Line, arrival, arrival.displayName, arrival.Note\n",
      "****************************************************************************************************\n",
      "*** k = 8\n",
      "\n",
      "query_str :\n",
      "MATCH (departure:Station)-[c1:CONNECTION]->(st1:Station)-[c2:CONNECTION]->(st2:Station)-[c3:CONNECTION]->(st3:Station)-[c4:CONNECTION]->(st4:Station)-[c5:CONNECTION]->(st5:Station)-[c6:CONNECTION]->(st6:Station)-[c7:CONNECTION]->(st7:Station)-[c8:CONNECTION]->(arrival:Station) WHERE departure.displayName = 'Paddington' AND arrival.displayName = 'Blackfriars' RETURN departure, departure.displayName, departure.Note, c1.Line, st1, st1.displayName, st1.Note, c2.Line, st2, st2.displayName, st2.Note, c3.Line, st3, st3.displayName, st3.Note, c4.Line, st4, st4.displayName, st4.Note, c5.Line, st5, st5.displayName, st5.Note, c6.Line, st6, st6.displayName, st6.Note, c7.Line, st7, st7.displayName, st7.Note, c8.Line, arrival, arrival.displayName, arrival.Note\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>departure</th>\n",
       "      <th>departure.displayName</th>\n",
       "      <th>departure.Note</th>\n",
       "      <th>c1.Line</th>\n",
       "      <th>st1</th>\n",
       "      <th>st1.displayName</th>\n",
       "      <th>st1.Note</th>\n",
       "      <th>c2.Line</th>\n",
       "      <th>st2</th>\n",
       "      <th>st2.displayName</th>\n",
       "      <th>...</th>\n",
       "      <th>st6.displayName</th>\n",
       "      <th>st6.Note</th>\n",
       "      <th>c7.Line</th>\n",
       "      <th>st7</th>\n",
       "      <th>st7.displayName</th>\n",
       "      <th>st7.Note</th>\n",
       "      <th>c8.Line</th>\n",
       "      <th>arrival</th>\n",
       "      <th>arrival.displayName</th>\n",
       "      <th>arrival.Note</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>177</td>\n",
       "      <td>Paddington</td>\n",
       "      <td>Stroll along the canals at Paddington Basin an...</td>\n",
       "      <td>Circle</td>\n",
       "      <td>176</td>\n",
       "      <td>Edgware Road</td>\n",
       "      <td>Explore Little Venice’s canals and visit the b...</td>\n",
       "      <td>Circle</td>\n",
       "      <td>174</td>\n",
       "      <td>Baker Street</td>\n",
       "      <td>...</td>\n",
       "      <td>Embankment</td>\n",
       "      <td>Relax in Victoria Embankment Gardens and see C...</td>\n",
       "      <td>Circle</td>\n",
       "      <td>202</td>\n",
       "      <td>Temple</td>\n",
       "      <td>Discover the historic Temple Church and stroll...</td>\n",
       "      <td>Circle</td>\n",
       "      <td>203</td>\n",
       "      <td>Blackfriars</td>\n",
       "      <td>Cross the Blackfriars Bridge to the Tate Moder...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1 rows × 35 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   departure departure.displayName  \\\n",
       "0        177            Paddington   \n",
       "\n",
       "                                      departure.Note c1.Line  st1  \\\n",
       "0  Stroll along the canals at Paddington Basin an...  Circle  176   \n",
       "\n",
       "  st1.displayName                                           st1.Note c2.Line  \\\n",
       "0    Edgware Road  Explore Little Venice’s canals and visit the b...  Circle   \n",
       "\n",
       "   st2 st2.displayName  ... st6.displayName  \\\n",
       "0  174    Baker Street  ...      Embankment   \n",
       "\n",
       "                                            st6.Note  c7.Line  st7  \\\n",
       "0  Relax in Victoria Embankment Gardens and see C...   Circle  202   \n",
       "\n",
       "  st7.displayName                                           st7.Note  c8.Line  \\\n",
       "0          Temple  Discover the historic Temple Church and stroll...   Circle   \n",
       "\n",
       "  arrival arrival.displayName  \\\n",
       "0     203         Blackfriars   \n",
       "\n",
       "                                        arrival.Note  \n",
       "0  Cross the Blackfriars Bridge to the Tate Moder...  \n",
       "\n",
       "[1 rows x 35 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "****************************************************************************************************\n",
      "CPU times: user 32 ms, sys: 3.07 ms, total: 35.1 ms\n",
      "Wall time: 37.7 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Loop over distance (number of hops) until we find a path between requested start and end stations\n",
    "for k in range(1, distmax + 1):\n",
    "    print(100 * \"*\")\n",
    "    print(f\"*** k = {k}\\n\")\n",
    "\n",
    "    # We get a query and column names\n",
    "    query_str = build_query_hops_with_edge(departure_station, arrival_station, k)\n",
    "    print(f\"query_str :\\n{query_str}\")\n",
    "    df_path = client.query(query_str)\n",
    "\n",
    "    if not df_path.empty:\n",
    "        display(df_path)\n",
    "        break\n",
    "\n",
    "print(100 * \"*\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6c73aa00-5fe8-4f88-a704-74cffd1bc3f3",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d7b3cf05-479a-4129-8816-919f7b5304fd",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "91d4e232-bba8-42a7-9021-16948db3d26c",
   "metadata": {},
   "source": [
    "# Process returned dataframe"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "id": "42fc0ba1-b898-4766-8d5e-79731fa75dc9",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Define create_journey_string function\n",
    "def create_journey_string(row):\n",
    "    \"\"\"Create journey string from DataFrame row - safer version\"\"\"\n",
    "    # Start with departure station\n",
    "    result = f\"({row['departure.displayName']})\"\n",
    "\n",
    "    # Find all available segment numbers\n",
    "    line_cols = [\n",
    "        col for col in row.index if col.startswith(\"c\") and col.endswith(\".Line\")\n",
    "    ]\n",
    "    segment_numbers = sorted([int(col.split(\".\")[0][1:]) for col in line_cols])\n",
    "\n",
    "    # Process each available segment\n",
    "    for i in segment_numbers:\n",
    "        line_col = f\"c{i}.Line\"\n",
    "        station_col = f\"st{i}.displayName\"\n",
    "\n",
    "        # Only process if both columns exist and have values\n",
    "        if (\n",
    "            line_col in row.index\n",
    "            and station_col in row.index\n",
    "            and not pd.isna(row[line_col])\n",
    "            and not pd.isna(row[station_col])\n",
    "        ):\n",
    "            line = row[line_col]\n",
    "            station = row[station_col]\n",
    "            result += f\"--[{line}]-->({station})\"\n",
    "\n",
    "    # Add arrival station if it exists\n",
    "    if \"arrival.displayName\" in row.index and not pd.isna(row[\"arrival.displayName\"]):\n",
    "        # Check if there's a final line segment to the arrival\n",
    "        max_segment = max(segment_numbers) if segment_numbers else 0\n",
    "        final_line_col = f\"l{max_segment}.Line\"\n",
    "        if final_line_col in row.index and not pd.isna(row[final_line_col]):\n",
    "            result += f\"--[{row[final_line_col]}]-->({row['arrival.displayName']})\"\n",
    "\n",
    "    return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "id": "be8d51f4-55f5-48b3-9935-2efb333c7c4e",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Path n°0: (Paddington)--[Circle]-->(Edgware Road)--[Circle]-->(Baker Street)--[Jubilee]-->(Bond Street)--[Jubilee]-->(Green Park)--[Jubilee]-->(Westminster)--[Circle]-->(Embankment)--[Circle]-->(Temple)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Show journey strings (multiple paths of the same length can exist between two stations)\n",
    "for i in range(min(len(df_path), 10)):\n",
    "    journey_path = create_journey_string(\n",
    "        df_path.filter(regex=\"displayName$|Line$\", axis=1).iloc[i]\n",
    "    )\n",
    "    print(f\"Path n°{i}: {journey_path}\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "116c55c2-682c-47c4-9f33-d106a4b9b832",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f731e1ef-4781-451e-9bc8-f9d8fbeaff0d",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "92c9f85a-f506-4ebf-b4f7-011fd266b151",
   "metadata": {},
   "source": [
    "# Create subgraph to visualise"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "ea62073e-c850-4490-94d5-a34581b2f6dc",
   "metadata": {},
   "outputs": [],
   "source": [
    "def get_subgraph(G, df):\n",
    "    subset_nodes = df.filter(regex=\"displayName$\", axis=1).iloc[0].values.tolist()\n",
    "    subG = G.subgraph(subset_nodes).copy()\n",
    "\n",
    "    return subG"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "9ef79aaa-ef72-4008-ba8d-b948a268b161",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "DiGraph with 9 nodes and 16 edges\n"
     ]
    }
   ],
   "source": [
    "# Get subgraph with stations from matched path\n",
    "subG = get_subgraph(G, df_path)\n",
    "print(subG)\n",
    "\n",
    "# Build CREATE command from subgraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 51,
   "id": "b244bb77-c4a2-4c86-ae37-a173e7b8cf81",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'london_transport_TfL1_subgraph'"
      ]
     },
     "execution_count": 51,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "subgraph_name = f\"{graph_name}_subgraph\"\n",
    "subgraph_name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1c6e9b37-18a0-4bf6-861b-c0fbd8daa436",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "id": "53245a48-3a83-431a-9b8d-5b3adee6ddda",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Writing subgraph to JSONL...\n",
      "JSONL file written to: /home/ubuntu/.turing/data/london_transport_TfL1_subgraph.jsonl\n",
      "Graph: 9 nodes, 16 edges\n",
      "\n",
      "Loading JSONL into TuringDB as graph 'london_transport_TfL1_subgraph' ...\n",
      "\n",
      "✓ Graph 'london_transport_TfL1_subgraph' created in 0.05 seconds\n",
      "CPU times: user 2.15 ms, sys: 13 μs, total: 2.16 ms\n",
      "Wall time: 49.7 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "start_time = time.time()\n",
    "\n",
    "# Write subgraph to JSONL format\n",
    "print(\"Writing subgraph to JSONL...\")\n",
    "jsonl_filename = networkx_to_jsonl(subG, subgraph_name)\n",
    "\n",
    "# Load JSONL into TuringDB\n",
    "print(f\"\\nLoading JSONL into TuringDB as graph '{subgraph_name}' ...\")\n",
    "client.query(f\"LOAD JSONL '{jsonl_filename}' AS {subgraph_name}\")\n",
    "\n",
    "execution_time = time.time() - start_time\n",
    "print(f\"\\n\\u2713 Graph '{subgraph_name}' created in {execution_time:.2f} seconds\")\n",
    "\n",
    "# Set active graph for querying\n",
    "client.set_graph(subgraph_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a730cedf-870a-4fde-8e68-75b873ce1ad3",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "bfa56824-de07-4a8e-bfaf-1404e3184e70",
   "metadata": {},
   "source": [
    "<div class=\"alert alert-block alert-info\">\n",
    "    <h2>\n",
    "        You can visualise the subgraph directly in the notebook below.\n",
    "    </h2>\n",
    "</div>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "b30a6f48-1481-4891-a9f9-755fc543283d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Warning: When  cdn_resources is 'local' jupyter notebook has issues displaying graphics on chrome/safari. Use cdn_resources='in_line' or cdn_resources='remote' if you have issues viewing graphics in a notebook.\n",
      "london_transport_TfL_subgraph.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"750px\"\n",
       "            src=\"london_transport_TfL_subgraph.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7ce71870a710>"
      ]
     },
     "execution_count": 54,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from pyvis.network import Network\n",
    "\n",
    "net = Network(\n",
    "    height=\"750px\",\n",
    "    width=\"100%\",\n",
    "    notebook=True,\n",
    "    bgcolor=\"#ffffff\",\n",
    "    font_color=\"#000000\",\n",
    "    directed=True,\n",
    ")\n",
    "\n",
    "# Line colors (official TfL colors)\n",
    "line_colors = {\n",
    "    \"Circle\": \"#FFD329\",\n",
    "    \"Jubilee\": \"#A1A5A7\",\n",
    "    \"Central\": \"#DC241F\",\n",
    "    \"District\": \"#00782A\",\n",
    "    \"Metropolitan\": \"#9B0058\",\n",
    "}\n",
    "\n",
    "for node, data in subG.nodes(data=True):\n",
    "    net.add_node(\n",
    "        node,\n",
    "        label=data.get(\"displayName\", str(node)),\n",
    "        title=f\"{data.get('displayName', '')}<br>{data.get('Note', '')}\",\n",
    "        color=\"#3498db\",\n",
    "        size=25,\n",
    "    )\n",
    "\n",
    "for source, target, data in subG.edges(data=True):\n",
    "    line = data.get(\"Line\", \"\")\n",
    "    color = line_colors.get(line, \"#95a5a6\")\n",
    "    net.add_edge(source, target, title=line, label=line, color=color, width=3)\n",
    "\n",
    "net.toggle_physics(True)\n",
    "net.show(f\"{example_name}_subgraph.html\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9c957088-f9b9-4b58-8342-25b155d5f169",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4248b085-e721-4dbb-a308-60754ee5f608",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "974242db-d94a-48fc-badc-7e377774a776",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "c3e6801a-37ab-4688-af4f-081494bb6f80",
   "metadata": {},
   "source": [
    "# Use LLM to generate Cypher query"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "492eb58d-4ef2-4536-b7b8-5bb347bd9263",
   "metadata": {},
   "source": [
    "Before running this section, create a `.env` file in the project root with your API keys:\n",
    "\n",
    "```env\n",
    "ANTHROPIC_API_KEY=your_key_here\n",
    "OPENAI_API_KEY=your_key_here\n",
    "MISTRAL_API_KEY=your_key_here"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "588590e5-c7ae-4900-a912-2fb8be8b6b81",
   "metadata": {},
   "outputs": [],
   "source": [
    "client.set_graph(graph_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "34cad8c8-0338-4fe0-8faf-4540103781ca",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "# Load environment variables from .env file\n",
    "if not load_dotenv():\n",
    "    raise ValueError(\"LLM credentials not saved in .env file\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "b059afc0-665c-4d2f-80af-d930288874d6",
   "metadata": {},
   "outputs": [],
   "source": [
    "api_keys = {\n",
    "    \"Anthropic\": os.getenv(\"ANTHROPIC_API_KEY\"),\n",
    "    \"Mistral\": os.getenv(\"MISTRAL_API_KEY\"),\n",
    "    \"OpenAI\": os.getenv(\"OPENAI_API_KEY\"),\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "73e087f6-ba54-4091-b012-d3fb77194b52",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "ce18ed35-2cde-41e6-93c5-04716542e3bb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 99.6 ms, sys: 10.9 ms, total: 111 ms\n",
      "Wall time: 5.38 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "system_prompt = \"\"\"\n",
    "Only base your response on the data provided.\n",
    "Do not add knowledge but describe it in a natural way as if you were a touristic guide, be friendly !\n",
    "You can add forms but not content.\n",
    "Format the output with nice Markdown format and emojis.\n",
    "\"\"\"\n",
    "\n",
    "prompt = f\"\"\"\n",
    "Here is the path I got from stations {departure_station} to {arrival_station} : {df_path.to_dict()}.\n",
    "Describe the path between these two stations.\n",
    "Give me an itinerary of things I could visit on the way.\n",
    "\"\"\"\n",
    "\n",
    "provider = \"Anthropic\"\n",
    "\n",
    "result = query_llm(\n",
    "    prompt=prompt,\n",
    "    system_prompt=system_prompt,\n",
    "    provider=provider,\n",
    "    model=\"claude-haiku-4-5-20251001\",\n",
    "    api_key=api_keys[provider],\n",
    "    temperature=0.2,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "bc8494e6-4d07-4348-919a-95fcfb0256fa",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/markdown": [
       "# 🚇 Your Journey from Paddington to Blackfriars\n",
       "\n",
       "Welcome aboard! Let me guide you through this wonderful route across London's iconic landmarks!\n",
       "\n",
       "## 📍 Your Route Overview\n",
       "\n",
       "You'll be traveling through **8 stations** using the **Circle and Jubilee lines**, passing through some of London's most famous attractions!\n",
       "\n",
       "---\n",
       "\n",
       "## 🎫 Station-by-Station Itinerary\n",
       "\n",
       "### 1️⃣ **Paddington** (Starting Point)\n",
       "🚂 *Circle Line*\n",
       "- 🐻 Visit the **Paddington Bear statue** - a beloved London icon\n",
       "- 🚶 Stroll along the charming **Paddington Basin canals**\n",
       "\n",
       "### 2️⃣ **Edgware Road**\n",
       "🚂 *Circle Line*\n",
       "- 🏘️ Explore **Little Venice's picturesque canals**\n",
       "- ⛪ Visit the beautiful **St Mary Magdalene Church**\n",
       "\n",
       "### 3️⃣ **Baker Street**\n",
       "🚂 *Circle Line*\n",
       "- 🔍 Step into **221B Baker Street** - Sherlock Holmes' famous address\n",
       "- 🎭 Meet wax celebrities at **Madame Tussauds**\n",
       "\n",
       "### 4️⃣ **Bond Street**\n",
       "🚂 *Jubilee Line*\n",
       "- 💎 Shop **luxury boutiques on Bond Street**\n",
       "- 🛍️ Browse **high-street stores along Oxford Street**\n",
       "\n",
       "### 5️⃣ **Green Park**\n",
       "🚂 *Jubilee Line*\n",
       "- 🌳 Stroll through the serene **Green Park**\n",
       "- 👑 Head to nearby **Buckingham Palace**\n",
       "- 🎪 Visit **Piccadilly** for entertainment and dining\n",
       "\n",
       "### 6️⃣ **Westminster**\n",
       "🚂 *Jubilee Line*\n",
       "- 🏛️ Marvel at the **Houses of Parliament and Big Ben**\n",
       "- ⛪ Visit the magnificent **Westminster Abbey**\n",
       "\n",
       "### 7️⃣ **Embankment**\n",
       "🚂 *Circle Line*\n",
       "- 🌿 Relax in **Victoria Embankment Gardens**\n",
       "- 🗿 See the iconic **Cleopatra's Needle** along the Thames\n",
       "\n",
       "### 8️⃣ **Temple**\n",
       "🚂 *Circle Line*\n",
       "- ⛪ Discover the historic **Temple Church**\n",
       "- 🌳 Stroll through **Victoria Embankment Gardens** again\n",
       "\n",
       "### 🎯 **Blackfriars** (Final Destination)\n",
       "- 🎨 Cross the **Blackfriars Bridge** to reach the **Tate Modern**\n",
       "- 🚶 Explore the beautiful **riverside walkways**\n",
       "\n",
       "---\n",
       "\n",
       "## ✨ Highlights of Your Journey\n",
       "\n",
       "This route takes you through the **heart of London**, from the quirky charm of Paddington to the cultural treasures of Blackfriars. You'll experience royal London, literary history, world-class museums, and stunning riverside views! \n",
       "\n",
       "**Enjoy your adventure!** 🎉"
      ],
      "text/plain": [
       "<IPython.core.display.Markdown object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "display(Markdown(result))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cbc313d9-581f-40f9-ae0c-0e79703275cb",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e54ece2c-f3ec-4819-a27c-6ad8fae00be0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "b1f3660e-97b7-49b1-9624-67387510606e",
   "metadata": {},
   "source": [
    "# Use LLM to generate Cypher query"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 129,
   "id": "098a6e0c-d5b6-450d-9e8d-924409bb94e1",
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Build system prompt with TuringDB schema and examples\"\"\"\n",
    "\n",
    "turingdb_cypher_system_prompt = \"\"\"\n",
    "You are an expert at converting natural language questions into TuringDB queries.\n",
    "\n",
    "Your task is to generate syntactically correct TuringDB queries based on natural language input.\n",
    "\n",
    "VERY IMPORTANT - YOU MUST FOLLOW THESE REQUESTS - TuringDB Syntax Guidelines:\n",
    "1. Return ONLY the TuringDB query, no explanations or markdown formatting\n",
    "2. Use MATCH, CREATE and WHERE operations only\n",
    "3. Nodes: (n:Label {property: value})\n",
    "4. Edges: Use DIRECTED syntax with ->\n",
    "5. Pattern matching: MATCH (n)-[e]->(m)\n",
    "6. Property matching: Use : operator for exact matching\n",
    "7. Multiple constraints: (n:Person:Engineer {name: \"John\", age: 30})\n",
    "8. Return all matched entities: RETURN n, e, m or use RETURN * for all\n",
    "9. Filter using WHERE clause: MATCH (n:Person) WHERE n.name = 'John' RETURN n.firstname, n.lastname\n",
    "\n",
    "VERY IMPORTANT - YOU ARE NOT ALLOWED TO USE THE FOLLOWING - FORBIDDEN in TuringDB:\n",
    "- Do NOT use AS aliases\n",
    "- Do NOT use LIMIT, SKIP clauses\n",
    "- Do NOT use WITH clauses\n",
    "- Do NOT use CALL (except for metaqueries)\n",
    "- Do NOT use toLower() or other functions\n",
    "- Do NOT use wildcard character (*)\n",
    "- Do NOT use multi-hops pattern for edges: e.g. `-[e:CONNECTED*1..10]->`\n",
    "- Do NOT use \"end\" or \"s3\" variable name\n",
    "\n",
    "Supported TuringDB Operations:\n",
    "- MATCH queries: MATCH (n:Label)-[e:Type]->(m) RETURN n, m\n",
    "- CREATE queries: CREATE (n:Label{property:\"value\"})-[e:Type]->(m:Label)\n",
    "- Metaqueries: CALL db.propertyTypes(), CALL db.labels(), CALL db.edgeTypes()\n",
    "- Property types: String (\"text\" or `text`), Boolean (true/false), Integer (20), Double (20.5)\n",
    "\n",
    "Examples for few-shot learning:\n",
    "- Find all persons: MATCH (n:Person) RETURN n\n",
    "- Find connections: MATCH (n:Person)-[e]->(m:Person) RETURN n, e, m\n",
    "- Create person: CREATE (n:Person {name: \"John\", age: 30})\n",
    "- Match person with specific name: MATCH (p:Person) WHERE p.name = \"John\" RETURN p\n",
    "- Path with 1 hop between Station Paddington and Blackfriars:  MATCH (departure:Station{displayName:\"Paddington\"})-[c1:CONNECTED]->(arrival:Station{displayName:\"Blackfriars\"}) RETURN start, start.displayName, start.Note, ec.Line, last, last.displayName, last.Note\n",
    "- Path with 2 hops between Station Paddington and Blackfriars: MATCH (departure:Station{displayName:\"Paddington\"})-[c1:CONNECTED]->(st1:Station)-[c2:CONNECTED]->(arrival:Station{displayName:\"Blackfriars\"}) RETURN start, start.displayName, start.Note, c1.Line, s1, s1.displayName, s1.Note, c2.Line, last, last.displayName, last.Note\n",
    "- Path with 8 hops between Station Paddington and Blackfriars: MATCH (departure:Station{displayName:\"Paddington\"})-[c1:CONNECTED]->(st1:Station)-[c2:CONNECTED]->(st2:Station)-[c3:CONNECTED]->(st3:Station)-[c4:CONNECTED]->(st4:Station)-[c5:CONNECTED]->(st5:Station)-[c6:CONNECTED]->(st6:Station)-[c7:CONNECTED]->(st7:Station)-[c8:CONNECTED]->(arrival:Station{displayName:\"Blackfriars\"}) RETURN start, start.displayName, start.Note, c1.Line, st1, st1.displayName, st1.Note, c2.Line, st2, st2.displayName, st2.Note, c3.Line, st3, st3.displayName, st3.Note, c4.Line, st4, st4.displayName, st4.Note, c5.Line, st5, st5.displayName, st5.Note, c6.Line, st6, st6.displayName, st6.Note, c7.Line, st7, st7.displayName, st7.Note, c8.Line, last, last.displayName, last.Note\n",
    "- Find all Chinese providers and what they supply: MATCH (n{provider_country:\"CHN\"}) RETURN n, n.provider_name, n.displayName, n.share_provided, n.type\n",
    "- Find all deposition tools and their types: MATCH (specific)-[e:IS_TYPE_OF]->(general:Tool_Resource{displayName:\"Deposition tools\"}) RETURN specific, specific.displayName, specific.provider_name, e, general, general.displayName\n",
    "\n",
    "## SCHEMA CONTEXT\n",
    "{schema_context}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 130,
   "id": "0f2c1e4a-0685-4434-a168-cb2930a5253c",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Build schema context for LLM\n",
    "labels_result = client.query(\"CALL db.labels()\")\n",
    "rel_types_result = client.query(\"CALL db.edgeTypes()\")\n",
    "prop_types_result = client.query(\"CALL db.propertyTypes()\")\n",
    "query_sample_nodes = \"MATCH (n) RETURN \" + \", \".join([f\"n.`{prop}`\" for prop in prop_types_result[\"propertyType\"].tolist()]) + \"LIMIT 3\"\n",
    "sample_nodes = client.query(query_sample_nodes)\n",
    "\n",
    "schema_context = f\"\"\"Node labels: {labels_result}\n",
    "Relationship types: {rel_types_result}\n",
    "Property names and types: {prop_types_result}\n",
    "Sample nodes: {sample_nodes}\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e89fc27f-3421-4d58-bada-e22c292e7197",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 138,
   "id": "b3bb1bd2-e27f-4f7c-8a37-0b3984d39545",
   "metadata": {},
   "outputs": [],
   "source": [
    "from turingdb.exceptions import TuringDBException"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 132,
   "id": "2e43f62a-de87-4761-ae40-b627706d4475",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "****************************************************************************************************\n",
      "*** k = 1\n",
      "\n",
      "cypher_query : MATCH (departure:Station{displayName:\"Paddington\"})-[c1:CONNECTION]->(arrival:Station{displayName:\"Blackfriars\"}) RETURN departure, departure.displayName, departure.Note, c1, c1.Line, arrival, arrival.displayName, arrival.Note\n",
      "--> No result found\n",
      "\n",
      "****************************************************************************************************\n",
      "*** k = 2\n",
      "\n",
      "cypher_query : MATCH (departure:Station{displayName:\"Paddington\"})-[c1:CONNECTION]->(st1:Station)-[c2:CONNECTION]->(arrival:Station{displayName:\"Blackfriars\"}) RETURN departure, departure.displayName, departure.Note, c1, c1.Line, st1, st1.displayName, st1.Note, c2, c2.Line, arrival, arrival.displayName, arrival.Note\n",
      "--> No result found\n",
      "\n",
      "****************************************************************************************************\n",
      "*** k = 3\n",
      "\n",
      "cypher_query : MATCH (departure:Station{displayName:\"Paddington\"})-[c1:CONNECTION]->(st1:Station)-[c2:CONNECTION]->(st2:Station)-[c3:CONNECTION]->(arrival:Station{displayName:\"Blackfriars\"}) RETURN departure, departure.displayName, departure.Note, c1.Line, st1, st1.displayName, st1.Note, c2.Line, st2, st2.displayName, st2.Note, c3.Line, arrival, arrival.displayName, arrival.Note\n",
      "--> No result found\n",
      "\n",
      "****************************************************************************************************\n",
      "*** k = 4\n",
      "\n",
      "cypher_query : MATCH (departure:Station{displayName:\"Paddington\"})-[c1:CONNECTION]->(st1:Station)-[c2:CONNECTION]->(st2:Station)-[c3:CONNECTION]->(st3:Station)-[c4:CONNECTION]->(arrival:Station{displayName:\"Blackfriars\"}) RETURN departure, departure.displayName, departure.Note, c1.Line, st1, st1.displayName, st1.Note, c2.Line, st2, st2.displayName, st2.Note, c3.Line, st3, st3.displayName, st3.Note, c4.Line, arrival, arrival.displayName, arrival.Note\n",
      "--> No result found\n",
      "\n",
      "****************************************************************************************************\n",
      "*** k = 5\n",
      "\n",
      "cypher_query : MATCH (departure:Station{displayName:\"Paddington\"})-[c1:CONNECTION]->(st1:Station)-[c2:CONNECTION]->(st2:Station)-[c3:CONNECTION]->(st3:Station)-[c4:CONNECTION]->(st4:Station)-[c5:CONNECTION]->(arrival:Station{displayName:\"Blackfriars\"}) RETURN departure, departure.displayName, departure.Note, c1.Line, st1, st1.displayName, st1.Note, c2.Line, st2, st2.displayName, st2.Note, c3.Line, st3, st3.displayName, st3.Note, c4.Line, st4, st4.displayName, st4.Note, c5.Line, arrival, arrival.displayName, arrival.Note\n",
      "--> No result found\n",
      "\n",
      "****************************************************************************************************\n",
      "*** k = 6\n",
      "\n",
      "cypher_query : MATCH (departure:Station{displayName:\"Paddington\"})-[c1:CONNECTION]->(st1:Station)-[c2:CONNECTION]->(st2:Station)-[c3:CONNECTION]->(st3:Station)-[c4:CONNECTION]->(st4:Station)-[c5:CONNECTION]->(st5:Station)-[c6:CONNECTION]->(arrival:Station{displayName:\"Blackfriars\"}) RETURN departure, departure.displayName, departure.Note, c1, c1.Line, st1, st1.displayName, st1.Note, c2, c2.Line, st2, st2.displayName, st2.Note, c3, c3.Line, st3, st3.displayName, st3.Note, c4, c4.Line, st4, st4.displayName, st4.Note, c5, c5.Line, st5, st5.displayName, st5.Note, c6, c6.Line, arrival, arrival.displayName, arrival.Note\n",
      "--> No result found\n",
      "\n",
      "****************************************************************************************************\n",
      "*** k = 7\n",
      "\n",
      "cypher_query : MATCH (departure:Station{displayName:\"Paddington\"})-[c1:CONNECTION]->(st1:Station)-[c2:CONNECTION]->(st2:Station)-[c3:CONNECTION]->(st3:Station)-[c4:CONNECTION]->(st4:Station)-[c5:CONNECTION]->(st5:Station)-[c6:CONNECTION]->(st6:Station)-[c7:CONNECTION]->(arrival:Station{displayName:\"Blackfriars\"}) RETURN departure, departure.displayName, departure.Note, c1, c1.Line, st1, st1.displayName, st1.Note, c2, c2.Line, st2, st2.displayName, st2.Note, c3, c3.Line, st3, st3.displayName, st3.Note, c4, c4.Line, st4, st4.displayName, st4.Note, c5, c5.Line, st5, st5.displayName, st5.Note, c6, c6.Line, st6, st6.displayName, st6.Note, c7, c7.Line, arrival, arrival.displayName, arrival.Note\n",
      "--> No result found\n",
      "\n",
      "****************************************************************************************************\n",
      "*** k = 8\n",
      "\n",
      "cypher_query : MATCH (departure:Station{displayName:\"Paddington\"})-[c1:CONNECTION]->(st1:Station)-[c2:CONNECTION]->(st2:Station)-[c3:CONNECTION]->(st3:Station)-[c4:CONNECTION]->(st4:Station)-[c5:CONNECTION]->(st5:Station)-[c6:CONNECTION]->(st6:Station)-[c7:CONNECTION]->(st7:Station)-[c8:CONNECTION]->(arrival:Station{displayName:\"Blackfriars\"}) RETURN departure, departure.displayName, departure.Note, c1, c1.Line, st1, st1.displayName, st1.Note, c2, c2.Line, st2, st2.displayName, st2.Note, c3, c3.Line, st3, st3.displayName, st3.Note, c4, c4.Line, st4, st4.displayName, st4.Note, c5, c5.Line, st5, st5.displayName, st5.Note, c6, c6.Line, st6, st6.displayName, st6.Note, c7, c7.Line, st7, st7.displayName, st7.Note, c8, c8.Line, arrival, arrival.displayName, arrival.Note\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>departure</th>\n",
       "      <th>departure.displayName</th>\n",
       "      <th>departure.Note</th>\n",
       "      <th>c1</th>\n",
       "      <th>c1.Line</th>\n",
       "      <th>st1</th>\n",
       "      <th>st1.displayName</th>\n",
       "      <th>st1.Note</th>\n",
       "      <th>c2</th>\n",
       "      <th>c2.Line</th>\n",
       "      <th>...</th>\n",
       "      <th>c7</th>\n",
       "      <th>c7.Line</th>\n",
       "      <th>st7</th>\n",
       "      <th>st7.displayName</th>\n",
       "      <th>st7.Note</th>\n",
       "      <th>c8</th>\n",
       "      <th>c8.Line</th>\n",
       "      <th>arrival</th>\n",
       "      <th>arrival.displayName</th>\n",
       "      <th>arrival.Note</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>177</td>\n",
       "      <td>Paddington</td>\n",
       "      <td>Stroll along the canals at Paddington Basin an...</td>\n",
       "      <td>410</td>\n",
       "      <td>Circle</td>\n",
       "      <td>176</td>\n",
       "      <td>Edgware Road</td>\n",
       "      <td>Explore Little Venice’s canals and visit the b...</td>\n",
       "      <td>406</td>\n",
       "      <td>Circle</td>\n",
       "      <td>...</td>\n",
       "      <td>378</td>\n",
       "      <td>Circle</td>\n",
       "      <td>202</td>\n",
       "      <td>Temple</td>\n",
       "      <td>Discover the historic Temple Church and stroll...</td>\n",
       "      <td>463</td>\n",
       "      <td>Circle</td>\n",
       "      <td>203</td>\n",
       "      <td>Blackfriars</td>\n",
       "      <td>Cross the Blackfriars Bridge to the Tate Moder...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1 rows × 43 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   departure departure.displayName  \\\n",
       "0        177            Paddington   \n",
       "\n",
       "                                      departure.Note   c1 c1.Line  st1  \\\n",
       "0  Stroll along the canals at Paddington Basin an...  410  Circle  176   \n",
       "\n",
       "  st1.displayName                                           st1.Note   c2  \\\n",
       "0    Edgware Road  Explore Little Venice’s canals and visit the b...  406   \n",
       "\n",
       "  c2.Line  ...   c7 c7.Line  st7  st7.displayName  \\\n",
       "0  Circle  ...  378  Circle  202           Temple   \n",
       "\n",
       "                                            st7.Note   c8 c8.Line arrival  \\\n",
       "0  Discover the historic Temple Church and stroll...  463  Circle     203   \n",
       "\n",
       "   arrival.displayName                                       arrival.Note  \n",
       "0          Blackfriars  Cross the Blackfriars Bridge to the Tate Moder...  \n",
       "\n",
       "[1 rows x 43 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "****************************************************************************************************\n",
      "CPU times: user 74.5 ms, sys: 9.01 ms, total: 83.5 ms\n",
      "Wall time: 12.1 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Define maximum number of hops between two\n",
    "distmax = 14\n",
    "\n",
    "# Get subset of CREATE command to avoid exceeding context window\n",
    "\n",
    "for k in range(1, distmax + 1):\n",
    "    print(100 * \"*\")\n",
    "    print(f\"*** k = {k}\\n\")\n",
    "\n",
    "    #########################################################################################################\n",
    "    question = f\"\"\"\n",
    "    Give me the Cypher query to find the path using London Tube between stations {departure_station} and {arrival_station}.\n",
    "    The path between the two stations has to contain {k} hops.\n",
    "    Very important :\n",
    "    - Make sure you respect the number of hops and stations required between the two stations.\n",
    "    - Pay attention to use the correct node and edge properties name in the MATCH section.\n",
    "    - Pay attention to use the correct node and edge properties name in the RETURN section.\n",
    "    - If no contrary information is asked by the user :\n",
    "        - return all the matched nodes and edges and their properties in the RETURN section.\n",
    "    \"\"\"\n",
    "\n",
    "    system_prompt = f\"\"\"\n",
    "    TuringDB Cypher prompt :\n",
    "    {turingdb_cypher_system_prompt}\n",
    "    \n",
    "    Here is a subset of the CREATE command used to create the graph, this way you know graph structure.\n",
    "    Only a subset is passed because the whole command is too long. Please use this as the most relevant source of information :\n",
    "    - Use the correct node and edge properties name in the MATCH section.\n",
    "    - Use the correct node and edge properties name in the RETURN section.\n",
    "    - Pay attention to which properties come from nodes or edges, to create a functioning query\n",
    "    - Pay attention to lower and uppercases in properties\n",
    "    - If some properties contain spaces, be careful to wrap them\n",
    "    \n",
    "    Give me only the query FOLLOWING TURINGDB GUIDELINES AND NOT USING WHAT IS FORBIDDEN for this specific question :\n",
    "    \"\"\"\n",
    "    system_prompt += turingdb_cypher_system_prompt.replace(\"{schema_context}\", schema_context)\n",
    "\n",
    "    cypher_query = natural_language_to_cypher(\n",
    "        question=question,\n",
    "        system_prompt=system_prompt,\n",
    "        provider=provider,\n",
    "        model=\"claude-haiku-4-5-20251001\",\n",
    "        api_key=api_keys[provider],\n",
    "    )\n",
    "    print(f\"cypher_query : {cypher_query}\")\n",
    "\n",
    "    #########################################################################################################\n",
    "\n",
    "    ## Build column names to exactly match the RETURN clause\n",
    "    # column_names = ['start', 'start.displayName', 'start.Note']\n",
    "    #\n",
    "    # for k_ in range(1, k):\n",
    "    #    column_names.extend([\n",
    "    #        f'e{k_}.Line',\n",
    "    #        f's{k_}',\n",
    "    #        f's{k_}.displayName',\n",
    "    #        f's{k_}.Note'\n",
    "    #    ])\n",
    "    #\n",
    "    # column_names.extend([\n",
    "    #    f'e{k}.Line',\n",
    "    #    'end',\n",
    "    #    'end.displayName',\n",
    "    #    'end.Note'\n",
    "    # ])\n",
    "    cypher_query\n",
    "\n",
    "    #########################################################################################################\n",
    "\n",
    "    try:\n",
    "        df_path = client.query(cypher_query)\n",
    "        if df_path.empty:\n",
    "            print(\"--> No result found\\n\")\n",
    "        else:\n",
    "            display(df_path)\n",
    "            break\n",
    "    except TuringDBException as e:\n",
    "        print(f\"Query generated by LLM failed.\")\n",
    "    \n",
    "print(100 * \"*\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1b2b7b79-1d23-469c-926a-d52b63045f59",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 136,
   "id": "2f34385c-bb2b-4d09-8ebd-90754a719e06",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Path n°0: (Paddington)--[Circle]-->(Edgware Road)--[Circle]-->(Baker Street)--[Jubilee]-->(Bond Street)--[Jubilee]-->(Green Park)--[Jubilee]-->(Westminster)--[Circle]-->(Embankment)--[Circle]-->(Temple)\n",
      "\n"
     ]
    }
   ],
   "source": [
    "# Show journey strings (multiple paths of the same length can exist between two stations)\n",
    "for i in range(min(len(df_path), 10)):\n",
    "    journey_path = create_journey_string(\n",
    "        df_path.filter(regex=\"displayName$|Line$\", axis=1).iloc[i]\n",
    "    )\n",
    "    print(f\"Path n°{i}: {journey_path}\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bca00f33-8d9f-4ea0-9f8a-57c0b07db314",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0f7f4619-04ab-4712-b7ff-38f89154a0c8",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "625d335a-ce8a-42b2-a042-b7f0e2be1a3f",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 137,
   "id": "e7b97099-e497-4ace-9c0e-07c255d9ae88",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Notebook finished !\n"
     ]
    }
   ],
   "source": [
    "print(\"Notebook finished !\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "3fabbee1-ba76-42e2-9ac6-25e6643a4135",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "37985983-554a-4a6f-828a-a861d2c4e5d8",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "6fa021ac-439f-42a1-be08-b3f20016f96f",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
