{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "7278c11e-3a76-4484-9156-d6d7f0cb9d10",
   "metadata": {},
   "source": [
    "<div class=\"alert alert-block alert-success\">\n",
    "    <h1>\n",
    "        Example notebook - Reactome subgraph\n",
    "    </h1>\n",
    "</div>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bb02cacb-b6f4-4ce1-beff-27d2a32807e6",
   "metadata": {},
   "source": [
    "# Import modules and functions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 168,
   "id": "7de3204c-d954-4051-a9eb-4ee5b804f44b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The autoreload extension is already loaded. To reload it, use:\n",
      "  %reload_ext autoreload\n"
     ]
    }
   ],
   "source": [
    "%load_ext autoreload\n",
    "%autoreload 2\n",
    "\n",
    "import os\n",
    "import glob\n",
    "import re\n",
    "import networkx as nx\n",
    "import pandas as pd\n",
    "\n",
    "from turingdb_examples.graph import (\n",
    "    build_create_command_from_networkx,\n",
    ")\n",
    "from turingdb_examples.utils import get_return_statements\n",
    "from turingdb_examples.llm import natural_language_to_cypher, query_llm"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8e1972f5-8f2a-40de-9943-1844f60f3df3",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cdda4563-a64e-4fa5-a3d3-21b4c1970a96",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "2655b067-0c06-4f5d-87d7-4ebb57a96a0a",
   "metadata": {},
   "source": [
    "# Check data files are available"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "814057c3-731d-459c-9271-7e18447129ae",
   "metadata": {},
   "outputs": [],
   "source": [
    "folder_name = \"reactome\"\n",
    "path_data = f\"{os.getcwd()}/data/{folder_name}\"\n",
    "if not os.path.exists(path_data):\n",
    "    raise ValueError(f\"{path_data} does not exists\")\n",
    "\n",
    "list_csv_files = sorted([os.path.basename(file) for file in glob.glob(os.path.join(path_data, '*'))])\n",
    "if not list_csv_files == [\n",
    "    \"entities_pairwise.gml\"\n",
    "]:\n",
    "    raise ValueError(\n",
    "        f\"At least one of the {len(list_csv_files)} csv files is not available in {path_data}\"\n",
    "    )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d9b16134-b739-4e07-8a84-bfd9e51e68e0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "14026c33-93f6-4d97-a9db-a5c397ec5e1c",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "7821af94-8984-46a9-85fa-bb02b85d0471",
   "metadata": {},
   "source": [
    "# Import `gml` file"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "8737d814-7fe9-4514-bb84-3bd15cc73098",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MultiGraph with 40 nodes and 57 edges\n"
     ]
    }
   ],
   "source": [
    "G = nx.read_gml(f\"{path_data}/entities_pairwise.gml\")\n",
    "print(G)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 133,
   "id": "b97e295f-8451-4cd4-b80f-71e08a2ae482",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Warning: When  cdn_resources is 'local' jupyter notebook has issues displaying graphics on chrome/safari. Use cdn_resources='in_line' or cdn_resources='remote' if you have issues viewing graphics in a notebook.\n",
      "reactome_graph.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"750px\"\n",
       "            src=\"reactome_graph.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7850d4945ba0>"
      ]
     },
     "execution_count": 133,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from pyvis.network import Network\n",
    "import matplotlib.pyplot as plt\n",
    "import matplotlib.colors as mcolors\n",
    "\n",
    "net = Network(\n",
    "    height=\"750px\", width=\"100%\", notebook=True, bgcolor=\"#ffffff\", font_color=\"#000000\", directed=True\n",
    ")\n",
    "\n",
    "# Choose your palette (can be changed easily)\n",
    "palette_name = 'Pastel1'  # Options: 'tab10', 'Set3', 'Paired', 'viridis', 'plasma', etc.\n",
    "\n",
    "# Get unique node types\n",
    "unique_types = list(set(data.get('schemaClass') for _, data in G.nodes(data=True)))\n",
    "\n",
    "# Get colors from matplotlib palette\n",
    "cmap = plt.get_cmap(palette_name)\n",
    "colors = [mcolors.rgb2hex(cmap(i / len(unique_types))) for i in range(len(unique_types))]\n",
    "\n",
    "# Map types to colors\n",
    "type_colors = {node_type: colors[i] for i, node_type in enumerate(unique_types)}\n",
    "\n",
    "# Then use in your visualization\n",
    "for node, data in G.nodes(data=True):\n",
    "    node_type = data.get('schemaClass', 'Unknown')\n",
    "    color = type_colors.get(node_type, '#95a5a6')\n",
    "\n",
    "    net.add_node(\n",
    "        node,\n",
    "        label=data.get(\"displayName\", str(node)),\n",
    "        title=f\"{data.get('displayName', '')}\",\n",
    "        color=color,\n",
    "        size=25,\n",
    "    )\n",
    "\n",
    "for source, target, data in G.edges(data=True):\n",
    "    net.add_edge(source, target, color=\"#95a5a6\", width=3)\n",
    "\n",
    "net.toggle_physics(status=True)\n",
    "net.show(f\"{folder_name}_graph.html\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8270af81-059d-432f-8e3f-2485762a47a5",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "18b9d040-e43d-466b-95ff-7431c132fea7",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "39b2bfce-b51d-4c5e-8857-50f136eca8c0",
   "metadata": {},
   "source": [
    "# Create graph using `turingdb` python package"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "0826ead4-b2bd-499b-86d3-ee7e2490cef5",
   "metadata": {},
   "source": [
    "<div class=\"alert alert-block alert-info\">\n",
    "    <h2>\n",
    "        See <a href=\"https://docs.turingdb.ai/quickstart\">TuringDB Get started documentation</a> for the important steps to follow :\n",
    "    </h2>\n",
    "    <h4>\n",
    "        <ul>\n",
    "            <li>Create your TuringDB account</li>\n",
    "            <li>Create your instance in the <a href=\"https://console.turingdb.ai/auth\">TuringDB Cloud UI</a></li>\n",
    "            <li>Copy your Instance ID from the Database Instances management page</li>\n",
    "            <li>Get API Key from the Settings in UI</li>\n",
    "        </ul>\n",
    "        Remember to have your instance active while working in this notebook !\n",
    "    </h4>\n",
    "</div>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 54,
   "id": "6816dc0d-23b3-4139-a5a3-6d7dcdeb4f9d",
   "metadata": {},
   "outputs": [],
   "source": [
    "from turingdb import TuringDB\n",
    "\n",
    "# Create TuringDB client\n",
    "client = TuringDB(\n",
    "    host=\"http://localhost:6666\"  # Remove this parameter and set the two parameters below\n",
    "    # instance_id=\"...\",  # Replace by your instance id\n",
    "    # auth_token=\"...\",  # Replace by your API token\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 55,
   "id": "b227eb28-6abf-4b97-b2b4-ce24f4424a9b",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get list of available graphs\n",
    "list_graphs = client.query(\"LIST GRAPH\").loc[:, 0].tolist()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "id": "d4eafdf2-b196-4f92-ba59-883f914060bf",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'reactome4'"
      ]
     },
     "execution_count": 56,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Set graph name\n",
    "graph_name_prefix = folder_name\n",
    "graph_name_nb_suffix = str(\n",
    "    max(\n",
    "        [\n",
    "            int(re.sub(graph_name_prefix, \"\", g))\n",
    "            for g in list_graphs\n",
    "            if g.startswith(graph_name_prefix)\n",
    "            and re.sub(graph_name_prefix, \"\", g).isdigit()\n",
    "        ]\n",
    "        + [0]\n",
    "    )\n",
    "    + 1\n",
    ")\n",
    "graph_name = graph_name_prefix + graph_name_nb_suffix\n",
    "graph_name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "20dfd8db-f2cd-4780-8d11-839e1bc05d4d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.6 ms, sys: 129 μs, total: 2.73 ms\n",
      "Wall time: 2.33 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Create a new graph\n",
    "client.query(f\"CREATE GRAPH {graph_name}\")\n",
    "client.set_graph(graph_name)\n",
    "\n",
    "# Create a new change on the graph\n",
    "change = client.query(\"CHANGE NEW\").loc[0, 0]\n",
    "\n",
    "# Checkout into the change\n",
    "client.checkout(change=change)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 58,
   "id": "762cb219-7187-4e84-bc31-f3882fc36b15",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Cypher CREATE command :\n",
      "\n",
      "****************************************************************************************************\n",
      "CREATE (n0:Reaction {\"id\":\"TP53 binds the PMAIP1 (NOXA) promoter\", \"schemaClass\":\"Reaction\", \"stId\":\"R-HSA-4331331\", \"oldStId\":\"REACT_169265\", \"releaseDate\":\"2016-03-23\", \"name\":\"[ TP53 binds the PMAIP1 (NOXA) promoter ]\", \"stIdVersion\":\"R-HSA-4331331.6\", \"speciesName\":\"Homo sapiens\", \"category\":\"binding\", \"displayName\":\"TP53 binds the PMAIP1 (NOXA) promoter\"}),\n",
      "(n1:Complex {\"id\":\"p-S15,S20-TP53 Tetramer [nucleoplasm]\", \"schemaClass\":\"Complex\", \"stId\":\"R-HSA-3222171\", \"name\":\"[ p-S15,S20-TP53 Tetramer ]\", \"stIdVersion\":\"R-HSA-3222171.1\", \"speciesName\":\"Homo sapiens\", \"displayName\":\"p-S15,S20-TP53 Tetramer [nucleoplasm]\"}),\n",
      "(n2:Reaction {\"id\":\"TP53 binds the APAF1 gene promoter\", \"schemaClass\":\"Reaction\", \"stId\":\"R-HSA-6791349\", \"releaseDate\":\"2016-03-23\", \"name\":\"[ TP53 binds the APAF1 gene promoter ]\", \"stIdVersion\":\"R-HSA-6791349.3\", \"speciesName\":\"Homo sapiens\", \"category\":\"binding\", \"displayName\":\"TP53 binds the APAF1 gene promoter\"}),\n",
      "(n3:BlackBoxEvent {\"id\":\"TP53 stimulates APAF1 gene expression\", \"schemaClass\":\"BlackBoxEvent\", \"stId\":\"R-HSA-6791348\", \"releaseDate\":\"2016-03-23\", \"name\":\"[ TP53 stimulates APAF1 gene expression ]\", \"stIdVersion\":\"R-HSA-6791348.4\", \"speciesName\":\"Homo sapiens\", \"category\":\"omitted\", \"displayName\":\"TP53 stimulates APAF1 gene expression\"}),\n",
      "(n4:Reaction {\"id\":\"CYCS binds to APAF1\", \"schemaClass\":\"Reaction\", \"stId\":\"R-HSA-114254\", \"oldStId\":\"REACT_1640\", \"releaseDate\":\"2004-10-27\", \"name\":\"[ CYCS binds to APAF1 ]\", \"stIdVersion\":\"R-HSA-114254.6\", \"speciesName\":\"Homo sapiens\", \"category\":\"binding\", \"displayName\":\"CYCS binds to APAF1\"}),\n",
      "(n5:EntityWithAccessionedSequence {\"id\":\"CYCS [cytosol]\", \"schemaClass\":\"EntityWithAccessionedSequence\", \"stId\":\"R-HSA-53259\", \"oldStId\":\"REACT_4972\", \"name\":\"[ CYCS , Cytochrome c ]\", \"stIdVersion\":\"R-HSA-53259.1\", \"speciesName\":\"Homo sapiens\", \"referenceType\":\"ReferenceGeneProduct\", \"searchSeed\":\"1\", \"displayName\":\"CYCS [cytosol]\"}),\n",
      "(n6:EntityWithAccessionedSequence {\"id\":\"PMAIP1 Gene [nucleoplasm]\", \"schemaClass\":\"EntityWithAccessionedSequence\", \"stId\":\"R-HSA-4331342\", \"oldStId\":\"REACT_170122\", \"name\":\"[ PMAIP1 Gene , NOXA Gene ]\", \"stIdVersion\":\"R-HSA-4331342.1\", \"speciesName\":\"Homo sapiens\", \"referenceType\":\"ReferenceDNASequence\", \"searchSeed\":\"1\", \"displayName\":\"PMAIP1 Gene [nucleoplasm]\"}),\n",
      "(n7:Complex {\"id\":\"p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]\", \"schemaClass\":\"Complex\", \"stId\":\"R-HSA-4331332\", \"oldStId\":\"REACT_170069\", \"name\":\"[ p-S15,S20-TP53 Tetramer:PMAIP1 Gene ]\", \"stIdVersion\":\"R-HSA-4331332.4\", \"speciesName\":\"Homo sapiens\", \"displayName\":\"p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]\"}),\n",
      "(n8:BlackBoxEvent {\"id\":\"TP53 stimulates PMAIP1 (NOXA) expression\", \"schemaClass\":\"BlackBoxEvent\", \"stId\":\"R-HSA-140214\", \"oldStId\":\"REACT_2201\", \"releaseDate\":\"2004-10-27\", \"name\":\"[ TP53 stimulates PMAIP1 (NOXA) expression ]\", \"stIdVersion\":\"R-HSA-140214.6\", \"speciesName\":\"Homo sapiens\", \"category\":\"omitted\", \"displayName\":\"TP53 stimulates PMAIP1 (NOXA) expression\"}),\n",
      "(n9:PositiveGeneExpressionRegulation {\"id\":\"Positive gene expression regulation by 'p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]'\", \"schemaClass\":\"PositiveGeneExpressionRegulation\", \"stId\":\"R-HSA-159038\", \"oldStId\":\"REACT_6033\", \"stIdVersion\":\"R-HSA-159038.4\", \"displayName\":\"Positive gene expression regulation by p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]\"}),\n",
      "(n10:Reaction {\"id\":\"Translocation of PMAIP1 (NOXA) to mitochondria\", \"schemaClass\":\"Reaction\", \"stId\":\"R-HSA-140216\", \"oldStId\":\"REACT_1585\", \"releaseDate\":\"2004-10-27\", \"name\":\"[ Translocation of PMAIP1 (NOXA) to mitochondria ]\", \"stIdVersion\":\"R-HSA-140216.4\", \"speciesName\":\"Homo sapiens\", \"category\":\"transition\", \"displayName\":\"Translocation of PMAIP1 (NOXA) to mitochondria\"}),\n",
      "(n11:Reaction {\"id\":\"BH3-only proteins associate with and inactivate anti-apoptotic BCL-2\", \"schemaClass\":\"Reaction\", \"stId\":\"R-HSA-508163\", \"oldStId\":\"REACT_21389\", \"releaseDate\":\"2008-06-30\", \"name\":\"[ BH3-only proteins associate with and inactivate anti-apoptotic BCL-2 ]\", \"stIdVersion\":\"R-HSA-508163.4\", \"speciesName\":\"Homo sapiens\", \"category\":\"binding\", \"displayName\":\"BH3-only proteins associate with and inactivate anti-apoptotic BCL-2\"}),\n",
      "(n12:Reaction {\"id\":\"Translocation of tBID to mitochondria\", \"schemaClass\":\"Reaction\", \"stId\":\"R-HSA-139920\", \"oldStId\":\"REACT_1370\", \"releaseDate\":\"2004-10-27\", \"name\":\"[ Translocation of tBID to mitochondria ]\", \"stIdVersion\":\"R-HSA-139920.3\", \"speciesName\":\"Homo sapiens\", \"category\":\"transition\", \"displayName\":\"Translocation of tBID to mitochondria\"}),\n",
      "(n13:Reaction {\"id\":\"Release of Cytochrome c from mitochondria\", \"schemaClass\":\"Reaction\", \"stId\":\"R-HSA-114284\", \"oldStId\":\"REACT_535\", \"releaseDate\":\"2004-07-06\", \"name\":\"[ Release of Cytochrome c from mitochondria ]\", \"stIdVersion\":\"R-HSA-114284.7\", \"speciesName\":\"Homo sapiens\", \"category\":\"transition\", \"displayName\":\"Release of Cytochrome c from mitochondria\"}),\n",
      "(n14:BlackBoxEvent {\"id\":\"Transactivation of PMAIP1 (NOXA) by E2F1\", \"schemaClass\":\"BlackBoxEvent\", \"stId\":\"R-HSA-140217\", \"oldStId\":\"REACT_1872\", \"releaseDate\":\"2004-10-27\", \"name\":\"[ Transactivation of PMAIP1 (NOXA) by E2F1 ]\", \"stIdVersion\":\"R-HSA-140217.4\", \"speciesName\":\"Homo sapiens\", \"category\":\"omitted\", \"displayName\":\"Transactivation of PMAIP1 (NOXA) by E2F1\"}),\n",
      "(n15:PositiveGeneExpressionRegulation {\"id\":\"Positive gene expression regulation by 'E2F1:TFDP1:PMAIP1 Gene [nucleoplasm]'\", \"schemaClass\":\"PositiveGeneExpressionRegulation\", \"stId\":\"R-HSA-159039\", \"oldStId\":\"REACT_6130\", \"stIdVersion\":\"R-HSA-159039.1\", \"displayName\":\"Positive gene expression regulation by E2F1:TFDP1:PMAIP1 Gene [nucleoplasm]\"}),\n",
      "(n16:Complex {\"id\":\"E2F1:TFDP1,TFDP2 [nucleoplasm]\", \"schemaClass\":\"Complex\", \"stId\":\"R-HSA-68653\", \"oldStId\":\"REACT_5400\", \"name\":\"[ E2F1:TFDP1,TFDP2 , DP1/2:E2F1 ]\", \"stIdVersion\":\"R-HSA-68653.2\", \"speciesName\":\"Homo sapiens\", \"displayName\":\"E2F1:TFDP1,TFDP2 [nucleoplasm]\"}),\n",
      "(n17:EntityWithAccessionedSequence {\"id\":\"E2F1 [nucleoplasm]\", \"schemaClass\":\"EntityWithAccessionedSequence\", \"stId\":\"R-HSA-68639\", \"oldStId\":\"REACT_2601\", \"name\":\"[ E2F1 , Transcription factor E2F1 , E2F-1 , Retinoblastoma binding protein 3 , RBBP-3 , PRB-binding protein E2F-1 , PBR3 , Retinoblastoma-associated protein 1 , RBAP-1 ]\", \"stIdVersion\":\"R-HSA-68639.2\", \"speciesName\":\"Homo sapiens\", \"referenceType\":\"ReferenceGeneProduct\", \"displayName\":\"E2F1 [nucleoplasm]\"}),\n",
      "(n18:Complex {\"id\":\"E2F1:(TFDP1,TFDP2) [nucleoplasm]\", \"schemaClass\":\"Complex\", \"stId\":\"R-HSA-9007512\", \"name\":\"[ E2F1:(TFDP1,TFDP2) ]\", \"stIdVersion\":\"R-HSA-9007512.1\", \"speciesName\":\"Homo sapiens\", \"displayName\":\"E2F1:(TFDP1,TFDP2) [nucleoplasm]\"}),\n",
      "(n19:Reaction {\"id\":\"E2F1 binds APAF1 gene promoter\", \"schemaClass\":\"Reaction\", \"stId\":\"R-HSA-9007514\", \"releaseDate\":\"2017-09-12\", \"name\":\"[ E2F1 binds APAF1 gene promoter ]\", \"stIdVersion\":\"R-HSA-9007514.2\", \"speciesName\":\"Homo sapiens\", \"category\":\"binding\", \"displayName\":\"E2F1 binds APAF1 gene promoter\"}),\n",
      "(n20:BlackBoxEvent {\"id\":\"APAF1 gene expression is stimulated by E2F1 and inhibited by E2F6\", \"schemaClass\":\"BlackBoxEvent\", \"stId\":\"R-HSA-9007496\", \"releaseDate\":\"2017-09-12\", \"name\":\"[ APAF1 gene expression is stimulated by E2F1 and inhibited by E2F6 ]\", \"stIdVersion\":\"R-HSA-9007496.4\", \"speciesName\":\"Homo sapiens\", \"category\":\"omitted\", \"displayName\":\"APAF1 gene expression is stimulated by E2F1 and inhibited by E2F6\"}),\n",
      "(n21:EntityWithAccessionedSequence {\"id\":\"APAF1 [cytosol]\", \"schemaClass\":\"EntityWithAccessionedSequence\", \"stId\":\"R-HSA-50099\", \"oldStId\":\"REACT_3886\", \"name\":\"[ APAF1 , Apaf-1 , Apoptotic protease activating factor 1 ]\", \"stIdVersion\":\"R-HSA-50099.1\", \"speciesName\":\"Homo sapiens\", \"referenceType\":\"ReferenceGeneProduct\", \"displayName\":\"APAF1 [cytosol]\"}),\n",
      "(n22:Complex {\"id\":\"APAF1:CYCS [cytosol]\", \"schemaClass\":\"Complex\", \"stId\":\"R-HSA-114253\", \"oldStId\":\"REACT_4880\", \"name\":\"[ APAF1:CYCS , APAF1:Cytochrome C ]\", \"stIdVersion\":\"R-HSA-114253.2\", \"speciesName\":\"Homo sapiens\", \"displayName\":\"APAF1:CYCS [cytosol]\"}),\n",
      "(n23:Reaction {\"id\":\"E2F1 binds PMAIP1 (NOXA) promoter\", \"schemaClass\":\"Reaction\", \"stId\":\"R-HSA-4331327\", \"oldStId\":\"REACT_169402\", \"releaseDate\":\"2013-09-18\", \"name\":\"[ E2F1 binds PMAIP1 (NOXA) promoter ]\", \"stIdVersion\":\"R-HSA-4331327.3\", \"speciesName\":\"Homo sapiens\", \"category\":\"binding\", \"displayName\":\"E2F1 binds PMAIP1 (NOXA) promoter\"}),\n",
      "(n24:EntityWithAccessionedSequence {\"id\":\"PMAIP1 [cytosol]\", \"schemaClass\":\"EntityWithAccessionedSequence\", \"stId\":\"R-HSA-140215\", \"oldStId\":\"REACT_4210\", \"name\":\"[ PMAIP1 , NOXA protein ]\", \"stIdVersion\":\"R-HSA-140215.1\", \"speciesName\":\"Homo sapiens\", \"referenceType\":\"ReferenceGeneProduct\", \"searchSeed\":\"1\", \"displayName\":\"PMAIP1 [cytosol]\"}),\n",
      "(n25:EntityWithAccessionedSequence {\"id\":\"CYCS [mitochondrial intermembrane space]\", \"schemaClass\":\"EntityWithAccessionedSequence\", \"stId\":\"R-HSA-114244\", \"oldStId\":\"REACT_3942\", \"name\":\"[ CYCS , Cytochrome c ]\", \"stIdVersion\":\"R-HSA-114244.1\", \"speciesName\":\"Homo sapiens\", \"referenceType\":\"ReferenceGeneProduct\", \"displayName\":\"CYCS [mitochondrial intermembrane space]\"}),\n",
      "(n26:Complex {\"id\":\"CYCS gene:NRF1:PPARGC1B [nucleoplasm]\", \"schemaClass\":\"Complex\", \"stId\":\"R-HSA-2466382\", \"oldStId\":\"REACT_265699\", \"name\":\"[ CYCS gene:NRF1:PPARGC1B , NRF1:PGC-1beta:CYCS ]\", \"stIdVersion\":\"R-HSA-2466382.1\", \"speciesName\":\"Homo sapiens\", \"displayName\":\"CYCS gene:NRF1:PPARGC1B [nucleoplasm]\"}),\n",
      "(n27:EntityWithAccessionedSequence {\"id\":\"NRF1 [nucleoplasm]\", \"schemaClass\":\"EntityWithAccessionedSequence\", \"stId\":\"R-HSA-1592205\", \"oldStId\":\"REACT_117514\", \"name\":\"[ NRF1 , Nuclear respiratory factor 1 , NRF1_HUMAN ]\", \"stIdVersion\":\"R-HSA-1592205.1\", \"speciesName\":\"Homo sapiens\", \"referenceType\":\"ReferenceGeneProduct\", \"displayName\":\"NRF1 [nucleoplasm]\"}),\n",
      "(n28:Reaction {\"id\":\"NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter\", \"schemaClass\":\"Reaction\", \"stId\":\"R-HSA-2466392\", \"oldStId\":\"REACT_264641\", \"releaseDate\":\"2014-03-12\", \"name\":\"[ NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter ]\", \"stIdVersion\":\"R-HSA-2466392.2\", \"speciesName\":\"Homo sapiens\", \"category\":\"binding\", \"displayName\":\"NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter\"}),\n",
      "(n29:Reaction {\"id\":\"p38 MAPK phosphorylates PPARGC1A\", \"schemaClass\":\"Reaction\", \"stId\":\"R-HSA-1592233\", \"oldStId\":\"REACT_263998\", \"releaseDate\":\"2014-03-12\", \"name\":\"[ p38 MAPK phosphorylates PPARGC1A ]\", \"stIdVersion\":\"R-HSA-1592233.2\", \"speciesName\":\"Homo sapiens\", \"category\":\"transition\", \"displayName\":\"p38 MAPK phosphorylates PPARGC1A\"}),\n",
      "(n30:EntityWithAccessionedSequence {\"id\":\"PPARGC1A [nucleoplasm]\", \"schemaClass\":\"EntityWithAccessionedSequence\", \"stId\":\"R-HSA-442481\", \"oldStId\":\"REACT_27383\", \"name\":\"[ PPARGC1A , Peroxisome proliferator-activated receptor gamma coactivator 1-alpha , PRGC1_HUMAN , PGC1A , PGC-1alpha ]\", \"stIdVersion\":\"R-HSA-442481.2\", \"speciesName\":\"Homo sapiens\", \"referenceType\":\"ReferenceGeneProduct\", \"displayName\":\"PPARGC1A [nucleoplasm]\"}),\n",
      "(n31:Complex {\"id\":\"RORA:Coactivator [nucleoplasm]\", \"schemaClass\":\"Complex\", \"stId\":\"R-HSA-1368124\", \"oldStId\":\"REACT_111748\", \"name\":\"[ RORA:Coactivator ]\", \"stIdVersion\":\"R-HSA-1368124.1\", \"speciesName\":\"Homo sapiens\", \"displayName\":\"RORA:Coactivator [nucleoplasm]\"}),\n",
      "(n32:EntityWithAccessionedSequence {\"id\":\"EP300 [nucleoplasm]\", \"schemaClass\":\"EntityWithAccessionedSequence\", \"stId\":\"R-HSA-381325\", \"oldStId\":\"REACT_26137\", \"name\":\"[ EP300 , p300 , Histone acetyltransferase p300 , EP300_HUMAN , KAT3B ]\", \"stIdVersion\":\"R-HSA-381325.1\", \"speciesName\":\"Homo sapiens\", \"referenceType\":\"ReferenceGeneProduct\", \"displayName\":\"EP300 [nucleoplasm]\"}),\n",
      "(n33:Complex {\"id\":\"p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene [nucleoplasm]\", \"schemaClass\":\"Complex\", \"stId\":\"R-HSA-3215149\", \"name\":\"[ p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ]\", \"stIdVersion\":\"R-HSA-3215149.1\", \"speciesName\":\"Homo sapiens\", \"displayName\":\"p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene [nucleoplasm]\"}),\n",
      "(n34:Reaction {\"id\":\"NRF1:PPARGC1B binds the CYCS promoter\", \"schemaClass\":\"Reaction\", \"stId\":\"R-HSA-2466370\", \"oldStId\":\"REACT_264393\", \"releaseDate\":\"2014-03-12\", \"name\":\"[ NRF1:PPARGC1B binds the CYCS promoter ]\", \"stIdVersion\":\"R-HSA-2466370.2\", \"speciesName\":\"Homo sapiens\", \"category\":\"binding\", \"displayName\":\"NRF1:PPARGC1B binds the CYCS promoter\"}),\n",
      "(n35:BlackBoxEvent {\"id\":\"Expression of NRF1\", \"schemaClass\":\"BlackBoxEvent\", \"stId\":\"R-HSA-1592242\", \"oldStId\":\"REACT_264032\", \"releaseDate\":\"2014-03-12\", \"name\":\"[ Expression of NRF1 ]\", \"stIdVersion\":\"R-HSA-1592242.4\", \"speciesName\":\"Homo sapiens\", \"category\":\"omitted\", \"displayName\":\"Expression of NRF1\"}),\n",
      "(n36:BlackBoxEvent {\"id\":\"Expression of CYCS\", \"schemaClass\":\"BlackBoxEvent\", \"stId\":\"R-HSA-1592231\", \"oldStId\":\"REACT_263920\", \"releaseDate\":\"2014-03-12\", \"name\":\"[ Expression of CYCS , Expression of Cytochrome c ]\", \"stIdVersion\":\"R-HSA-1592231.7\", \"speciesName\":\"Homo sapiens\", \"category\":\"omitted\", \"displayName\":\"Expression of CYCS\"}),\n",
      "(n37:PositiveRegulation {\"id\":\"Positive regulation by 'ESRRA [nucleoplasm]'\", \"stId\":\"R-HSA-1605565\", \"oldStId\":\"REACT_267555\", \"schemaClass\":\"PositiveRegulation\", \"stIdVersion\":\"R-HSA-1605565.1\", \"displayName\":\"Positive regulation by ESRRA [nucleoplasm]\"}),\n",
      "(n38:EntityWithAccessionedSequence {\"id\":\"ESRRA [nucleoplasm]\", \"schemaClass\":\"EntityWithAccessionedSequence\", \"stId\":\"R-HSA-446159\", \"oldStId\":\"REACT_21133\", \"name\":\"[ ESRRA , Steroid hormone receptor ERR1 , ERR1_HUMAN ]\", \"stIdVersion\":\"R-HSA-446159.1\", \"speciesName\":\"Homo sapiens\", \"referenceType\":\"ReferenceGeneProduct\", \"displayName\":\"ESRRA [nucleoplasm]\"}),\n",
      "(n39:Complex {\"id\":\"ESRRA:PPARGC1A [nucleoplasm]\", \"schemaClass\":\"Complex\", \"stId\":\"R-HSA-8939924\", \"name\":\"[ ESRRA:PPARGC1A ]\", \"stIdVersion\":\"R-HSA-8939924.1\", \"speciesName\":\"Homo sapiens\", \"displayName\":\"ESRRA:PPARGC1A [nucleoplasm]\"}),\n",
      "(n0)-[:CONNECTED]-(n1),\n",
      "(n0)-[:CONNECTED]-(n6),\n",
      "(n0)-[:CONNECTED]-(n7),\n",
      "(n0)-[:CONNECTED]-(n8),\n",
      "(n1)-[:CONNECTED]-(n2),\n",
      "(n1)-[:CONNECTED]-(n7),\n",
      "(n1)-[:CONNECTED]-(n9),\n",
      "(n1)-[:CONNECTED]-(n33),\n",
      "(n2)-[:CONNECTED]-(n3),\n",
      "(n3)-[:CONNECTED]-(n21),\n",
      "(n3)-[:CONNECTED]-(n4),\n",
      "(n4)-[:CONNECTED]-(n5),\n",
      "(n4)-[:CONNECTED]-(n13),\n",
      "(n5)-[:CONNECTED]-(n13),\n",
      "(n5)-[:CONNECTED]-(n22),\n",
      "(n5)-[:CONNECTED]-(n36),\n",
      "(n6)-[:CONNECTED]-(n7),\n",
      "(n6)-[:CONNECTED]-(n8),\n",
      "(n6)-[:CONNECTED]-(n14),\n",
      "(n6)-[:CONNECTED]-(n23),\n",
      "(n7)-[:CONNECTED]-(n9),\n",
      "(n8)-[:CONNECTED]-(n9),\n",
      "(n8)-[:CONNECTED]-(n10),\n",
      "(n10)-[:CONNECTED]-(n14),\n",
      "(n10)-[:CONNECTED]-(n11),\n",
      "(n10)-[:CONNECTED]-(n24),\n",
      "(n11)-[:CONNECTED]-(n12),\n",
      "(n12)-[:CONNECTED]-(n13),\n",
      "(n13)-[:CONNECTED]-(n25),\n",
      "(n14)-[:CONNECTED]-(n15),\n",
      "(n14)-[:CONNECTED]-(n23),\n",
      "(n15)-[:CONNECTED]-(n16),\n",
      "(n16)-[:CONNECTED]-(n17),\n",
      "(n16)-[:CONNECTED]-(n23),\n",
      "(n17)-[:CONNECTED]-(n18),\n",
      "(n18)-[:CONNECTED]-(n19),\n",
      "(n19)-[:CONNECTED]-(n20),\n",
      "(n20)-[:CONNECTED]-(n21),\n",
      "(n21)-[:CONNECTED]-(n22),\n",
      "(n26)-[:CONNECTED]-(n27),\n",
      "(n26)-[:CONNECTED]-(n34),\n",
      "(n27)-[:CONNECTED]-(n28),\n",
      "(n27)-[:CONNECTED]-(n34),\n",
      "(n27)-[:CONNECTED]-(n35),\n",
      "(n28)-[:CONNECTED]-(n29),\n",
      "(n28)-[:CONNECTED]-(n35),\n",
      "(n29)-[:CONNECTED]-(n30),\n",
      "(n29)-[:CONNECTED]-(n35),\n",
      "(n30)-[:CONNECTED]-(n31),\n",
      "(n30)-[:CONNECTED]-(n39),\n",
      "(n31)-[:CONNECTED]-(n32),\n",
      "(n32)-[:CONNECTED]-(n33),\n",
      "(n34)-[:CONNECTED]-(n35),\n",
      "(n34)-[:CONNECTED]-(n36),\n",
      "(n36)-[:CONNECTED]-(n37),\n",
      "(n37)-[:CONNECTED]-(n38),\n",
      "(n38)-[:CONNECTED]-(n39)\n",
      "****************************************************************************************************\n"
     ]
    }
   ],
   "source": [
    "# Build CREATE command from networkx object\n",
    "create_command = build_create_command_from_networkx(G, node_type_key=\"schemaClass\")\n",
    "print(f\"Cypher CREATE command :\\n\\n{100 * '*'}\\n{create_command}\\n{100 * '*'}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "973c9cea-8332-4ef0-ab4e-5cd05fafe976",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 59,
   "id": "b95bb068-2e75-40c5-83d8-d7b400a2a083",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.49 ms, sys: 104 μs, total: 3.59 ms\n",
      "Wall time: 7.16 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Run CREATE command\n",
    "client.query(create_command)\n",
    "\n",
    "# Commit the change\n",
    "client.query(\"COMMIT\")\n",
    "client.query(\"CHANGE SUBMIT\")\n",
    "\n",
    "# Checkout into main\n",
    "client.checkout()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "fb829e40-2aa2-4fcb-bee0-1ead147ba893",
   "metadata": {},
   "source": [
    "<div class=\"alert alert-block alert-info\">\n",
    "    <h2>\n",
    "        Visualize your graph in TuringDB Graph Visualizer ! Now that your instance is running:\n",
    "    </h2>\n",
    "    <h3>\n",
    "        <ul>\n",
    "            <li>Go to <a href=\"https://console.turingdb.ai/databases\">TuringDB Console - Database Instances</a></li>\n",
    "            <li>In your current instance panel, click on \"Open Visualizer\" button</li>\n",
    "            <li>Visualizer opens, now you can choose your graph in the dropdown menu at the top-right corner</li>\n",
    "        </ul>\n",
    "        You can then play with your graph and visualize the nodes you want !\n",
    "    </h3>\n",
    "</div>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0a071014-7009-47ed-84d2-d7da930d63a8",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "61de5fd8-38a5-4249-bf37-303f805b53ce",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "e4841fbe-8336-47f9-91fc-ac233c6e9d2c",
   "metadata": {},
   "source": [
    "# Query TuringDB"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "04f72418-0378-4d36-86a3-6b9e4fab8d36",
   "metadata": {},
   "source": [
    "## Use metaqueries to have insight on graph overall structure\n",
    "\n",
    "<h3>\n",
    "    To learn more about 📮 Metaqueries, please check TuringDB documentation on this <a href=\"https://turingdb.mintlify.app/query/cypher_subset#%F0%9F%93%AE-metaqueries\">link</a>\n",
    "</h3>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "id": "18e3137c-a6e5-4cfc-9a29-2fea7a9f8c0f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Node_type_ID</th>\n",
       "      <th>Node_type</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>Reaction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Complex</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>PositiveGeneExpressionRegulation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>PositiveRegulation</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Node_type_ID                         Node_type\n",
       "0             0                          Reaction\n",
       "1             1                           Complex\n",
       "2             2                     BlackBoxEvent\n",
       "3             3     EntityWithAccessionedSequence\n",
       "4             4  PositiveGeneExpressionRegulation\n",
       "5             5                PositiveRegulation"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 4.57 ms, sys: 121 μs, total: 4.69 ms\n",
      "Wall time: 4.23 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# CALL LABELS () - returns a column of all the different node labels\n",
    "command = \"\"\"\n",
    "CALL LABELS()\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    df.columns = [\"Node_type_ID\", \"Node_type\"]\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "id": "fe935391-b51e-43e1-983c-0f93d82cebae",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Edge_type_ID</th>\n",
       "      <th>Edge_type</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>CONNECTED</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   Edge_type_ID  Edge_type\n",
       "0             0  CONNECTED"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 4.18 ms, sys: 35 μs, total: 4.21 ms\n",
      "Wall time: 3.96 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# CALL EDGETYPES() - returns a column of all the different edge types (edge equivalent of node labels)\n",
    "command = \"\"\"\n",
    "CALL EDGETYPES()\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    df.columns = [\"Edge_type_ID\", \"Edge_type\"]\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f4b88c33-9c12-4248-a855-03eeeafdf4b6",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "2dc60a8b-1189-4bf5-8285-cf19331dc234",
   "metadata": {},
   "source": [
    "## Simple queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "id": "545d4f55-491c-44bb-b2a5-e8bb11b10ffc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.displayName</th>\n",
       "      <th>e</th>\n",
       "      <th>m.displayName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>0</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>1</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>2</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>3</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>TP53 binds the APAF1 gene promoter</td>\n",
       "      <td>4</td>\n",
       "      <td>TP53 stimulates APAF1 gene expression</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>5</td>\n",
       "      <td>Expression of CYCS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>6</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>CYCS binds to APAF1</td>\n",
       "      <td>7</td>\n",
       "      <td>Release of Cytochrome c from mitochondria</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>CYCS binds to APAF1</td>\n",
       "      <td>8</td>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>9</td>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>p38 MAPK phosphorylates PPARGC1A</td>\n",
       "      <td>10</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>p38 MAPK phosphorylates PPARGC1A</td>\n",
       "      <td>11</td>\n",
       "      <td>PPARGC1A [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "      <td>12</td>\n",
       "      <td>p38 MAPK phosphorylates PPARGC1A</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "      <td>13</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Translocation of PMAIP1 (NOXA) to mitochondria</td>\n",
       "      <td>14</td>\n",
       "      <td>PMAIP1 [cytosol]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Translocation of PMAIP1 (NOXA) to mitochondria</td>\n",
       "      <td>15</td>\n",
       "      <td>BH3-only proteins associate with and inactivat...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Translocation of PMAIP1 (NOXA) to mitochondria</td>\n",
       "      <td>16</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>BH3-only proteins associate with and inactivat...</td>\n",
       "      <td>17</td>\n",
       "      <td>Translocation of tBID to mitochondria</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Translocation of tBID to mitochondria</td>\n",
       "      <td>18</td>\n",
       "      <td>Release of Cytochrome c from mitochondria</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Release of Cytochrome c from mitochondria</td>\n",
       "      <td>19</td>\n",
       "      <td>CYCS [mitochondrial intermembrane space]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>E2F1:(TFDP1,TFDP2) [nucleoplasm]</td>\n",
       "      <td>20</td>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>CYCS gene:NRF1:PPARGC1B [nucleoplasm]</td>\n",
       "      <td>21</td>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>CYCS gene:NRF1:PPARGC1B [nucleoplasm]</td>\n",
       "      <td>22</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>RORA:Coactivator [nucleoplasm]</td>\n",
       "      <td>23</td>\n",
       "      <td>EP300 [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>24</td>\n",
       "      <td>p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>25</td>\n",
       "      <td>Positive gene expression regulation by p-S15,S...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>26</td>\n",
       "      <td>TP53 binds the APAF1 gene promoter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>27</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>28</td>\n",
       "      <td>Positive gene expression regulation by p-S15,S...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>E2F1:TFDP1,TFDP2 [nucleoplasm]</td>\n",
       "      <td>29</td>\n",
       "      <td>E2F1 [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>E2F1:TFDP1,TFDP2 [nucleoplasm]</td>\n",
       "      <td>30</td>\n",
       "      <td>E2F1 binds PMAIP1 (NOXA) promoter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "      <td>31</td>\n",
       "      <td>APAF1 [cytosol]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>32</td>\n",
       "      <td>Positive gene expression regulation by E2F1:TF...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>33</td>\n",
       "      <td>E2F1 binds PMAIP1 (NOXA) promoter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>Expression of CYCS</td>\n",
       "      <td>34</td>\n",
       "      <td>Positive regulation by ESRRA [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>TP53 stimulates APAF1 gene expression</td>\n",
       "      <td>35</td>\n",
       "      <td>APAF1 [cytosol]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>TP53 stimulates APAF1 gene expression</td>\n",
       "      <td>36</td>\n",
       "      <td>CYCS binds to APAF1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>37</td>\n",
       "      <td>Translocation of PMAIP1 (NOXA) to mitochondria</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>38</td>\n",
       "      <td>Positive gene expression regulation by p-S15,S...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>E2F1 [nucleoplasm]</td>\n",
       "      <td>39</td>\n",
       "      <td>E2F1:(TFDP1,TFDP2) [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>ESRRA [nucleoplasm]</td>\n",
       "      <td>40</td>\n",
       "      <td>ESRRA:PPARGC1A [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>41</td>\n",
       "      <td>Release of Cytochrome c from mitochondria</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>42</td>\n",
       "      <td>APAF1:CYCS [cytosol]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>43</td>\n",
       "      <td>Expression of CYCS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>EP300 [nucleoplasm]</td>\n",
       "      <td>44</td>\n",
       "      <td>p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>45</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>46</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>47</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>48</td>\n",
       "      <td>E2F1 binds PMAIP1 (NOXA) promoter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>PPARGC1A [nucleoplasm]</td>\n",
       "      <td>49</td>\n",
       "      <td>RORA:Coactivator [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>PPARGC1A [nucleoplasm]</td>\n",
       "      <td>50</td>\n",
       "      <td>ESRRA:PPARGC1A [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>51</td>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>52</td>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>53</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>APAF1 [cytosol]</td>\n",
       "      <td>54</td>\n",
       "      <td>APAF1:CYCS [cytosol]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>55</th>\n",
       "      <td>Positive gene expression regulation by E2F1:TF...</td>\n",
       "      <td>55</td>\n",
       "      <td>E2F1:TFDP1,TFDP2 [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>56</th>\n",
       "      <td>Positive regulation by ESRRA [nucleoplasm]</td>\n",
       "      <td>56</td>\n",
       "      <td>ESRRA [nucleoplasm]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                        n.displayName   e  \\\n",
       "0               TP53 binds the PMAIP1 (NOXA) promoter   0   \n",
       "1               TP53 binds the PMAIP1 (NOXA) promoter   1   \n",
       "2               TP53 binds the PMAIP1 (NOXA) promoter   2   \n",
       "3               TP53 binds the PMAIP1 (NOXA) promoter   3   \n",
       "4                  TP53 binds the APAF1 gene promoter   4   \n",
       "5               NRF1:PPARGC1B binds the CYCS promoter   5   \n",
       "6               NRF1:PPARGC1B binds the CYCS promoter   6   \n",
       "7                                 CYCS binds to APAF1   7   \n",
       "8                                 CYCS binds to APAF1   8   \n",
       "9                      E2F1 binds APAF1 gene promoter   9   \n",
       "10                   p38 MAPK phosphorylates PPARGC1A  10   \n",
       "11                   p38 MAPK phosphorylates PPARGC1A  11   \n",
       "12      NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter  12   \n",
       "13      NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter  13   \n",
       "14     Translocation of PMAIP1 (NOXA) to mitochondria  14   \n",
       "15     Translocation of PMAIP1 (NOXA) to mitochondria  15   \n",
       "16     Translocation of PMAIP1 (NOXA) to mitochondria  16   \n",
       "17  BH3-only proteins associate with and inactivat...  17   \n",
       "18              Translocation of tBID to mitochondria  18   \n",
       "19          Release of Cytochrome c from mitochondria  19   \n",
       "20                   E2F1:(TFDP1,TFDP2) [nucleoplasm]  20   \n",
       "21              CYCS gene:NRF1:PPARGC1B [nucleoplasm]  21   \n",
       "22              CYCS gene:NRF1:PPARGC1B [nucleoplasm]  22   \n",
       "23                     RORA:Coactivator [nucleoplasm]  23   \n",
       "24              p-S15,S20-TP53 Tetramer [nucleoplasm]  24   \n",
       "25              p-S15,S20-TP53 Tetramer [nucleoplasm]  25   \n",
       "26              p-S15,S20-TP53 Tetramer [nucleoplasm]  26   \n",
       "27              p-S15,S20-TP53 Tetramer [nucleoplasm]  27   \n",
       "28  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]  28   \n",
       "29                     E2F1:TFDP1,TFDP2 [nucleoplasm]  29   \n",
       "30                     E2F1:TFDP1,TFDP2 [nucleoplasm]  30   \n",
       "31  APAF1 gene expression is stimulated by E2F1 an...  31   \n",
       "32           Transactivation of PMAIP1 (NOXA) by E2F1  32   \n",
       "33           Transactivation of PMAIP1 (NOXA) by E2F1  33   \n",
       "34                                 Expression of CYCS  34   \n",
       "35              TP53 stimulates APAF1 gene expression  35   \n",
       "36              TP53 stimulates APAF1 gene expression  36   \n",
       "37           TP53 stimulates PMAIP1 (NOXA) expression  37   \n",
       "38           TP53 stimulates PMAIP1 (NOXA) expression  38   \n",
       "39                                 E2F1 [nucleoplasm]  39   \n",
       "40                                ESRRA [nucleoplasm]  40   \n",
       "41                                     CYCS [cytosol]  41   \n",
       "42                                     CYCS [cytosol]  42   \n",
       "43                                     CYCS [cytosol]  43   \n",
       "44                                EP300 [nucleoplasm]  44   \n",
       "45                          PMAIP1 Gene [nucleoplasm]  45   \n",
       "46                          PMAIP1 Gene [nucleoplasm]  46   \n",
       "47                          PMAIP1 Gene [nucleoplasm]  47   \n",
       "48                          PMAIP1 Gene [nucleoplasm]  48   \n",
       "49                             PPARGC1A [nucleoplasm]  49   \n",
       "50                             PPARGC1A [nucleoplasm]  50   \n",
       "51                                 NRF1 [nucleoplasm]  51   \n",
       "52                                 NRF1 [nucleoplasm]  52   \n",
       "53                                 NRF1 [nucleoplasm]  53   \n",
       "54                                    APAF1 [cytosol]  54   \n",
       "55  Positive gene expression regulation by E2F1:TF...  55   \n",
       "56         Positive regulation by ESRRA [nucleoplasm]  56   \n",
       "\n",
       "                                        m.displayName  \n",
       "0               p-S15,S20-TP53 Tetramer [nucleoplasm]  \n",
       "1                           PMAIP1 Gene [nucleoplasm]  \n",
       "2   p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]  \n",
       "3            TP53 stimulates PMAIP1 (NOXA) expression  \n",
       "4               TP53 stimulates APAF1 gene expression  \n",
       "5                                  Expression of CYCS  \n",
       "6                                  Expression of NRF1  \n",
       "7           Release of Cytochrome c from mitochondria  \n",
       "8                                      CYCS [cytosol]  \n",
       "9   APAF1 gene expression is stimulated by E2F1 an...  \n",
       "10                                 Expression of NRF1  \n",
       "11                             PPARGC1A [nucleoplasm]  \n",
       "12                   p38 MAPK phosphorylates PPARGC1A  \n",
       "13                                 Expression of NRF1  \n",
       "14                                   PMAIP1 [cytosol]  \n",
       "15  BH3-only proteins associate with and inactivat...  \n",
       "16           Transactivation of PMAIP1 (NOXA) by E2F1  \n",
       "17              Translocation of tBID to mitochondria  \n",
       "18          Release of Cytochrome c from mitochondria  \n",
       "19           CYCS [mitochondrial intermembrane space]  \n",
       "20                     E2F1 binds APAF1 gene promoter  \n",
       "21              NRF1:PPARGC1B binds the CYCS promoter  \n",
       "22                                 NRF1 [nucleoplasm]  \n",
       "23                                EP300 [nucleoplasm]  \n",
       "24  p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...  \n",
       "25  Positive gene expression regulation by p-S15,S...  \n",
       "26                 TP53 binds the APAF1 gene promoter  \n",
       "27  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]  \n",
       "28  Positive gene expression regulation by p-S15,S...  \n",
       "29                                 E2F1 [nucleoplasm]  \n",
       "30                  E2F1 binds PMAIP1 (NOXA) promoter  \n",
       "31                                    APAF1 [cytosol]  \n",
       "32  Positive gene expression regulation by E2F1:TF...  \n",
       "33                  E2F1 binds PMAIP1 (NOXA) promoter  \n",
       "34         Positive regulation by ESRRA [nucleoplasm]  \n",
       "35                                    APAF1 [cytosol]  \n",
       "36                                CYCS binds to APAF1  \n",
       "37     Translocation of PMAIP1 (NOXA) to mitochondria  \n",
       "38  Positive gene expression regulation by p-S15,S...  \n",
       "39                   E2F1:(TFDP1,TFDP2) [nucleoplasm]  \n",
       "40                       ESRRA:PPARGC1A [nucleoplasm]  \n",
       "41          Release of Cytochrome c from mitochondria  \n",
       "42                               APAF1:CYCS [cytosol]  \n",
       "43                                 Expression of CYCS  \n",
       "44  p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...  \n",
       "45  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]  \n",
       "46           TP53 stimulates PMAIP1 (NOXA) expression  \n",
       "47           Transactivation of PMAIP1 (NOXA) by E2F1  \n",
       "48                  E2F1 binds PMAIP1 (NOXA) promoter  \n",
       "49                     RORA:Coactivator [nucleoplasm]  \n",
       "50                       ESRRA:PPARGC1A [nucleoplasm]  \n",
       "51      NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter  \n",
       "52              NRF1:PPARGC1B binds the CYCS promoter  \n",
       "53                                 Expression of NRF1  \n",
       "54                               APAF1:CYCS [cytosol]  \n",
       "55                     E2F1:TFDP1,TFDP2 [nucleoplasm]  \n",
       "56                                ESRRA [nucleoplasm]  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 7.11 ms, sys: 55 μs, total: 7.17 ms\n",
      "Wall time: 6.68 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Match all edges and return them\n",
    "command = \"\"\"\n",
    "MATCH (n)-[e]-(m) RETURN n.displayName, e, m.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    df.columns = get_return_statements(command)\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "98cb9c13-cc87-4b00-9b34-9c0c4ece6c7f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.displayName</th>\n",
       "      <th>n.schemaClass</th>\n",
       "      <th>n.referenceType</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>E2F1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ESRRA [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>EP300 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>PPARGC1A [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>CYCS [mitochondrial intermembrane space]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>PMAIP1 [cytosol]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>APAF1 [cytosol]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                              n.displayName                  n.schemaClass  \\\n",
       "0                        E2F1 [nucleoplasm]  EntityWithAccessionedSequence   \n",
       "1                       ESRRA [nucleoplasm]  EntityWithAccessionedSequence   \n",
       "2                            CYCS [cytosol]  EntityWithAccessionedSequence   \n",
       "3                       EP300 [nucleoplasm]  EntityWithAccessionedSequence   \n",
       "4                    PPARGC1A [nucleoplasm]  EntityWithAccessionedSequence   \n",
       "5                        NRF1 [nucleoplasm]  EntityWithAccessionedSequence   \n",
       "6  CYCS [mitochondrial intermembrane space]  EntityWithAccessionedSequence   \n",
       "7                          PMAIP1 [cytosol]  EntityWithAccessionedSequence   \n",
       "8                           APAF1 [cytosol]  EntityWithAccessionedSequence   \n",
       "\n",
       "        n.referenceType  \n",
       "0  ReferenceGeneProduct  \n",
       "1  ReferenceGeneProduct  \n",
       "2  ReferenceGeneProduct  \n",
       "3  ReferenceGeneProduct  \n",
       "4  ReferenceGeneProduct  \n",
       "5  ReferenceGeneProduct  \n",
       "6  ReferenceGeneProduct  \n",
       "7  ReferenceGeneProduct  \n",
       "8  ReferenceGeneProduct  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 9.55 ms, sys: 123 μs, total: 9.68 ms\n",
      "Wall time: 9.13 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all nodes of type \"EntityWithAccessionedSequence\" (which is also schemaClass) and referenceType \"ReferenceGeneProduct\"\n",
    "command = \"\"\"\n",
    "MATCH (n:EntityWithAccessionedSequence {\"referenceType\"=\"ReferenceGeneProduct\"})\n",
    "RETURN n.displayName, n.schemaClass, n.referenceType\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    df.columns = get_return_statements(command)\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 79,
   "id": "93d7b3c1-6590-4c4b-89de-bf4871fb7c21",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>n.schemaClass</th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Reaction</th>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>EntityWithAccessionedSequence</th>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Complex</th>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>BlackBoxEvent</th>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>PositiveGeneExpressionRegulation</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>PositiveRegulation</th>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                  count\n",
       "n.schemaClass                          \n",
       "Reaction                             12\n",
       "EntityWithAccessionedSequence        10\n",
       "Complex                               9\n",
       "BlackBoxEvent                         6\n",
       "PositiveGeneExpressionRegulation      2\n",
       "PositiveRegulation                    1"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 10.3 ms, sys: 1.86 ms, total: 12.1 ms\n",
      "Wall time: 10.7 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all nodes of schemaClass \"EntityWithAccessionedSequence\" and referenceType \"ReferenceGeneProduct\"\n",
    "command = \"\"\"\n",
    "MATCH (n)\n",
    "RETURN n.schemaClass\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    df.columns = get_return_statements(command)\n",
    "    display(pd.DataFrame(df.value_counts()))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "id": "269f2d79-80f2-48ea-8545-b9336a70ed19",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n</th>\n",
       "      <th>n.displayName</th>\n",
       "      <th>n.schemaClass</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>37</td>\n",
       "      <td>Positive gene expression regulation by p-S15,S...</td>\n",
       "      <td>PositiveGeneExpressionRegulation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>38</td>\n",
       "      <td>Positive gene expression regulation by E2F1:TF...</td>\n",
       "      <td>PositiveGeneExpressionRegulation</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    n                                      n.displayName  \\\n",
       "0  37  Positive gene expression regulation by p-S15,S...   \n",
       "1  38  Positive gene expression regulation by E2F1:TF...   \n",
       "\n",
       "                      n.schemaClass  \n",
       "0  PositiveGeneExpressionRegulation  \n",
       "1  PositiveGeneExpressionRegulation  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 9.05 ms, sys: 1.01 ms, total: 10.1 ms\n",
      "Wall time: 8.69 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all nodes of type \"PositiveGeneExpressionRegulation\" (which is also schemaClass)\n",
    "command = \"\"\"\n",
    "MATCH (n:PositiveGeneExpressionRegulation)\n",
    "RETURN n, n.displayName, n.schemaClass\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    df.columns = get_return_statements(command)\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 84,
   "id": "44d6f919-d953-4e48-9259-a16c3315f344",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 5 ms, sys: 1 ms, total: 6.01 ms\n",
      "Wall time: 5.24 ms\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.displayName</th>\n",
       "      <th>n.schemaClass</th>\n",
       "      <th>e</th>\n",
       "      <th>m.displayName</th>\n",
       "      <th>m.schemaClass</th>\n",
       "      <th>m.category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>0</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>2</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>E2F1:(TFDP1,TFDP2) [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>20</td>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>CYCS gene:NRF1:PPARGC1B [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>21</td>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>CYCS gene:NRF1:PPARGC1B [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>22</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>RORA:Coactivator [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>23</td>\n",
       "      <td>EP300 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>24</td>\n",
       "      <td>p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>24</td>\n",
       "      <td>p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>25</td>\n",
       "      <td>Positive gene expression regulation by p-S15,S...</td>\n",
       "      <td>PositiveGeneExpressionRegulation</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>26</td>\n",
       "      <td>TP53 binds the APAF1 gene promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>27</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>27</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>28</td>\n",
       "      <td>Positive gene expression regulation by p-S15,S...</td>\n",
       "      <td>PositiveGeneExpressionRegulation</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>E2F1:TFDP1,TFDP2 [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>29</td>\n",
       "      <td>E2F1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>E2F1:TFDP1,TFDP2 [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>30</td>\n",
       "      <td>E2F1 binds PMAIP1 (NOXA) promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>E2F1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>39</td>\n",
       "      <td>E2F1:(TFDP1,TFDP2) [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>ESRRA [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>40</td>\n",
       "      <td>ESRRA:PPARGC1A [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>42</td>\n",
       "      <td>APAF1:CYCS [cytosol]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>EP300 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>44</td>\n",
       "      <td>p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>45</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>PPARGC1A [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>49</td>\n",
       "      <td>RORA:Coactivator [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>PPARGC1A [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>50</td>\n",
       "      <td>ESRRA:PPARGC1A [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>APAF1 [cytosol]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>54</td>\n",
       "      <td>APAF1:CYCS [cytosol]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Positive gene expression regulation by E2F1:TF...</td>\n",
       "      <td>PositiveGeneExpressionRegulation</td>\n",
       "      <td>55</td>\n",
       "      <td>E2F1:TFDP1,TFDP2 [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                        n.displayName  \\\n",
       "0               TP53 binds the PMAIP1 (NOXA) promoter   \n",
       "1               TP53 binds the PMAIP1 (NOXA) promoter   \n",
       "2                    E2F1:(TFDP1,TFDP2) [nucleoplasm]   \n",
       "3               CYCS gene:NRF1:PPARGC1B [nucleoplasm]   \n",
       "4               CYCS gene:NRF1:PPARGC1B [nucleoplasm]   \n",
       "5                      RORA:Coactivator [nucleoplasm]   \n",
       "6               p-S15,S20-TP53 Tetramer [nucleoplasm]   \n",
       "7               p-S15,S20-TP53 Tetramer [nucleoplasm]   \n",
       "8               p-S15,S20-TP53 Tetramer [nucleoplasm]   \n",
       "9               p-S15,S20-TP53 Tetramer [nucleoplasm]   \n",
       "10              p-S15,S20-TP53 Tetramer [nucleoplasm]   \n",
       "11              p-S15,S20-TP53 Tetramer [nucleoplasm]   \n",
       "12  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]   \n",
       "13                     E2F1:TFDP1,TFDP2 [nucleoplasm]   \n",
       "14                     E2F1:TFDP1,TFDP2 [nucleoplasm]   \n",
       "15                                 E2F1 [nucleoplasm]   \n",
       "16                                ESRRA [nucleoplasm]   \n",
       "17                                     CYCS [cytosol]   \n",
       "18                                EP300 [nucleoplasm]   \n",
       "19                          PMAIP1 Gene [nucleoplasm]   \n",
       "20                             PPARGC1A [nucleoplasm]   \n",
       "21                             PPARGC1A [nucleoplasm]   \n",
       "22                                    APAF1 [cytosol]   \n",
       "23  Positive gene expression regulation by E2F1:TF...   \n",
       "\n",
       "                       n.schemaClass   e  \\\n",
       "0                           Reaction   0   \n",
       "1                           Reaction   2   \n",
       "2                            Complex  20   \n",
       "3                            Complex  21   \n",
       "4                            Complex  22   \n",
       "5                            Complex  23   \n",
       "6                            Complex  24   \n",
       "7                            Complex  24   \n",
       "8                            Complex  25   \n",
       "9                            Complex  26   \n",
       "10                           Complex  27   \n",
       "11                           Complex  27   \n",
       "12                           Complex  28   \n",
       "13                           Complex  29   \n",
       "14                           Complex  30   \n",
       "15     EntityWithAccessionedSequence  39   \n",
       "16     EntityWithAccessionedSequence  40   \n",
       "17     EntityWithAccessionedSequence  42   \n",
       "18     EntityWithAccessionedSequence  44   \n",
       "19     EntityWithAccessionedSequence  45   \n",
       "20     EntityWithAccessionedSequence  49   \n",
       "21     EntityWithAccessionedSequence  50   \n",
       "22     EntityWithAccessionedSequence  54   \n",
       "23  PositiveGeneExpressionRegulation  55   \n",
       "\n",
       "                                        m.displayName  \\\n",
       "0               p-S15,S20-TP53 Tetramer [nucleoplasm]   \n",
       "1   p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]   \n",
       "2                      E2F1 binds APAF1 gene promoter   \n",
       "3               NRF1:PPARGC1B binds the CYCS promoter   \n",
       "4                                  NRF1 [nucleoplasm]   \n",
       "5                                 EP300 [nucleoplasm]   \n",
       "6   p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...   \n",
       "7   p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...   \n",
       "8   Positive gene expression regulation by p-S15,S...   \n",
       "9                  TP53 binds the APAF1 gene promoter   \n",
       "10  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]   \n",
       "11  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]   \n",
       "12  Positive gene expression regulation by p-S15,S...   \n",
       "13                                 E2F1 [nucleoplasm]   \n",
       "14                  E2F1 binds PMAIP1 (NOXA) promoter   \n",
       "15                   E2F1:(TFDP1,TFDP2) [nucleoplasm]   \n",
       "16                       ESRRA:PPARGC1A [nucleoplasm]   \n",
       "17                               APAF1:CYCS [cytosol]   \n",
       "18  p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...   \n",
       "19  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]   \n",
       "20                     RORA:Coactivator [nucleoplasm]   \n",
       "21                       ESRRA:PPARGC1A [nucleoplasm]   \n",
       "22                               APAF1:CYCS [cytosol]   \n",
       "23                     E2F1:TFDP1,TFDP2 [nucleoplasm]   \n",
       "\n",
       "                       m.schemaClass m.category  \n",
       "0                            Complex       None  \n",
       "1                            Complex       None  \n",
       "2                           Reaction    binding  \n",
       "3                           Reaction    binding  \n",
       "4      EntityWithAccessionedSequence       None  \n",
       "5      EntityWithAccessionedSequence       None  \n",
       "6                            Complex       None  \n",
       "7                            Complex       None  \n",
       "8   PositiveGeneExpressionRegulation       None  \n",
       "9                           Reaction    binding  \n",
       "10                           Complex       None  \n",
       "11                           Complex       None  \n",
       "12  PositiveGeneExpressionRegulation       None  \n",
       "13     EntityWithAccessionedSequence       None  \n",
       "14                          Reaction    binding  \n",
       "15                           Complex       None  \n",
       "16                           Complex       None  \n",
       "17                           Complex       None  \n",
       "18                           Complex       None  \n",
       "19                           Complex       None  \n",
       "20                           Complex       None  \n",
       "21                           Complex       None  \n",
       "22                           Complex       None  \n",
       "23                           Complex       None  "
      ]
     },
     "execution_count": 84,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all edges involving a node of type Complex\n",
    "command = \"\"\"\n",
    "MATCH (n:Complex)-[e]-(m)\n",
    "RETURN n.displayName, n.schemaClass, e, m.displayName, m.schemaClass, m.category\n",
    "\"\"\"\n",
    "df1 = client.query(command)\n",
    "if df1.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    df1.columns = get_return_statements(command)\n",
    "\n",
    "command = \"\"\"\n",
    "MATCH (n)-[e]-(m:Complex)\n",
    "RETURN n.displayName, n.schemaClass, e, m.displayName, m.schemaClass, m.category\n",
    "\"\"\"\n",
    "df2 = client.query(command)\n",
    "if df2.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    df2.columns = get_return_statements(command)\n",
    "\n",
    "df = pd.concat([df1, df2], axis=0).sort_values(\"e\")\n",
    "df.index = range(len(df))\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c436ed7d-5f24-4acd-a285-01818e3b4d7d",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "id": "592e1831-5a79-4bb1-b02a-21c3a0d7643f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 8.35 ms, sys: 216 μs, total: 8.56 ms\n",
      "Wall time: 7.28 ms\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.displayName</th>\n",
       "      <th>n.schemaClass</th>\n",
       "      <th>e</th>\n",
       "      <th>m.displayName</th>\n",
       "      <th>m.schemaClass</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>CYCS binds to APAF1</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>7</td>\n",
       "      <td>Release of Cytochrome c from mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Translocation of PMAIP1 (NOXA) to mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>14</td>\n",
       "      <td>PMAIP1 [cytosol]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Translocation of PMAIP1 (NOXA) to mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>15</td>\n",
       "      <td>BH3-only proteins associate with and inactivat...</td>\n",
       "      <td>Reaction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Translocation of PMAIP1 (NOXA) to mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>16</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>BH3-only proteins associate with and inactivat...</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>17</td>\n",
       "      <td>Translocation of tBID to mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Translocation of tBID to mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>18</td>\n",
       "      <td>Release of Cytochrome c from mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Translocation of tBID to mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>18</td>\n",
       "      <td>Release of Cytochrome c from mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Release of Cytochrome c from mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>19</td>\n",
       "      <td>CYCS [mitochondrial intermembrane space]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Release of Cytochrome c from mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>19</td>\n",
       "      <td>CYCS [mitochondrial intermembrane space]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>37</td>\n",
       "      <td>Translocation of PMAIP1 (NOXA) to mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>41</td>\n",
       "      <td>Release of Cytochrome c from mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                        n.displayName  \\\n",
       "0                                 CYCS binds to APAF1   \n",
       "1      Translocation of PMAIP1 (NOXA) to mitochondria   \n",
       "2      Translocation of PMAIP1 (NOXA) to mitochondria   \n",
       "3      Translocation of PMAIP1 (NOXA) to mitochondria   \n",
       "4   BH3-only proteins associate with and inactivat...   \n",
       "5               Translocation of tBID to mitochondria   \n",
       "6               Translocation of tBID to mitochondria   \n",
       "7           Release of Cytochrome c from mitochondria   \n",
       "8           Release of Cytochrome c from mitochondria   \n",
       "9            TP53 stimulates PMAIP1 (NOXA) expression   \n",
       "10                                     CYCS [cytosol]   \n",
       "\n",
       "                    n.schemaClass   e  \\\n",
       "0                        Reaction   7   \n",
       "1                        Reaction  14   \n",
       "2                        Reaction  15   \n",
       "3                        Reaction  16   \n",
       "4                        Reaction  17   \n",
       "5                        Reaction  18   \n",
       "6                        Reaction  18   \n",
       "7                        Reaction  19   \n",
       "8                        Reaction  19   \n",
       "9                   BlackBoxEvent  37   \n",
       "10  EntityWithAccessionedSequence  41   \n",
       "\n",
       "                                        m.displayName  \\\n",
       "0           Release of Cytochrome c from mitochondria   \n",
       "1                                    PMAIP1 [cytosol]   \n",
       "2   BH3-only proteins associate with and inactivat...   \n",
       "3            Transactivation of PMAIP1 (NOXA) by E2F1   \n",
       "4               Translocation of tBID to mitochondria   \n",
       "5           Release of Cytochrome c from mitochondria   \n",
       "6           Release of Cytochrome c from mitochondria   \n",
       "7            CYCS [mitochondrial intermembrane space]   \n",
       "8            CYCS [mitochondrial intermembrane space]   \n",
       "9      Translocation of PMAIP1 (NOXA) to mitochondria   \n",
       "10          Release of Cytochrome c from mitochondria   \n",
       "\n",
       "                    m.schemaClass  \n",
       "0                        Reaction  \n",
       "1   EntityWithAccessionedSequence  \n",
       "2                        Reaction  \n",
       "3                   BlackBoxEvent  \n",
       "4                        Reaction  \n",
       "5                        Reaction  \n",
       "6                        Reaction  \n",
       "7   EntityWithAccessionedSequence  \n",
       "8   EntityWithAccessionedSequence  \n",
       "9                        Reaction  \n",
       "10                       Reaction  "
      ]
     },
     "execution_count": 85,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all edges involving one node related to mitochondria using string approximation\n",
    "command = \"\"\"\n",
    "MATCH (n {\"displayName\"~=\"mitochond\"})-[e]-(m)\n",
    "RETURN n.displayName, n.schemaClass, e, m.displayName, m.schemaClass\n",
    "\"\"\"\n",
    "df1 = client.query(command)\n",
    "if df1.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    df1.columns = get_return_statements(command)\n",
    "\n",
    "command = \"\"\"\n",
    "MATCH (n)-[e]-(m {\"displayName\"~=\"mitochond\"})\n",
    "RETURN n.displayName, n.schemaClass, e, m.displayName, m.schemaClass\n",
    "\"\"\"\n",
    "df2 = client.query(command)\n",
    "if df2.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    df2.columns = get_return_statements(command)\n",
    "\n",
    "df = pd.concat([df1, df2], axis=0).sort_values(\"e\")\n",
    "df.index = range(len(df))\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "id": "923fbf83-e3d6-408b-9d3f-4c5256da8fca",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.displayName</th>\n",
       "      <th>n.schemaClass</th>\n",
       "      <th>n.category</th>\n",
       "      <th>e</th>\n",
       "      <th>m.displayName</th>\n",
       "      <th>m.schemaClass</th>\n",
       "      <th>m.category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>0</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>1</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>2</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>3</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>TP53 binds the APAF1 gene promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>4</td>\n",
       "      <td>TP53 stimulates APAF1 gene expression</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>5</td>\n",
       "      <td>Expression of CYCS</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>6</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>CYCS binds to APAF1</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>7</td>\n",
       "      <td>Release of Cytochrome c from mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>transition</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>CYCS binds to APAF1</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>8</td>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>9</td>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>12</td>\n",
       "      <td>p38 MAPK phosphorylates PPARGC1A</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>transition</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>13</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>BH3-only proteins associate with and inactivat...</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>17</td>\n",
       "      <td>Translocation of tBID to mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>transition</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                        n.displayName n.schemaClass  \\\n",
       "0               TP53 binds the PMAIP1 (NOXA) promoter      Reaction   \n",
       "1               TP53 binds the PMAIP1 (NOXA) promoter      Reaction   \n",
       "2               TP53 binds the PMAIP1 (NOXA) promoter      Reaction   \n",
       "3               TP53 binds the PMAIP1 (NOXA) promoter      Reaction   \n",
       "4                  TP53 binds the APAF1 gene promoter      Reaction   \n",
       "5               NRF1:PPARGC1B binds the CYCS promoter      Reaction   \n",
       "6               NRF1:PPARGC1B binds the CYCS promoter      Reaction   \n",
       "7                                 CYCS binds to APAF1      Reaction   \n",
       "8                                 CYCS binds to APAF1      Reaction   \n",
       "9                      E2F1 binds APAF1 gene promoter      Reaction   \n",
       "10      NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter      Reaction   \n",
       "11      NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter      Reaction   \n",
       "12  BH3-only proteins associate with and inactivat...      Reaction   \n",
       "\n",
       "   n.category   e                                      m.displayName  \\\n",
       "0     binding   0              p-S15,S20-TP53 Tetramer [nucleoplasm]   \n",
       "1     binding   1                          PMAIP1 Gene [nucleoplasm]   \n",
       "2     binding   2  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]   \n",
       "3     binding   3           TP53 stimulates PMAIP1 (NOXA) expression   \n",
       "4     binding   4              TP53 stimulates APAF1 gene expression   \n",
       "5     binding   5                                 Expression of CYCS   \n",
       "6     binding   6                                 Expression of NRF1   \n",
       "7     binding   7          Release of Cytochrome c from mitochondria   \n",
       "8     binding   8                                     CYCS [cytosol]   \n",
       "9     binding   9  APAF1 gene expression is stimulated by E2F1 an...   \n",
       "10    binding  12                   p38 MAPK phosphorylates PPARGC1A   \n",
       "11    binding  13                                 Expression of NRF1   \n",
       "12    binding  17              Translocation of tBID to mitochondria   \n",
       "\n",
       "                    m.schemaClass  m.category  \n",
       "0                         Complex        None  \n",
       "1   EntityWithAccessionedSequence        None  \n",
       "2                         Complex        None  \n",
       "3                   BlackBoxEvent     omitted  \n",
       "4                   BlackBoxEvent     omitted  \n",
       "5                   BlackBoxEvent     omitted  \n",
       "6                   BlackBoxEvent     omitted  \n",
       "7                        Reaction  transition  \n",
       "8   EntityWithAccessionedSequence        None  \n",
       "9                   BlackBoxEvent     omitted  \n",
       "10                       Reaction  transition  \n",
       "11                  BlackBoxEvent     omitted  \n",
       "12                       Reaction  transition  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 11.8 ms, sys: 1.7 ms, total: 13.5 ms\n",
      "Wall time: 12.4 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all edges with a node of category \"binding\" going to an other node\n",
    "command = \"\"\"\n",
    "MATCH (n {\"category\"=\"binding\"})-[e]-(m)\n",
    "RETURN n.displayName, n.schemaClass, n.category, e, m.displayName, m.schemaClass, m.category\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    df.columns = get_return_statements(command)\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "17c6974d-d78a-492c-9de8-cf70f2114920",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "b95777b3-5825-440c-81ce-50d480b47535",
   "metadata": {},
   "source": [
    "## Complex queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "id": "e70391cc-1016-4a58-892f-ca19a738d343",
   "metadata": {},
   "outputs": [],
   "source": [
    "def build_query_chain(\n",
    "    hop_count: int,\n",
    "    start_node_label: str = None,\n",
    "    start_node_property: str = None,\n",
    "    start_node_value: str = None,\n",
    "    end_node_label: str = None,\n",
    "    end_node_property: str = None,\n",
    "    end_node_value: str = None,\n",
    "    edge_type: str = None,\n",
    "    intermediate_node_label: str = None,\n",
    "    return_properties: list = None\n",
    ") -> tuple[str, list[str]]:\n",
    "    \"\"\"\n",
    "    Build a general query to find chains between nodes.\n",
    "    \n",
    "    Parameters:\n",
    "    -----------\n",
    "    hop_count : int\n",
    "        Number of hops/edges in the path (REQUIRED)\n",
    "    start_node_label : str, optional\n",
    "        Label of the starting node (e.g., 'Process', 'Station')\n",
    "    start_node_property : str, optional\n",
    "        Property name to match on start node (e.g., 'displayName', 'id')\n",
    "    start_node_value : str, optional\n",
    "        Value to match for start node\n",
    "    end_node_label : str, optional\n",
    "        Label of the ending node (None for any node)\n",
    "    end_node_property : str, optional\n",
    "        Property name to match on end node\n",
    "    end_node_value : str, optional\n",
    "        Value to match for end node\n",
    "    edge_type : str, optional\n",
    "        Type of edges to traverse (None for any edge type)\n",
    "    intermediate_node_label : str, optional\n",
    "        Label constraint for intermediate nodes (None for any label)\n",
    "    return_properties : list, optional\n",
    "        List of property names to return for nodes (default: ['displayName'])\n",
    "    \n",
    "    Returns:\n",
    "    --------\n",
    "    tuple : (query_string, column_names)\n",
    "    \"\"\"\n",
    "    \n",
    "    if return_properties is None:\n",
    "        return_properties = ['displayName']\n",
    "    \n",
    "    # Build MATCH clause\n",
    "    query = \"MATCH \"\n",
    "    \n",
    "    # Start node - build based on what's provided\n",
    "    start_parts = []\n",
    "    if start_node_label:\n",
    "        start_parts.append(f\":{start_node_label}\")\n",
    "    if start_node_property and start_node_value:\n",
    "        start_parts.append(f'{{{start_node_property}:\"{start_node_value}\"}}')\n",
    "    \n",
    "    if start_parts:\n",
    "        query += f'(start{\"\".join(start_parts)})'\n",
    "    else:\n",
    "        query += \"(start)\"\n",
    "    \n",
    "    # Intermediate nodes and edges\n",
    "    for k in range(1, hop_count + 1):\n",
    "        # Edge\n",
    "        if edge_type:\n",
    "            query += f\"-[e{k}:{edge_type}]-\"\n",
    "        else:\n",
    "            query += f\"-[e{k}]-\"\n",
    "        \n",
    "        # Last hop - end node\n",
    "        if k == hop_count:\n",
    "            end_parts = []\n",
    "            if end_node_label:\n",
    "                end_parts.append(f\":{end_node_label}\")\n",
    "            if end_node_property and end_node_value:\n",
    "                end_parts.append(f'{{{end_node_property}:\"{end_node_value}\"}}')\n",
    "            \n",
    "            if end_parts:\n",
    "                query += f'(end{\"\".join(end_parts)})'\n",
    "            else:\n",
    "                query += \"(end)\"\n",
    "        # Intermediate nodes\n",
    "        else:\n",
    "            if intermediate_node_label:\n",
    "                query += f\"(s{k}:{intermediate_node_label})\"\n",
    "            else:\n",
    "                query += f\"(s{k})\"\n",
    "    \n",
    "    # Build RETURN clause\n",
    "    query += \" RETURN start\"\n",
    "    column_names = ['start']\n",
    "    \n",
    "    # Add start node properties\n",
    "    for prop in return_properties:\n",
    "        query += f\", start.{prop}\"\n",
    "        column_names.append(f'start.{prop}')\n",
    "    \n",
    "    # Add intermediate nodes/edges\n",
    "    for k in range(1, hop_count + 1):\n",
    "        query += f\", e{k}\"\n",
    "        column_names.append(f'e{k}')\n",
    "        \n",
    "        if k == hop_count:\n",
    "            query += \", end\"\n",
    "            column_names.append('end')\n",
    "            for prop in return_properties:\n",
    "                query += f\", end.{prop}\"\n",
    "                column_names.append(f'end.{prop}')\n",
    "        else:\n",
    "            query += f\", s{k}\"\n",
    "            column_names.append(f's{k}')\n",
    "            for prop in return_properties:\n",
    "                query += f\", s{k}.{prop}\"\n",
    "                column_names.append(f's{k}.{prop}')\n",
    "    \n",
    "    return query, column_names"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 175,
   "id": "42ad8aa8-94d1-43d0-907c-15d4d35569c7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "****************************************************************************************************\n",
      "1 hop(s) :\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>start</th>\n",
       "      <th>start.id</th>\n",
       "      <th>start.displayName</th>\n",
       "      <th>start.schemaClass</th>\n",
       "      <th>start.category</th>\n",
       "      <th>e1</th>\n",
       "      <th>end</th>\n",
       "      <th>end.id</th>\n",
       "      <th>end.displayName</th>\n",
       "      <th>end.schemaClass</th>\n",
       "      <th>end.category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>29</td>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "      <td>43</td>\n",
       "      <td>23</td>\n",
       "      <td>Expression of CYCS</td>\n",
       "      <td>Expression of CYCS</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>31</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "      <td>46</td>\n",
       "      <td>26</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>31</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "      <td>47</td>\n",
       "      <td>22</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>33</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "      <td>53</td>\n",
       "      <td>24</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   start                   start.id          start.displayName  \\\n",
       "0     29             CYCS [cytosol]             CYCS [cytosol]   \n",
       "1     31  PMAIP1 Gene [nucleoplasm]  PMAIP1 Gene [nucleoplasm]   \n",
       "2     31  PMAIP1 Gene [nucleoplasm]  PMAIP1 Gene [nucleoplasm]   \n",
       "3     33         NRF1 [nucleoplasm]         NRF1 [nucleoplasm]   \n",
       "\n",
       "               start.schemaClass start.category  e1  end  \\\n",
       "0  EntityWithAccessionedSequence           None  43   23   \n",
       "1  EntityWithAccessionedSequence           None  46   26   \n",
       "2  EntityWithAccessionedSequence           None  47   22   \n",
       "3  EntityWithAccessionedSequence           None  53   24   \n",
       "\n",
       "                                     end.id  \\\n",
       "0                        Expression of CYCS   \n",
       "1  TP53 stimulates PMAIP1 (NOXA) expression   \n",
       "2  Transactivation of PMAIP1 (NOXA) by E2F1   \n",
       "3                        Expression of NRF1   \n",
       "\n",
       "                            end.displayName end.schemaClass end.category  \n",
       "0                        Expression of CYCS   BlackBoxEvent      omitted  \n",
       "1  TP53 stimulates PMAIP1 (NOXA) expression   BlackBoxEvent      omitted  \n",
       "2  Transactivation of PMAIP1 (NOXA) by E2F1   BlackBoxEvent      omitted  \n",
       "3                        Expression of NRF1   BlackBoxEvent      omitted  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "****************************************************************************************************\n",
      "2 hop(s) :\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>start</th>\n",
       "      <th>start.id</th>\n",
       "      <th>start.displayName</th>\n",
       "      <th>start.schemaClass</th>\n",
       "      <th>start.category</th>\n",
       "      <th>e1</th>\n",
       "      <th>s1</th>\n",
       "      <th>s1.id</th>\n",
       "      <th>s1.displayName</th>\n",
       "      <th>s1.schemaClass</th>\n",
       "      <th>s1.category</th>\n",
       "      <th>e2</th>\n",
       "      <th>end</th>\n",
       "      <th>end.id</th>\n",
       "      <th>end.displayName</th>\n",
       "      <th>end.schemaClass</th>\n",
       "      <th>end.category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>33</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "      <td>51</td>\n",
       "      <td>6</td>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>13</td>\n",
       "      <td>24</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>33</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "      <td>52</td>\n",
       "      <td>2</td>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>5</td>\n",
       "      <td>23</td>\n",
       "      <td>Expression of CYCS</td>\n",
       "      <td>Expression of CYCS</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>33</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "      <td>52</td>\n",
       "      <td>2</td>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>6</td>\n",
       "      <td>24</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   start            start.id   start.displayName  \\\n",
       "0     33  NRF1 [nucleoplasm]  NRF1 [nucleoplasm]   \n",
       "1     33  NRF1 [nucleoplasm]  NRF1 [nucleoplasm]   \n",
       "2     33  NRF1 [nucleoplasm]  NRF1 [nucleoplasm]   \n",
       "\n",
       "               start.schemaClass start.category  e1  s1  \\\n",
       "0  EntityWithAccessionedSequence           None  51   6   \n",
       "1  EntityWithAccessionedSequence           None  52   2   \n",
       "2  EntityWithAccessionedSequence           None  52   2   \n",
       "\n",
       "                                           s1.id  \\\n",
       "0  NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter   \n",
       "1          NRF1:PPARGC1B binds the CYCS promoter   \n",
       "2          NRF1:PPARGC1B binds the CYCS promoter   \n",
       "\n",
       "                                  s1.displayName s1.schemaClass s1.category  \\\n",
       "0  NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter       Reaction     binding   \n",
       "1          NRF1:PPARGC1B binds the CYCS promoter       Reaction     binding   \n",
       "2          NRF1:PPARGC1B binds the CYCS promoter       Reaction     binding   \n",
       "\n",
       "   e2  end              end.id     end.displayName end.schemaClass  \\\n",
       "0  13   24  Expression of NRF1  Expression of NRF1   BlackBoxEvent   \n",
       "1   5   23  Expression of CYCS  Expression of CYCS   BlackBoxEvent   \n",
       "2   6   24  Expression of NRF1  Expression of NRF1   BlackBoxEvent   \n",
       "\n",
       "  end.category  \n",
       "0      omitted  \n",
       "1      omitted  \n",
       "2      omitted  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "****************************************************************************************************\n",
      "3 hop(s) :\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>start</th>\n",
       "      <th>start.id</th>\n",
       "      <th>start.displayName</th>\n",
       "      <th>start.schemaClass</th>\n",
       "      <th>start.category</th>\n",
       "      <th>e1</th>\n",
       "      <th>s1</th>\n",
       "      <th>s1.id</th>\n",
       "      <th>s1.displayName</th>\n",
       "      <th>s1.schemaClass</th>\n",
       "      <th>...</th>\n",
       "      <th>s2.id</th>\n",
       "      <th>s2.displayName</th>\n",
       "      <th>s2.schemaClass</th>\n",
       "      <th>s2.category</th>\n",
       "      <th>e3</th>\n",
       "      <th>end</th>\n",
       "      <th>end.id</th>\n",
       "      <th>end.displayName</th>\n",
       "      <th>end.schemaClass</th>\n",
       "      <th>end.category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>27</td>\n",
       "      <td>E2F1 [nucleoplasm]</td>\n",
       "      <td>E2F1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "      <td>39</td>\n",
       "      <td>12</td>\n",
       "      <td>E2F1:(TFDP1,TFDP2) [nucleoplasm]</td>\n",
       "      <td>E2F1:(TFDP1,TFDP2) [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>...</td>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>9</td>\n",
       "      <td>21</td>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>31</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "      <td>46</td>\n",
       "      <td>26</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>...</td>\n",
       "      <td>Translocation of PMAIP1 (NOXA) to mitochondria</td>\n",
       "      <td>Translocation of PMAIP1 (NOXA) to mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>transition</td>\n",
       "      <td>16</td>\n",
       "      <td>22</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>33</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "      <td>51</td>\n",
       "      <td>6</td>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>...</td>\n",
       "      <td>p38 MAPK phosphorylates PPARGC1A</td>\n",
       "      <td>p38 MAPK phosphorylates PPARGC1A</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>transition</td>\n",
       "      <td>10</td>\n",
       "      <td>24</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>3 rows × 23 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   start                   start.id          start.displayName  \\\n",
       "0     27         E2F1 [nucleoplasm]         E2F1 [nucleoplasm]   \n",
       "1     31  PMAIP1 Gene [nucleoplasm]  PMAIP1 Gene [nucleoplasm]   \n",
       "2     33         NRF1 [nucleoplasm]         NRF1 [nucleoplasm]   \n",
       "\n",
       "               start.schemaClass start.category  e1  s1  \\\n",
       "0  EntityWithAccessionedSequence           None  39  12   \n",
       "1  EntityWithAccessionedSequence           None  46  26   \n",
       "2  EntityWithAccessionedSequence           None  51   6   \n",
       "\n",
       "                                           s1.id  \\\n",
       "0               E2F1:(TFDP1,TFDP2) [nucleoplasm]   \n",
       "1       TP53 stimulates PMAIP1 (NOXA) expression   \n",
       "2  NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter   \n",
       "\n",
       "                                  s1.displayName s1.schemaClass  ...  \\\n",
       "0               E2F1:(TFDP1,TFDP2) [nucleoplasm]        Complex  ...   \n",
       "1       TP53 stimulates PMAIP1 (NOXA) expression  BlackBoxEvent  ...   \n",
       "2  NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter       Reaction  ...   \n",
       "\n",
       "                                            s2.id  \\\n",
       "0                  E2F1 binds APAF1 gene promoter   \n",
       "1  Translocation of PMAIP1 (NOXA) to mitochondria   \n",
       "2                p38 MAPK phosphorylates PPARGC1A   \n",
       "\n",
       "                                   s2.displayName  s2.schemaClass s2.category  \\\n",
       "0                  E2F1 binds APAF1 gene promoter        Reaction     binding   \n",
       "1  Translocation of PMAIP1 (NOXA) to mitochondria        Reaction  transition   \n",
       "2                p38 MAPK phosphorylates PPARGC1A        Reaction  transition   \n",
       "\n",
       "   e3 end                                             end.id  \\\n",
       "0   9  21  APAF1 gene expression is stimulated by E2F1 an...   \n",
       "1  16  22           Transactivation of PMAIP1 (NOXA) by E2F1   \n",
       "2  10  24                                 Expression of NRF1   \n",
       "\n",
       "                                     end.displayName  end.schemaClass  \\\n",
       "0  APAF1 gene expression is stimulated by E2F1 an...    BlackBoxEvent   \n",
       "1           Transactivation of PMAIP1 (NOXA) by E2F1    BlackBoxEvent   \n",
       "2                                 Expression of NRF1    BlackBoxEvent   \n",
       "\n",
       "  end.category  \n",
       "0      omitted  \n",
       "1      omitted  \n",
       "2      omitted  \n",
       "\n",
       "[3 rows x 23 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "****************************************************************************************************\n",
      "4 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "5 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "6 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "7 hop(s) :\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>start</th>\n",
       "      <th>start.id</th>\n",
       "      <th>start.displayName</th>\n",
       "      <th>start.schemaClass</th>\n",
       "      <th>start.category</th>\n",
       "      <th>e1</th>\n",
       "      <th>s1</th>\n",
       "      <th>s1.id</th>\n",
       "      <th>s1.displayName</th>\n",
       "      <th>s1.schemaClass</th>\n",
       "      <th>...</th>\n",
       "      <th>s6.id</th>\n",
       "      <th>s6.displayName</th>\n",
       "      <th>s6.schemaClass</th>\n",
       "      <th>s6.category</th>\n",
       "      <th>e7</th>\n",
       "      <th>end</th>\n",
       "      <th>end.id</th>\n",
       "      <th>end.displayName</th>\n",
       "      <th>end.schemaClass</th>\n",
       "      <th>end.category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>31</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "      <td>47</td>\n",
       "      <td>22</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>...</td>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>9</td>\n",
       "      <td>21</td>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1 rows × 47 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   start                   start.id          start.displayName  \\\n",
       "0     31  PMAIP1 Gene [nucleoplasm]  PMAIP1 Gene [nucleoplasm]   \n",
       "\n",
       "               start.schemaClass start.category  e1  s1  \\\n",
       "0  EntityWithAccessionedSequence           None  47  22   \n",
       "\n",
       "                                      s1.id  \\\n",
       "0  Transactivation of PMAIP1 (NOXA) by E2F1   \n",
       "\n",
       "                             s1.displayName s1.schemaClass  ...  \\\n",
       "0  Transactivation of PMAIP1 (NOXA) by E2F1  BlackBoxEvent  ...   \n",
       "\n",
       "                            s6.id                  s6.displayName  \\\n",
       "0  E2F1 binds APAF1 gene promoter  E2F1 binds APAF1 gene promoter   \n",
       "\n",
       "   s6.schemaClass s6.category e7 end  \\\n",
       "0        Reaction     binding  9  21   \n",
       "\n",
       "                                              end.id  \\\n",
       "0  APAF1 gene expression is stimulated by E2F1 an...   \n",
       "\n",
       "                                     end.displayName  end.schemaClass  \\\n",
       "0  APAF1 gene expression is stimulated by E2F1 an...    BlackBoxEvent   \n",
       "\n",
       "  end.category  \n",
       "0      omitted  \n",
       "\n",
       "[1 rows x 47 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "****************************************************************************************************\n",
      "8 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "9 hop(s) :\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>start</th>\n",
       "      <th>start.id</th>\n",
       "      <th>start.displayName</th>\n",
       "      <th>start.schemaClass</th>\n",
       "      <th>start.category</th>\n",
       "      <th>e1</th>\n",
       "      <th>s1</th>\n",
       "      <th>s1.id</th>\n",
       "      <th>s1.displayName</th>\n",
       "      <th>s1.schemaClass</th>\n",
       "      <th>...</th>\n",
       "      <th>s8.id</th>\n",
       "      <th>s8.displayName</th>\n",
       "      <th>s8.schemaClass</th>\n",
       "      <th>s8.category</th>\n",
       "      <th>e9</th>\n",
       "      <th>end</th>\n",
       "      <th>end.id</th>\n",
       "      <th>end.displayName</th>\n",
       "      <th>end.schemaClass</th>\n",
       "      <th>end.category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>31</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>None</td>\n",
       "      <td>46</td>\n",
       "      <td>26</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>...</td>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>9</td>\n",
       "      <td>21</td>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1 rows × 59 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   start                   start.id          start.displayName  \\\n",
       "0     31  PMAIP1 Gene [nucleoplasm]  PMAIP1 Gene [nucleoplasm]   \n",
       "\n",
       "               start.schemaClass start.category  e1  s1  \\\n",
       "0  EntityWithAccessionedSequence           None  46  26   \n",
       "\n",
       "                                      s1.id  \\\n",
       "0  TP53 stimulates PMAIP1 (NOXA) expression   \n",
       "\n",
       "                             s1.displayName s1.schemaClass  ...  \\\n",
       "0  TP53 stimulates PMAIP1 (NOXA) expression  BlackBoxEvent  ...   \n",
       "\n",
       "                            s8.id                  s8.displayName  \\\n",
       "0  E2F1 binds APAF1 gene promoter  E2F1 binds APAF1 gene promoter   \n",
       "\n",
       "   s8.schemaClass s8.category e9 end  \\\n",
       "0        Reaction     binding  9  21   \n",
       "\n",
       "                                              end.id  \\\n",
       "0  APAF1 gene expression is stimulated by E2F1 an...   \n",
       "\n",
       "                                     end.displayName  end.schemaClass  \\\n",
       "0  APAF1 gene expression is stimulated by E2F1 an...    BlackBoxEvent   \n",
       "\n",
       "  end.category  \n",
       "0      omitted  \n",
       "\n",
       "[1 rows x 59 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "****************************************************************************************************\n",
      "10 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "11 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "12 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "13 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "14 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "CPU times: user 46.2 ms, sys: 2.34 ms, total: 48.5 ms\n",
      "Wall time: 45.3 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all paths (with maximum length of 15 hops) between a node of type \"EntityWithAccessionedSequence\" and a node of type \"BlackBoxEvent\"\n",
    "max_hops = 15\n",
    "longest_df = None\n",
    "\n",
    "for hop in range(1, max_hops):\n",
    "    print(100 * \"*\")\n",
    "    print(f\"{hop} hop(s) :\\n\")\n",
    "    \n",
    "    query, cols = build_query_chain(\n",
    "        hop_count=hop,\n",
    "        start_node_label=\"EntityWithAccessionedSequence\",\n",
    "        end_node_label=\"BlackBoxEvent\",\n",
    "        return_properties=['id', 'displayName', 'schemaClass', 'category']\n",
    "    )\n",
    "    \n",
    "    # Use with client\n",
    "    df = client.query(query)\n",
    "    if df.empty:\n",
    "        print(\"No result found\")\n",
    "    else:\n",
    "        df.columns = cols\n",
    "        display(df)\n",
    "        longest_df = df\n",
    "\n",
    "print(100 * \"*\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9216b5bc-84f1-4b58-979c-839c75fd64ff",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "189ed0fa-3921-440c-b110-2b5599005faf",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "39609f4a-87dd-43e6-a9cc-a87db562b470",
   "metadata": {},
   "source": [
    "# Create subgraph to visualise"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 176,
   "id": "73818e8b-b909-415a-9079-1ac2579d67d6",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MultiGraph with 10 nodes and 10 edges\n",
      "Cypher CREATE command :\n",
      "\n",
      "****************************************************************************************************\n",
      "CREATE (n0:Node {\"id\":\"Translocation of PMAIP1 (NOXA) to mitochondria\", \"schemaClass\":\"Reaction\", \"stId\":\"R-HSA-140216\", \"oldStId\":\"REACT_1585\", \"releaseDate\":\"2004-10-27\", \"name\":\"[ Translocation of PMAIP1 (NOXA) to mitochondria ]\", \"stIdVersion\":\"R-HSA-140216.4\", \"speciesName\":\"Homo sapiens\", \"category\":\"transition\", \"displayName\":\"Translocation of PMAIP1 (NOXA) to mitochondria\"}),\n",
      "(n1:Node {\"id\":\"TP53 stimulates PMAIP1 (NOXA) expression\", \"schemaClass\":\"BlackBoxEvent\", \"stId\":\"R-HSA-140214\", \"oldStId\":\"REACT_2201\", \"releaseDate\":\"2004-10-27\", \"name\":\"[ TP53 stimulates PMAIP1 (NOXA) expression ]\", \"stIdVersion\":\"R-HSA-140214.6\", \"speciesName\":\"Homo sapiens\", \"category\":\"omitted\", \"displayName\":\"TP53 stimulates PMAIP1 (NOXA) expression\"}),\n",
      "(n2:Node {\"id\":\"E2F1 [nucleoplasm]\", \"schemaClass\":\"EntityWithAccessionedSequence\", \"stId\":\"R-HSA-68639\", \"oldStId\":\"REACT_2601\", \"name\":\"[ E2F1 , Transcription factor E2F1 , E2F-1 , Retinoblastoma binding protein 3 , RBBP-3 , PRB-binding protein E2F-1 , PBR3 , Retinoblastoma-associated protein 1 , RBAP-1 ]\", \"stIdVersion\":\"R-HSA-68639.2\", \"speciesName\":\"Homo sapiens\", \"referenceType\":\"ReferenceGeneProduct\", \"displayName\":\"E2F1 [nucleoplasm]\"}),\n",
      "(n3:Node {\"id\":\"E2F1:TFDP1,TFDP2 [nucleoplasm]\", \"schemaClass\":\"Complex\", \"stId\":\"R-HSA-68653\", \"oldStId\":\"REACT_5400\", \"name\":\"[ E2F1:TFDP1,TFDP2 , DP1/2:E2F1 ]\", \"stIdVersion\":\"R-HSA-68653.2\", \"speciesName\":\"Homo sapiens\", \"displayName\":\"E2F1:TFDP1,TFDP2 [nucleoplasm]\"}),\n",
      "(n4:Node {\"id\":\"APAF1 gene expression is stimulated by E2F1 and inhibited by E2F6\", \"schemaClass\":\"BlackBoxEvent\", \"stId\":\"R-HSA-9007496\", \"releaseDate\":\"2017-09-12\", \"name\":\"[ APAF1 gene expression is stimulated by E2F1 and inhibited by E2F6 ]\", \"stIdVersion\":\"R-HSA-9007496.4\", \"speciesName\":\"Homo sapiens\", \"category\":\"omitted\", \"displayName\":\"APAF1 gene expression is stimulated by E2F1 and inhibited by E2F6\"}),\n",
      "(n5:Node {\"id\":\"E2F1 binds APAF1 gene promoter\", \"schemaClass\":\"Reaction\", \"stId\":\"R-HSA-9007514\", \"releaseDate\":\"2017-09-12\", \"name\":\"[ E2F1 binds APAF1 gene promoter ]\", \"stIdVersion\":\"R-HSA-9007514.2\", \"speciesName\":\"Homo sapiens\", \"category\":\"binding\", \"displayName\":\"E2F1 binds APAF1 gene promoter\"}),\n",
      "(n6:Node {\"id\":\"E2F1:(TFDP1,TFDP2) [nucleoplasm]\", \"schemaClass\":\"Complex\", \"stId\":\"R-HSA-9007512\", \"name\":\"[ E2F1:(TFDP1,TFDP2) ]\", \"stIdVersion\":\"R-HSA-9007512.1\", \"speciesName\":\"Homo sapiens\", \"displayName\":\"E2F1:(TFDP1,TFDP2) [nucleoplasm]\"}),\n",
      "(n7:Node {\"id\":\"Transactivation of PMAIP1 (NOXA) by E2F1\", \"schemaClass\":\"BlackBoxEvent\", \"stId\":\"R-HSA-140217\", \"oldStId\":\"REACT_1872\", \"releaseDate\":\"2004-10-27\", \"name\":\"[ Transactivation of PMAIP1 (NOXA) by E2F1 ]\", \"stIdVersion\":\"R-HSA-140217.4\", \"speciesName\":\"Homo sapiens\", \"category\":\"omitted\", \"displayName\":\"Transactivation of PMAIP1 (NOXA) by E2F1\"}),\n",
      "(n8:Node {\"id\":\"Positive gene expression regulation by 'E2F1:TFDP1:PMAIP1 Gene [nucleoplasm]'\", \"schemaClass\":\"PositiveGeneExpressionRegulation\", \"stId\":\"R-HSA-159039\", \"oldStId\":\"REACT_6130\", \"stIdVersion\":\"R-HSA-159039.1\", \"displayName\":\"Positive gene expression regulation by E2F1:TFDP1:PMAIP1 Gene [nucleoplasm]\"}),\n",
      "(n9:Node {\"id\":\"PMAIP1 Gene [nucleoplasm]\", \"schemaClass\":\"EntityWithAccessionedSequence\", \"stId\":\"R-HSA-4331342\", \"oldStId\":\"REACT_170122\", \"name\":\"[ PMAIP1 Gene , NOXA Gene ]\", \"stIdVersion\":\"R-HSA-4331342.1\", \"speciesName\":\"Homo sapiens\", \"referenceType\":\"ReferenceDNASequence\", \"searchSeed\":\"1\", \"displayName\":\"PMAIP1 Gene [nucleoplasm]\"}),\n",
      "(n0)-[:CONNECTED]-(n1),\n",
      "(n0)-[:CONNECTED]-(n7),\n",
      "(n1)-[:CONNECTED]-(n9),\n",
      "(n2)-[:CONNECTED]-(n3),\n",
      "(n2)-[:CONNECTED]-(n6),\n",
      "(n3)-[:CONNECTED]-(n8),\n",
      "(n4)-[:CONNECTED]-(n5),\n",
      "(n5)-[:CONNECTED]-(n6),\n",
      "(n7)-[:CONNECTED]-(n9),\n",
      "(n7)-[:CONNECTED]-(n8)\n",
      "****************************************************************************************************\n"
     ]
    }
   ],
   "source": [
    "# Get subgraph\n",
    "subset_nodes = longest_df.filter(regex=\"id$\", axis=1).iloc[0].values.tolist()\n",
    "subG = G.subgraph(subset_nodes).copy()\n",
    "print(subG)\n",
    "\n",
    "# Build CREATE command from subgraph\n",
    "create_command_subG = build_create_command_from_networkx(subG)\n",
    "print(f\"Cypher CREATE command :\\n\\n{100 * '*'}\\n{create_command_subG}\\n{100 * '*'}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "09a3434e-b575-4f07-accc-b569ecce5305",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 177,
   "id": "8acf59d5-a985-4325-be49-9c55290398ac",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'reactome4_subgraph'"
      ]
     },
     "execution_count": 177,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "subgraph_name = f\"{graph_name}_subgraph\"\n",
    "subgraph_name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 178,
   "id": "fab85049-fee6-40d6-95ab-96ff6770812f",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 5.22 ms, sys: 1.72 ms, total: 6.94 ms\n",
      "Wall time: 10.4 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Create new graph\n",
    "client.query(f\"CREATE GRAPH {subgraph_name}\")\n",
    "client.set_graph(subgraph_name)\n",
    "\n",
    "# Create a new change on the graph\n",
    "change = client.query(\"CHANGE NEW\").loc[0, 0]\n",
    "\n",
    "# Checkout into the change\n",
    "client.checkout(change=change)\n",
    "\n",
    "# Run CREATE command\n",
    "client.query(create_command_subG)\n",
    "\n",
    "# Commit the change\n",
    "client.query(\"COMMIT\")\n",
    "client.query(\"CHANGE SUBMIT\")\n",
    "\n",
    "# Checkout into main\n",
    "client.checkout()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4f071193-caf7-46e6-b7a0-d245da522278",
   "metadata": {},
   "source": [
    "<div class=\"alert alert-block alert-info\">\n",
    "    <h2>\n",
    "        You can visualise the subgraph directly in the notebook below. For more details on nodes and edges, you can go to TuringDB visualizer (running on your instance)\n",
    "    </h2>\n",
    "</div>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "10abfb50-f96c-4285-9dc4-3c6d9d7c484a",
   "metadata": {},
   "source": [
    "<div class=\"alert alert-block alert-info\">\n",
    "    <h2>\n",
    "        Visualize your graph in TuringDB Graph Visualizer ! Now that your instance is running:\n",
    "    </h2>\n",
    "    <h3>\n",
    "        <ul>\n",
    "            <li>Go to <a href=\"https://console.turingdb.ai/databases\">TuringDB Console - Database Instances</a></li>\n",
    "            <li>In your current instance panel, click on \"Open Visualizer\" button</li>\n",
    "            <li>Visualizer opens, now you can choose your graph in the dropdown menu at the top-right corner</li>\n",
    "        </ul>\n",
    "        You can then play with your graph and visualize the nodes you want !\n",
    "    </h3>\n",
    "</div>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 179,
   "id": "4920341d-e0b3-4f0e-8d00-a7972b1678d3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Warning: When  cdn_resources is 'local' jupyter notebook has issues displaying graphics on chrome/safari. Use cdn_resources='in_line' or cdn_resources='remote' if you have issues viewing graphics in a notebook.\n",
      "reactome_graph.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"750px\"\n",
       "            src=\"reactome_graph.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7850c9bec710>"
      ]
     },
     "execution_count": 179,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from pyvis.network import Network\n",
    "import matplotlib.pyplot as plt\n",
    "import matplotlib.colors as mcolors\n",
    "\n",
    "net = Network(\n",
    "    height=\"750px\", width=\"100%\", notebook=True, bgcolor=\"#ffffff\", font_color=\"#000000\", directed=True\n",
    ")\n",
    "\n",
    "# Choose your palette (can be changed easily)\n",
    "palette_name = 'Pastel1'  # Options: 'tab10', 'Set3', 'Paired', 'viridis', 'plasma', etc.\n",
    "\n",
    "# Get unique node types\n",
    "unique_types = list(set(data.get('schemaClass') for _, data in G.nodes(data=True)))\n",
    "\n",
    "# Get colors from matplotlib palette\n",
    "cmap = plt.get_cmap(palette_name)\n",
    "colors = [mcolors.rgb2hex(cmap(i / len(unique_types))) for i in range(len(unique_types))]\n",
    "\n",
    "# Map types to colors\n",
    "type_colors = {node_type: colors[i] for i, node_type in enumerate(unique_types)}\n",
    "\n",
    "# Then use in your visualization\n",
    "for node, data in subG.nodes(data=True):\n",
    "    node_type = data.get('schemaClass', 'Unknown')\n",
    "    color = type_colors.get(node_type, '#95a5a6')\n",
    "\n",
    "    net.add_node(\n",
    "        node,\n",
    "        label=data.get(\"displayName\", str(node)),\n",
    "        title=f\"{data.get('displayName', '')}\",\n",
    "        color=color,\n",
    "        size=25,\n",
    "    )\n",
    "\n",
    "for source, target, data in subG.edges(data=True):\n",
    "    net.add_edge(source, target, color=\"#95a5a6\", width=3)\n",
    "\n",
    "net.toggle_physics(status=True)\n",
    "net.show(f\"{folder_name}_graph.html\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "411c5146-1364-44c4-a624-be2549ef992c",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "71b073f4-312e-4398-9fb9-a89614db5faa",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "339e4e08-96e8-4c86-ac2a-8b2b94abb1a0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "cebe1567-fa94-46ec-a84f-8a8f2c57edb0",
   "metadata": {},
   "source": [
    "# Use LLM to generate Cypher query"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7fb6883e-7a45-445e-bf5d-cd57f7b0f879",
   "metadata": {},
   "source": [
    "Before running this section, create a `.env` file in the project root with your API keys:\n",
    "\n",
    "```env\n",
    "ANTHROPIC_API_KEY=your_key_here\n",
    "OPENAI_API_KEY=your_key_here\n",
    "MISTRAL_API_KEY=your_key_here"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 180,
   "id": "f9f62caf-0b73-4fbf-9639-ba1d8d4ce517",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 180,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "# Load environment variables from .env file\n",
    "load_dotenv(override=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 181,
   "id": "9f732145-fd41-451a-9f39-b57db744f7b4",
   "metadata": {},
   "outputs": [],
   "source": [
    "api_keys = {\n",
    "    \"Anthropic\": os.getenv(\"ANTHROPIC_API_KEY\"),\n",
    "    \"Mistral\": os.getenv(\"MISTRAL_API_KEY\"),\n",
    "    \"OpenAI\": os.getenv(\"OPENAI_API_KEY\"),\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 182,
   "id": "3a8cfedf-6aa1-4d88-90ae-5e9d89e1f390",
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Build system prompt with TuringDB schema and examples\"\"\"\n",
    "\n",
    "turingdb_cypher_system_prompt = \"\"\"\n",
    "You are an expert at converting natural language questions into TuringDB queries.\n",
    "\n",
    "Your task is to generate syntactically correct TuringDB queries based on natural language input.\n",
    "\n",
    "VERY IMPORTANT - TuringDB Syntax Guidelines:\n",
    "1. Return ONLY the TuringDB query, no explanations or markdown formatting\n",
    "2. Use MATCH or CREATE operations only\n",
    "3. Nodes: (n:Label{property=\"value\"}) or (n:Label{property:value})\n",
    "4. Edges: Use UNDIRECTED syntax with - (NOT ->)\n",
    "5. Pattern matching: MATCH (n)-[e]-(m)\n",
    "6. Property matching: Use = or : operators for exact matching\n",
    "7. String approximation: Use ~= for approximate string matching\n",
    "8. Node ID injection: Use @ operator or AT keyword: (n @ 1) or (n AT 1)\n",
    "9. Multiple constraints: (n:Person,Engineer{name=\"John\", age=30})\n",
    "10. Return all matched entities: RETURN n, e, m or use RETURN * for all\n",
    "\n",
    "VERY IMPORTANT - FORBIDDEN in TuringDB:\n",
    "- Do NOT use directed edges (-> or <-)\n",
    "- Do NOT use AS aliases\n",
    "- Do NOT use LIMIT, SKIP clauses\n",
    "- Do NOT use WHERE clauses\n",
    "- Do NOT use WITH clauses\n",
    "- Do NOT use CALL (except for metaqueries)\n",
    "- Do NOT use toLower() or other functions\n",
    "\n",
    "Supported TuringDB Operations:\n",
    "- MATCH queries: MATCH (n:Label)-[e:Type]-(m) RETURN n, m\n",
    "- CREATE queries: CREATE (n:Label{property=\"value\"})-[e:Type]-(m:Label)\n",
    "- Metaqueries: CALL PROPERTIES(), CALL LABELS(), CALL EDGETYPES(), CALL LABELSETS()\n",
    "- Property types: String (\"text\" or `text`), Boolean (true/false), Integer (20), Unsigned (20u), Double (20.5)\n",
    "\n",
    "Examples for few-shot learning:\n",
    "- Find all persons: MATCH (n:Person) RETURN n\n",
    "- Find connections: MATCH (n:Person)-[e]-(m:Person) RETURN n, e, m\n",
    "- Create person: CREATE (n:Person{name=\"John\", age=30})\n",
    "- String approximation: MATCH (n{name~=\"John\"}) RETURN n\n",
    "- Node by ID: MATCH (n @ 1) RETURN n\n",
    "- Multiple IDs: MATCH (n:Person @ 1, 2, 3) RETURN n\n",
    "- Path with 1 hop between Station Paddington and Blackfriars:  MATCH (start:Station{displayName:\"Paddington\"})-[e1:CONNECTED]-(end:Station{displayName=\"Blackfriars\"}) RETURN start, start.displayName, start.Note, e1.Line, end, end.displayName, end.Note\n",
    "- Path with 2 hops between Station Paddington and Blackfriars: MATCH (start:Station{displayName:\"Paddington\"})-[e1:CONNECTED]-(s1:Station)-[e2:CONNECTED]-(end:Station{displayName=\"Blackfriars\"}) RETURN start, start.displayName, start.Note, e1.Line, s1, s1.displayName, s1.Note, e2.Line, end, end.displayName, end.Note\n",
    "- Path with 8 hops between Station Paddington and Blackfriars: MATCH (start:Station{displayName:\"Paddington\"})-[e1:CONNECTED]-(s1:Station)-[e2:CONNECTED]-(s2:Station)-[e3:CONNECTED]-(s3:Station)-[e4:CONNECTED]-(s4:Station)-[e5:CONNECTED]-(s5:Station)-[e6:CONNECTED]-(s6:Station)-[e7:CONNECTED]-(s7:Station)-[e8:CONNECTED]-(end:Station{displayName=\"Blackfriars\"}) RETURN start, start.displayName, start.Note, e1.Line, s1, s1.displayName, s1.Note, e2.Line, s2, s2.displayName, s2.Note, e3.Line, s3, s3.displayName, s3.Note, e4.Line, s4, s4.displayName, s4.Note, e5.Line, s5, s5.displayName, s5.Note, e6.Line, s6, s6.displayName, s6.Note, e7.Line, s7, s7.displayName, s7.Note, e8.Line, end, end.displayName, end.Note\n",
    "- Find all Chinese providers and what they supply: MATCH (n{provider_country:\"CHN\"}) RETURN n, n.provider_name, n.displayName, n.share_provided, n.type\n",
    "- Find all deposition tools and their types: MATCH (specific)-[e:IS_TYPE_OF]-(general:Tool_Resource{displayName:\"Deposition tools\"}) RETURN specific, specific.displayName, specific.provider_name, e, general, general.displayName\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c1f74732-e1cf-4ff8-b08c-1965065b26bc",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 192,
   "id": "92c324f1-f622-4132-91ef-4bf00af3904d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get subset of CREATE command to avoid exceeding context window\n",
    "create_command_subset = create_command.split(\"\\n\")[:5] + create_command.split(\"\\n\")[-5:]\n",
    "\n",
    "# Create system_prompt\n",
    "system_prompt = f\"\"\"\n",
    "TuringDB Cypher prompt :\n",
    "{turingdb_cypher_system_prompt}\n",
    "\n",
    "Here is a subset of the CREATE command used to create the graph, this way you know graph structure.\n",
    "Only a subset is passed because the whole command is to long :\n",
    "{create_command_subset}\n",
    "\n",
    "Here is also the output of \"CALL LABELS ()\" command, showing the different node types of the graph :\n",
    "{client.query(\"CALL LABELS ()\")}\n",
    "\n",
    "Here is also the output of \"CALL EDGETYPES ()\" command, showing the different edge types of the graph :\n",
    "{client.query(\"CALL EDGETYPES ()\")}\n",
    "\n",
    "Very important :\n",
    "- You MUST follow current TuringDB Syntax Guidelines\n",
    "- You MUST NOT USE what is FORBIDDEN in TuringDB\n",
    "- By default, RETURN ALL THE MATCHED NODES AND EDGES AND THEIR PROPERTIES in the RETURN section (except contrary demand from user)\n",
    "- Use the correct node and edge properties name in the MATCH section.\n",
    "- Use the correct node and edge properties name in the RETURN section.\n",
    "- Pay attention to which properties come from nodes or edges, to create a functioning query\n",
    "- Pay attention to lower and uppercases in properties\n",
    "- If some properties contain spaces, be careful to wrap them\n",
    "\n",
    "Give me the query FOLLOWING TURINGDB GUIDELINES AND NOT USING WHAT IS FORBIDDEN for this specific question :\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 193,
   "id": "18aa749e-0411-4311-8832-6cee3628ccc4",
   "metadata": {},
   "outputs": [],
   "source": [
    "question = \"\"\"\n",
    "Is there a path of any size linking gene PMAIP1 and gene E2F1 ?\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "457cb58e-7bfb-458b-bee4-cd314298df08",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 194,
   "id": "bc3f9afa-128f-4727-b784-180ac24a7087",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "cypher_query : MATCH (start{displayName:\"PMAIP1\"})-[e1]-(n1)-[e2]-(n2)-[e3]-(n3)-[e4]-(n4)-[e5]-(n5)-[e6]-(n6)-[e7]-(end{displayName:\"E2F1\"}) RETURN start, end, e1, e2, e3, e4, e5, e6, e7, n1, n2, n3, n4, n5, n6\n",
      "CPU times: user 27.8 ms, sys: 1.21 ms, total: 29.1 ms\n",
      "Wall time: 2.45 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "provider = \"Anthropic\"\n",
    "\n",
    "cypher_query = natural_language_to_cypher(\n",
    "    question=question,\n",
    "    system_prompt=system_prompt,\n",
    "    provider=provider,\n",
    "    api_key=api_keys[provider],\n",
    "    temperature=0.0,\n",
    "    #model=\"claude-3-haiku-20240307\",\n",
    ")\n",
    "print(f\"cypher_query : {cypher_query}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 195,
   "id": "d70a838e-63d9-4df6-a2cd-96914ed3127b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--> No result found\n",
      "\n",
      "CPU times: user 2.42 ms, sys: 89 μs, total: 2.51 ms\n",
      "Wall time: 1.91 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Set original graph\n",
    "client.set_graph(graph_name)\n",
    "\n",
    "df_path = client.query(cypher_query)\n",
    "df_path.columns = get_return_statements(cypher_query)\n",
    "if df_path.empty:\n",
    "    print(\"--> No result found\\n\")\n",
    "else:\n",
    "    display(df_path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1d25e5bc-a768-4440-9416-14a1316d7822",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4f8c1ade-0b71-4b57-a2b7-bf09a998a9d7",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cc3b5ea3-81ad-4f60-8969-bea2c1cb65d5",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "6d8564f0-4418-4868-9a9b-e9e998947a79",
   "metadata": {},
   "source": [
    "# Use LLM to get subgraph summary"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 197,
   "id": "edbe8085-c266-4dad-986b-2ed38100a14d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 24.9 ms, sys: 0 ns, total: 24.9 ms\n",
      "Wall time: 11.8 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "prompt = f\"\"\"\n",
    "Give me a summary of this graph. It represents biological entities, tell me more about the entities involved and the interactions.\n",
    "Here is the graph :\n",
    "{G.nodes(data=True)} {G.edges(data=True)}\n",
    "\"\"\"\n",
    "\n",
    "system_prompt = \"\"\"\n",
    "You are a specialist in analysing graphs and their structure.\n",
    "You will use your knowledge to add more information about the entities and relationships in the graph.\n",
    "Add information only when you are sure it is relevant.\n",
    "\"\"\"\n",
    "\n",
    "provider = \"OpenAI\"\n",
    "\n",
    "response = query_llm(\n",
    "    prompt=prompt,\n",
    "    system_prompt=system_prompt,\n",
    "    provider=provider,\n",
    "    api_key=api_keys[provider],\n",
    "    temperature=0.0\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 198,
   "id": "7b24dfd3-6297-4561-b928-e77774cff496",
   "metadata": {},
   "outputs": [],
   "source": [
    "from IPython.display import display, Markdown, HTML"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 199,
   "id": "32bb06da-51ec-4e3b-b688-9c06b2a602fa",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/markdown": [
       "The graph represents a complex network of interactions involving various biological entities primarily related to gene regulation, apoptosis, and cellular signaling in *Homo sapiens*. Here’s a summary of the key entities and their interactions:\n",
       "\n",
       "### Key Entities:\n",
       "1. **TP53 (Tumor Protein p53)**: A crucial tumor suppressor gene that regulates the cell cycle and functions in preventing cancer. It binds to the promoters of various genes, including PMAIP1 and APAF1, to stimulate their expression.\n",
       "   - **p-S15,S20-TP53 Tetramer**: The phosphorylated form of TP53 that is active in gene regulation.\n",
       "\n",
       "2. **PMAIP1 (NOXA)**: A pro-apoptotic gene that is regulated by TP53. It plays a role in apoptosis and is translocated to mitochondria to promote cell death.\n",
       "\n",
       "3. **APAF1 (Apoptotic Protease Activating Factor 1)**: A key component in the apoptosome that activates caspases, leading to apoptosis. Its expression is stimulated by TP53 and E2F1.\n",
       "\n",
       "4. **CYCS (Cytochrome c)**: A protein involved in the electron transport chain and apoptosis. It binds to APAF1 and is released from mitochondria during apoptosis.\n",
       "\n",
       "5. **E2F1**: A transcription factor that regulates the expression of genes involved in cell cycle progression and apoptosis. It binds to the promoters of PMAIP1 and APAF1.\n",
       "\n",
       "6. **NRF1 (Nuclear Respiratory Factor 1)**: A transcription factor that regulates the expression of genes involved in mitochondrial biogenesis and function, including CYCS.\n",
       "\n",
       "7. **PPARGC1A (Peroxisome Proliferator-Activated Receptor Gamma Coactivator 1-alpha)**: A coactivator that regulates genes involved in energy metabolism and mitochondrial function.\n",
       "\n",
       "8. **ESRRA (Estrogen-Related Receptor Alpha)**: A transcription factor that positively regulates the expression of various genes, including those involved in mitochondrial function.\n",
       "\n",
       "### Key Interactions:\n",
       "- **TP53 Binding**: TP53 binds to the promoters of PMAIP1 and APAF1, stimulating their expression, which is crucial for apoptosis.\n",
       "- **E2F1 Regulation**: E2F1 also binds to the promoters of PMAIP1 and APAF1, indicating a collaborative role in regulating apoptosis and cell cycle.\n",
       "- **CYCS and APAF1 Interaction**: CYCS binds to APAF1, leading to the formation of the apoptosome and subsequent activation of caspases, which are essential for the apoptotic process.\n",
       "- **Translocation Events**: PMAIP1 is translocated to mitochondria, where it can exert its pro-apoptotic effects, and CYCS is released from mitochondria, further promoting apoptosis.\n",
       "- **Positive Regulation**: The interactions between TP53, E2F1, and other transcription factors like NRF1 and ESRRA indicate a complex regulatory network that ensures proper gene expression in response to cellular stress and damage.\n",
       "\n",
       "### Conclusion:\n",
       "This graph illustrates a network of interactions that highlight the roles of TP53, E2F1, and other transcription factors in regulating apoptosis and gene expression in response to cellular signals. The interplay between these entities is crucial for maintaining cellular homeostasis and preventing tumorigenesis."
      ],
      "text/plain": [
       "<IPython.core.display.Markdown object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "display(Markdown(response))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7635bb0f-031c-4401-9978-6eff01dad2b5",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "578ee33c-5d1c-45fa-9f40-c66fd2ce25f0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "76b947cf-d996-433d-a6b6-c1e00ebb6fa6",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 200,
   "id": "cfea1ab5-f1d5-4235-8c00-75ae7ca0e5fe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Notebook finished !\n"
     ]
    }
   ],
   "source": [
    "print(\"Notebook finished !\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ff261309-7eec-4bae-97b1-23044924feaa",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c3ee45c1-6fed-4d2c-9b5f-c9e2435cb52b",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bc245f10-cd1f-4de7-8e6d-6e7b53489c42",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
