{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "7278c11e-3a76-4484-9156-d6d7f0cb9d10",
   "metadata": {},
   "source": [
    "<div class=\"alert alert-block alert-success\">\n",
    "    <h1>\n",
    "        Example notebook - Reactome subgraph\n",
    "    </h1>\n",
    "</div>"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "bb02cacb-b6f4-4ce1-beff-27d2a32807e6",
   "metadata": {},
   "source": [
    "# Import modules and functions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "7de3204c-d954-4051-a9eb-4ee5b804f44b",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "import glob\n",
    "import re\n",
    "import networkx as nx\n",
    "import pandas as pd\n",
    "import time\n",
    "from tqdm.auto import tqdm\n",
    "\n",
    "from IPython.display import display, Markdown\n",
    "\n",
    "from turingdb_examples.graph import networkx_to_jsonl\n",
    "from turingdb_examples.llm import natural_language_to_cypher, query_llm"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "8e1972f5-8f2a-40de-9943-1844f60f3df3",
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext autoreload\n",
    "%autoreload 2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "079532d6-0953-4ef5-9482-d01e6716dd4b",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cdda4563-a64e-4fa5-a3d3-21b4c1970a96",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "2655b067-0c06-4f5d-87d7-4ebb57a96a0a",
   "metadata": {},
   "source": [
    "# Check data files are available"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "814057c3-731d-459c-9271-7e18447129ae",
   "metadata": {},
   "outputs": [],
   "source": [
    "example_name = \"reactome\"\n",
    "path_data = f\"{os.getcwd()}/data/{example_name}\"\n",
    "if not os.path.exists(path_data):\n",
    "    raise ValueError(f\"{path_data} does not exists\")\n",
    "\n",
    "list_csv_files = sorted(\n",
    "    [os.path.basename(file) for file in glob.glob(os.path.join(path_data, \"*\"))]\n",
    ")\n",
    "if not \"entities_pairwise.gml\" in list_csv_files:\n",
    "    raise ValueError(\n",
    "        f\"At least one of the {len(list_csv_files)} csv files is not available in {path_data}\"\n",
    "    )"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d9b16134-b739-4e07-8a84-bfd9e51e68e0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "14026c33-93f6-4d97-a9db-a5c397ec5e1c",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "7821af94-8984-46a9-85fa-bb02b85d0471",
   "metadata": {},
   "source": [
    "# Import `gml` file"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "8737d814-7fe9-4514-bb84-3bd15cc73098",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MultiGraph with 40 nodes and 57 edges\n"
     ]
    }
   ],
   "source": [
    "G = nx.read_gml(f\"{path_data}/entities_pairwise.gml\")\n",
    "print(G)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4f1154f4-4ca6-467b-8b3c-043bab4ae2e5",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bf8c10c0-777f-454a-99bf-256b93f1ff87",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "08c957ea-8f9a-4715-9f4c-f30beb66e68a",
   "metadata": {},
   "source": [
    "# Create `turingdb` python client"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f58fba87-0225-4f4e-8cc5-5d17e6ed1fad",
   "metadata": {},
   "source": [
    "<div class=\"alert alert-block alert-info\">\n",
    "    <h2>\n",
    "        See <a href=\"https://docs.turingdb.ai/quickstart\">TuringDB Get started documentation</a> for the important steps to follow :\n",
    "    </h2>\n",
    "    <h3>\n",
    "        Remember to have your <code>turingdb</code> server running while working in this notebook !\n",
    "    </h3>\n",
    "</div>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "2c400c3c-7ca0-4c34-8b12-d4ad93572d4e",
   "metadata": {},
   "outputs": [],
   "source": [
    "from turingdb import TuringDB\n",
    "\n",
    "# Create TuringDB client\n",
    "# set host parameter to the URL (as string) on which TuringDB is running,\n",
    "# default \"http://localhost:6666\"\n",
    "client = TuringDB(host=\"http://localhost:6666\")\n",
    "try:\n",
    "    client.warmup()\n",
    "except Exception as e:\n",
    "    print(f\"TuringDB not started, please run `uv run turingdb` in your terminal\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "7b0eec69-e019-4f7b-99ac-84b81981da46",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Get list of available graphs\n",
    "list_graphs = client.list_available_graphs()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "a29ecfff-b10b-4768-be00-153d715e5df2",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['london_transport_TfL1_subgraph',\n",
       " 'london_transport_TfL1',\n",
       " 'wine_ontology1',\n",
       " 'healthcare_dataset1_subgraph',\n",
       " 'healthcare_dataset1',\n",
       " 'paysim_financial_fraud_detection1',\n",
       " 'crypto_orbitaal_fraud_detection1',\n",
       " 'default']"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Get list of loaded graphs\n",
    "client.list_loaded_graphs()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "340b30de-08fd-419c-a8d3-b36d6de6098c",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e74d1891-11fe-4451-a54f-40c5fa56330b",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "5f4089d9-dfb9-452c-8019-59b5134eed56",
   "metadata": {},
   "source": [
    "# Set graph name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "4fb46284-0dbe-4b78-bc73-09f9f44ef9c4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'reactome3'"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Set graph name\n",
    "graph_name_prefix = example_name\n",
    "graph_name_nb_suffix = str(\n",
    "    max(\n",
    "        [\n",
    "            int(re.sub(graph_name_prefix, \"\", g))\n",
    "            for g in list_graphs\n",
    "            if g.startswith(graph_name_prefix)\n",
    "            and re.sub(graph_name_prefix, \"\", g).isdigit()\n",
    "        ]\n",
    "        + [0]\n",
    "    )\n",
    "    + 1\n",
    ")\n",
    "graph_name = graph_name_prefix + graph_name_nb_suffix\n",
    "graph_name = re.sub(\"-\", \"_\", graph_name)\n",
    "graph_name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e5535984-485c-45dd-980f-42ace87734d9",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9dd8d281-cf31-43fe-af81-b0c5c50234e4",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "5a3168df-8282-4f6d-b648-e7835fc4c26e",
   "metadata": {},
   "source": [
    "# Create JSONL file"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "d90e7cb6-d58b-4d98-85d1-b866e441d2b8",
   "metadata": {},
   "outputs": [],
   "source": [
    "turingdb_dir = os.path.expanduser(\"~/.turing/data\")\n",
    "if not os.path.exists(turingdb_dir):\n",
    "    raise ValueError(f\"\"\"\n",
    "    TuringDB directory {turingdb_dir} does not exist.\n",
    "    Make sure the value you set here is the same you set when running turingdb.\n",
    "    \"\"\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "a8527ffb-95ab-4381-9aa0-fd1e4da623db",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Writing graph to JSONL...\n",
      "JSONL file written to: /home/ubuntu/.turing/data/reactome3.jsonl\n",
      "Graph: 40 nodes, 57 edges\n",
      "CPU times: user 997 μs, sys: 0 ns, total: 997 μs\n",
      "Wall time: 842 μs\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Write graph to JSONL format\n",
    "print(\"Writing graph to JSONL...\")\n",
    "jsonl_filename = networkx_to_jsonl(\n",
    "    G,\n",
    "    graph_name,\n",
    "    node_type_key=\"schemaClass\",\n",
    "    data_dir=turingdb_dir\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "9c2ecd3a-5e73-426b-a81b-bf791b86a69c",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "5b46873c-72e6-4285-abfd-4a7190cb2a3d",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "b2d37e4b-7d77-4358-add1-0067601664c0",
   "metadata": {},
   "source": [
    "# Create `turingdb` graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "fa58b272-5099-4bb9-880d-51a68b717643",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Creating graph: reactome3\n"
     ]
    }
   ],
   "source": [
    "print(f\"Creating graph: {graph_name}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "2b0a2da8-b415-4af5-8a35-190f261f1396",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "Loading JSONL into TuringDB as graph 'reactome3' ...\n",
      "\n",
      "✓ Graph 'reactome3' created in 0.07 seconds\n",
      "CPU times: user 164 μs, sys: 1.99 ms, total: 2.15 ms\n",
      "Wall time: 67.6 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "start_time = time.time()\n",
    "\n",
    "# Load JSONL into TuringDB\n",
    "print(f\"\\nLoading JSONL into TuringDB as graph '{graph_name}' ...\")\n",
    "client.query(f\"LOAD JSONL '{jsonl_filename}' AS {graph_name}\")\n",
    "\n",
    "execution_time = time.time() - start_time\n",
    "print(f\"\\n\\u2713 Graph '{graph_name}' created in {execution_time:.2f} seconds\")\n",
    "\n",
    "# Set active graph for querying\n",
    "client.set_graph(graph_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0661de81-0d14-4f73-9bbf-fd40ce2874b0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "11081fa1-2ff2-4d37-bd8d-7bc3c2dddba1",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>commit</th>\n",
       "      <th>nodeCount</th>\n",
       "      <th>edgeCount</th>\n",
       "      <th>partCount</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>f3cb9c062ae9c661</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>425c60854574202</td>\n",
       "      <td>40</td>\n",
       "      <td>57</td>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "             commit  nodeCount  edgeCount  partCount\n",
       "0  f3cb9c062ae9c661          0          0          0\n",
       "1   425c60854574202         40         57          1"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Returns the commit history\n",
    "client.query(\"CALL db.history()\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f4410dae-ba75-49fc-be9a-94a7f54e095b",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "26ed110a-d9c0-434c-b1ce-bd0b365a4e55",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "d0a2f889-c461-4942-867b-d628a6b135f5",
   "metadata": {},
   "source": [
    "# Query `turingdb` graph"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "2cc5df1c-aaca-46bd-8368-0aee272dca10",
   "metadata": {},
   "source": [
    "## Use metaqueries to have insight on graph overall structure\n",
    "\n",
    "<h3>\n",
    "    To learn more about 📮 Metaqueries, please check TuringDB documentation on this <a href=\"https://turingdb.mintlify.app/query/cypher_subset#%F0%9F%93%AE-metaqueries\">link</a>\n",
    "</h3>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "9a31311e-b523-4682-8afb-33297dc3a5ed",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>propertyType</th>\n",
       "      <th>valueType</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>category</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>displayName</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>id</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>name</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>oldStId</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>releaseDate</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>6</td>\n",
       "      <td>schemaClass</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>7</td>\n",
       "      <td>speciesName</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>8</td>\n",
       "      <td>stId</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>9</td>\n",
       "      <td>stIdVersion</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>10</td>\n",
       "      <td>referenceType</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>11</td>\n",
       "      <td>searchSeed</td>\n",
       "      <td>String</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    id   propertyType valueType\n",
       "0    0       category    String\n",
       "1    1    displayName    String\n",
       "2    2             id    String\n",
       "3    3           name    String\n",
       "4    4        oldStId    String\n",
       "5    5    releaseDate    String\n",
       "6    6    schemaClass    String\n",
       "7    7    speciesName    String\n",
       "8    8           stId    String\n",
       "9    9    stIdVersion    String\n",
       "10  10  referenceType    String\n",
       "11  11     searchSeed    String"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.07 ms, sys: 2 μs, total: 3.07 ms\n",
      "Wall time: 2.95 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# CALL propertyTypes() - returns a column of all the different node and edge properties and their types in the database\n",
    "command = \"\"\"\n",
    "CALL db.propertyTypes()\n",
    "\"\"\"\n",
    "df_propertyTypes = client.query(command)\n",
    "if df_propertyTypes.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df_propertyTypes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "0feda55d-d308-476e-bcef-dce2dd2811c4",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties: ['category', 'displayName', 'id', 'name', 'oldStId', 'releaseDate', 'schemaClass', 'speciesName', 'stId', 'stIdVersion', 'referenceType', 'searchSeed']\n"
     ]
    }
   ],
   "source": [
    "# Get node properties\n",
    "nodes_properties = df_propertyTypes[\"propertyType\"].values.tolist()\n",
    "print(f\"Node properties: {nodes_properties}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "987724ca-923f-4a29-bc53-b5ebf471cdd4",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>Reaction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>Complex</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>PositiveGeneExpressionRegulation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>PositiveRegulation</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   id                             label\n",
       "0   0                          Reaction\n",
       "1   1                           Complex\n",
       "2   2                     BlackBoxEvent\n",
       "3   3     EntityWithAccessionedSequence\n",
       "4   4  PositiveGeneExpressionRegulation\n",
       "5   5                PositiveRegulation"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 1.94 ms, sys: 949 μs, total: 2.89 ms\n",
      "Wall time: 2.81 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# CALL labels () - returns a column of all the different node labels\n",
    "command = \"\"\"\n",
    "CALL db.labels()\n",
    "\"\"\"\n",
    "df_labels = client.query(command)\n",
    "if df_labels.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df_labels)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "8c593c43-3a69-4ebd-a025-1004abca3a64",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>id</th>\n",
       "      <th>edgeType</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>CONNECTED</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   id   edgeType\n",
       "0   0  CONNECTED"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.65 ms, sys: 37 μs, total: 2.69 ms\n",
      "Wall time: 2.5 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# CALL edgeTypes() - returns a column of all the different edge types (edge equivalent of node labels)\n",
    "command = \"\"\"\n",
    "CALL db.edgeTypes()\n",
    "\"\"\"\n",
    "df_edgeTypes = client.query(command)\n",
    "if df_edgeTypes.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df_edgeTypes)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0e35679b-f3e8-45b2-af92-aa1ab5a092b4",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c292c146-8833-4f04-80d0-6ebbde8eb5e0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "96dd2168-7e7e-4768-a971-57a2f812a9fc",
   "metadata": {},
   "source": [
    "## Counts"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "b3c078ae-9e88-4627-b128-3cd419b29a61",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Graph: 40 nodes and 57 edges\n",
      "\n",
      "CPU times: user 2.12 ms, sys: 0 ns, total: 2.12 ms\n",
      "Wall time: 1.94 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find number of nodes and number of edges in the graph\n",
    "n_nodes = len(client.query(\"MATCH (n) RETURN n\"))\n",
    "n_edges = len(client.query(\"MATCH (n)-->(m) RETURN n, m\"))\n",
    "print(f\"Graph: {n_nodes:,} nodes and {n_edges:,} edges\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "128f9f62-d7e3-4f33-8bf1-79f165b9d124",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>40</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(n)\n",
       "0        40"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>COUNT(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>57</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   COUNT(n)\n",
       "0        57"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Graph: 40 nodes and 57 edges\n",
      "\n",
      "CPU times: user 4.55 ms, sys: 0 ns, total: 4.55 ms\n",
      "Wall time: 4.33 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Count all nodes\n",
    "command = \"\"\"\n",
    "MATCH (n)\n",
    "RETURN COUNT(n)\n",
    "\"\"\"\n",
    "df_count_nodes = client.query(command)\n",
    "display(df_count_nodes)\n",
    "\n",
    "# Count all edges\n",
    "command = \"\"\"\n",
    "MATCH (n)-->()\n",
    "RETURN COUNT(n)\n",
    "\"\"\"\n",
    "df_count_edges = client.query(command)\n",
    "display(df_count_edges)\n",
    "\n",
    "# Find number of nodes and number of edges in the graph\n",
    "n_nodes = int(df_count_nodes.loc[0, \"COUNT(n)\"])\n",
    "n_edges = int(df_count_edges.loc[0, \"COUNT(n)\"])\n",
    "print(f\"Graph: {n_nodes:,} nodes and {n_edges:,} edges\\n\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "10bd1958-7a27-4fa5-b6c8-ceb6363af404",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "8f96cbff-8548-4296-919b-7aaa1a4b6cba",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "----------------------------------------------------------------------------------------------------\n",
      "label: Reaction\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>['TP53 binds the PMAIP1 (NOXA) promoter']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>['TP53 binds the APAF1 gene promoter']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>['NRF1:PPARGC1B binds the CYCS promoter']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>['CYCS binds to APAF1']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>['E2F1 binds APAF1 gene promoter']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>['p38 MAPK phosphorylates PPARGC1A']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>['NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>['E2F1 binds PMAIP1 (NOXA) promoter']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>['Translocation of PMAIP1 (NOXA) to mitochondr...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>['BH3-only proteins associate with and inactiv...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>['Translocation of tBID to mitochondria']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>['Release of Cytochrome c from mitochondria']</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                               n.name\n",
       "0           ['TP53 binds the PMAIP1 (NOXA) promoter']\n",
       "1              ['TP53 binds the APAF1 gene promoter']\n",
       "2           ['NRF1:PPARGC1B binds the CYCS promoter']\n",
       "3                             ['CYCS binds to APAF1']\n",
       "4                  ['E2F1 binds APAF1 gene promoter']\n",
       "5                ['p38 MAPK phosphorylates PPARGC1A']\n",
       "6   ['NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter']\n",
       "7               ['E2F1 binds PMAIP1 (NOXA) promoter']\n",
       "8   ['Translocation of PMAIP1 (NOXA) to mitochondr...\n",
       "9   ['BH3-only proteins associate with and inactiv...\n",
       "10          ['Translocation of tBID to mitochondria']\n",
       "11      ['Release of Cytochrome c from mitochondria']"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0        12"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n",
      "label: Complex\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>['E2F1:(TFDP1,TFDP2)']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>['APAF1:CYCS','APAF1:Cytochrome C']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>['CYCS gene:NRF1:PPARGC1B','NRF1:PGC-1beta:CYCS']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>['RORA:Coactivator']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>['p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>['ESRRA:PPARGC1A']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>['p-S15,S20-TP53 Tetramer']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>['p-S15,S20-TP53 Tetramer:PMAIP1 Gene']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>['E2F1:TFDP1,TFDP2','DP1/2:E2F1']</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              n.name\n",
       "0                             ['E2F1:(TFDP1,TFDP2)']\n",
       "1                ['APAF1:CYCS','APAF1:Cytochrome C']\n",
       "2  ['CYCS gene:NRF1:PPARGC1B','NRF1:PGC-1beta:CYCS']\n",
       "3                               ['RORA:Coactivator']\n",
       "4  ['p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene']\n",
       "5                                 ['ESRRA:PPARGC1A']\n",
       "6                        ['p-S15,S20-TP53 Tetramer']\n",
       "7            ['p-S15,S20-TP53 Tetramer:PMAIP1 Gene']\n",
       "8                  ['E2F1:TFDP1,TFDP2','DP1/2:E2F1']"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0         9"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n",
      "label: BlackBoxEvent\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>['APAF1 gene expression is stimulated by E2F1 ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>['Transactivation of PMAIP1 (NOXA) by E2F1']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>['Expression of CYCS','Expression of Cytochrom...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>['Expression of NRF1']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>['TP53 stimulates APAF1 gene expression']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>['TP53 stimulates PMAIP1 (NOXA) expression']</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              n.name\n",
       "0  ['APAF1 gene expression is stimulated by E2F1 ...\n",
       "1       ['Transactivation of PMAIP1 (NOXA) by E2F1']\n",
       "2  ['Expression of CYCS','Expression of Cytochrom...\n",
       "3                             ['Expression of NRF1']\n",
       "4          ['TP53 stimulates APAF1 gene expression']\n",
       "5       ['TP53 stimulates PMAIP1 (NOXA) expression']"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0         6"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n",
      "label: EntityWithAccessionedSequence\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>['E2F1','Transcription factor E2F1','E2F-1','R...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>['ESRRA','Steroid hormone receptor ERR1','ERR1...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>['CYCS','Cytochrome c']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>['EP300','p300','Histone acetyltransferase p30...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>['PMAIP1 Gene','NOXA Gene']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>['PPARGC1A','Peroxisome proliferator-activated...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>['NRF1','Nuclear respiratory factor 1','NRF1_H...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>['CYCS','Cytochrome c']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>['PMAIP1','NOXA protein']</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>['APAF1','Apaf-1','Apoptotic protease activati...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                              n.name\n",
       "0  ['E2F1','Transcription factor E2F1','E2F-1','R...\n",
       "1  ['ESRRA','Steroid hormone receptor ERR1','ERR1...\n",
       "2                            ['CYCS','Cytochrome c']\n",
       "3  ['EP300','p300','Histone acetyltransferase p30...\n",
       "4                        ['PMAIP1 Gene','NOXA Gene']\n",
       "5  ['PPARGC1A','Peroxisome proliferator-activated...\n",
       "6  ['NRF1','Nuclear respiratory factor 1','NRF1_H...\n",
       "7                            ['CYCS','Cytochrome c']\n",
       "8                          ['PMAIP1','NOXA protein']\n",
       "9  ['APAF1','Apaf-1','Apoptotic protease activati..."
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0        10"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n",
      "label: PositiveGeneExpressionRegulation\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  n.name\n",
       "0   <NA>\n",
       "1   <NA>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0         2"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n",
      "label: PositiveRegulation\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.name</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "  n.name\n",
       "0   <NA>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count(n)</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   count(n)\n",
       "0         1"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "----------------------------------------------------------------------------------------------------\n"
     ]
    }
   ],
   "source": [
    "# Count number of nodes for each label\n",
    "for label in df_labels[\"label\"]:\n",
    "    print(100 * '-')\n",
    "    print(f\"label: {label}\")\n",
    "    df_curr_label = client.query(f\"\"\"\n",
    "    MATCH (n:{label})\n",
    "    RETURN n.name\n",
    "    \"\"\")\n",
    "    df_curr_label_count = client.query(f\"\"\"\n",
    "    MATCH (n:{label})\n",
    "    RETURN count(n)\n",
    "    \"\"\")\n",
    "    display(df_curr_label)\n",
    "    display(df_curr_label_count)\n",
    "    \n",
    "    print()\n",
    "print(100 * '-')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2e783a5a-b2df-45aa-8ee4-87e0b0574cd3",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "729132c2-3f3e-4bd9-8b4f-c40d3a4a9e63",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "a841e7e8-322c-405c-9f01-cec0bc5a6b68",
   "metadata": {},
   "source": [
    "## Queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "545d4f55-491c-44bb-b2a5-e8bb11b10ffc",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.displayName</th>\n",
       "      <th>e</th>\n",
       "      <th>m.displayName</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>0</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>1</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>2</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>3</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>TP53 binds the APAF1 gene promoter</td>\n",
       "      <td>4</td>\n",
       "      <td>TP53 stimulates APAF1 gene expression</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>5</td>\n",
       "      <td>Expression of CYCS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>6</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>CYCS binds to APAF1</td>\n",
       "      <td>7</td>\n",
       "      <td>Release of Cytochrome c from mitochondria</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>CYCS binds to APAF1</td>\n",
       "      <td>8</td>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>9</td>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>p38 MAPK phosphorylates PPARGC1A</td>\n",
       "      <td>10</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>p38 MAPK phosphorylates PPARGC1A</td>\n",
       "      <td>11</td>\n",
       "      <td>PPARGC1A [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "      <td>12</td>\n",
       "      <td>p38 MAPK phosphorylates PPARGC1A</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "      <td>13</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Translocation of PMAIP1 (NOXA) to mitochondria</td>\n",
       "      <td>14</td>\n",
       "      <td>PMAIP1 [cytosol]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Translocation of PMAIP1 (NOXA) to mitochondria</td>\n",
       "      <td>15</td>\n",
       "      <td>BH3-only proteins associate with and inactivat...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Translocation of PMAIP1 (NOXA) to mitochondria</td>\n",
       "      <td>16</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>BH3-only proteins associate with and inactivat...</td>\n",
       "      <td>17</td>\n",
       "      <td>Translocation of tBID to mitochondria</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Translocation of tBID to mitochondria</td>\n",
       "      <td>18</td>\n",
       "      <td>Release of Cytochrome c from mitochondria</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Release of Cytochrome c from mitochondria</td>\n",
       "      <td>19</td>\n",
       "      <td>CYCS [mitochondrial intermembrane space]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>E2F1:(TFDP1,TFDP2) [nucleoplasm]</td>\n",
       "      <td>20</td>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>CYCS gene:NRF1:PPARGC1B [nucleoplasm]</td>\n",
       "      <td>21</td>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>CYCS gene:NRF1:PPARGC1B [nucleoplasm]</td>\n",
       "      <td>22</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>RORA:Coactivator [nucleoplasm]</td>\n",
       "      <td>23</td>\n",
       "      <td>EP300 [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>24</td>\n",
       "      <td>p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>25</td>\n",
       "      <td>Positive gene expression regulation by 'p-S15,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>26</td>\n",
       "      <td>TP53 binds the APAF1 gene promoter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>27</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>28</td>\n",
       "      <td>Positive gene expression regulation by 'p-S15,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>E2F1:TFDP1,TFDP2 [nucleoplasm]</td>\n",
       "      <td>29</td>\n",
       "      <td>E2F1 [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>E2F1:TFDP1,TFDP2 [nucleoplasm]</td>\n",
       "      <td>30</td>\n",
       "      <td>E2F1 binds PMAIP1 (NOXA) promoter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "      <td>31</td>\n",
       "      <td>APAF1 [cytosol]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>32</td>\n",
       "      <td>Positive gene expression regulation by 'E2F1:T...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>33</td>\n",
       "      <td>E2F1 binds PMAIP1 (NOXA) promoter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>Expression of CYCS</td>\n",
       "      <td>34</td>\n",
       "      <td>Positive regulation by 'ESRRA [nucleoplasm]'</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>TP53 stimulates APAF1 gene expression</td>\n",
       "      <td>35</td>\n",
       "      <td>APAF1 [cytosol]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>TP53 stimulates APAF1 gene expression</td>\n",
       "      <td>36</td>\n",
       "      <td>CYCS binds to APAF1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>37</td>\n",
       "      <td>Translocation of PMAIP1 (NOXA) to mitochondria</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>38</td>\n",
       "      <td>Positive gene expression regulation by 'p-S15,...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>E2F1 [nucleoplasm]</td>\n",
       "      <td>39</td>\n",
       "      <td>E2F1:(TFDP1,TFDP2) [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>ESRRA [nucleoplasm]</td>\n",
       "      <td>40</td>\n",
       "      <td>ESRRA:PPARGC1A [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>41</td>\n",
       "      <td>Release of Cytochrome c from mitochondria</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>42</td>\n",
       "      <td>APAF1:CYCS [cytosol]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>43</td>\n",
       "      <td>Expression of CYCS</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>EP300 [nucleoplasm]</td>\n",
       "      <td>44</td>\n",
       "      <td>p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>45</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>46</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>47</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>48</td>\n",
       "      <td>E2F1 binds PMAIP1 (NOXA) promoter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>PPARGC1A [nucleoplasm]</td>\n",
       "      <td>49</td>\n",
       "      <td>RORA:Coactivator [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>PPARGC1A [nucleoplasm]</td>\n",
       "      <td>50</td>\n",
       "      <td>ESRRA:PPARGC1A [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>51</td>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>52</td>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>53</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>APAF1 [cytosol]</td>\n",
       "      <td>54</td>\n",
       "      <td>APAF1:CYCS [cytosol]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>55</th>\n",
       "      <td>Positive gene expression regulation by 'E2F1:T...</td>\n",
       "      <td>55</td>\n",
       "      <td>E2F1:TFDP1,TFDP2 [nucleoplasm]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>56</th>\n",
       "      <td>Positive regulation by 'ESRRA [nucleoplasm]'</td>\n",
       "      <td>56</td>\n",
       "      <td>ESRRA [nucleoplasm]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                        n.displayName   e  \\\n",
       "0               TP53 binds the PMAIP1 (NOXA) promoter   0   \n",
       "1               TP53 binds the PMAIP1 (NOXA) promoter   1   \n",
       "2               TP53 binds the PMAIP1 (NOXA) promoter   2   \n",
       "3               TP53 binds the PMAIP1 (NOXA) promoter   3   \n",
       "4                  TP53 binds the APAF1 gene promoter   4   \n",
       "5               NRF1:PPARGC1B binds the CYCS promoter   5   \n",
       "6               NRF1:PPARGC1B binds the CYCS promoter   6   \n",
       "7                                 CYCS binds to APAF1   7   \n",
       "8                                 CYCS binds to APAF1   8   \n",
       "9                      E2F1 binds APAF1 gene promoter   9   \n",
       "10                   p38 MAPK phosphorylates PPARGC1A  10   \n",
       "11                   p38 MAPK phosphorylates PPARGC1A  11   \n",
       "12      NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter  12   \n",
       "13      NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter  13   \n",
       "14     Translocation of PMAIP1 (NOXA) to mitochondria  14   \n",
       "15     Translocation of PMAIP1 (NOXA) to mitochondria  15   \n",
       "16     Translocation of PMAIP1 (NOXA) to mitochondria  16   \n",
       "17  BH3-only proteins associate with and inactivat...  17   \n",
       "18              Translocation of tBID to mitochondria  18   \n",
       "19          Release of Cytochrome c from mitochondria  19   \n",
       "20                   E2F1:(TFDP1,TFDP2) [nucleoplasm]  20   \n",
       "21              CYCS gene:NRF1:PPARGC1B [nucleoplasm]  21   \n",
       "22              CYCS gene:NRF1:PPARGC1B [nucleoplasm]  22   \n",
       "23                     RORA:Coactivator [nucleoplasm]  23   \n",
       "24              p-S15,S20-TP53 Tetramer [nucleoplasm]  24   \n",
       "25              p-S15,S20-TP53 Tetramer [nucleoplasm]  25   \n",
       "26              p-S15,S20-TP53 Tetramer [nucleoplasm]  26   \n",
       "27              p-S15,S20-TP53 Tetramer [nucleoplasm]  27   \n",
       "28  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]  28   \n",
       "29                     E2F1:TFDP1,TFDP2 [nucleoplasm]  29   \n",
       "30                     E2F1:TFDP1,TFDP2 [nucleoplasm]  30   \n",
       "31  APAF1 gene expression is stimulated by E2F1 an...  31   \n",
       "32           Transactivation of PMAIP1 (NOXA) by E2F1  32   \n",
       "33           Transactivation of PMAIP1 (NOXA) by E2F1  33   \n",
       "34                                 Expression of CYCS  34   \n",
       "35              TP53 stimulates APAF1 gene expression  35   \n",
       "36              TP53 stimulates APAF1 gene expression  36   \n",
       "37           TP53 stimulates PMAIP1 (NOXA) expression  37   \n",
       "38           TP53 stimulates PMAIP1 (NOXA) expression  38   \n",
       "39                                 E2F1 [nucleoplasm]  39   \n",
       "40                                ESRRA [nucleoplasm]  40   \n",
       "41                                     CYCS [cytosol]  41   \n",
       "42                                     CYCS [cytosol]  42   \n",
       "43                                     CYCS [cytosol]  43   \n",
       "44                                EP300 [nucleoplasm]  44   \n",
       "45                          PMAIP1 Gene [nucleoplasm]  45   \n",
       "46                          PMAIP1 Gene [nucleoplasm]  46   \n",
       "47                          PMAIP1 Gene [nucleoplasm]  47   \n",
       "48                          PMAIP1 Gene [nucleoplasm]  48   \n",
       "49                             PPARGC1A [nucleoplasm]  49   \n",
       "50                             PPARGC1A [nucleoplasm]  50   \n",
       "51                                 NRF1 [nucleoplasm]  51   \n",
       "52                                 NRF1 [nucleoplasm]  52   \n",
       "53                                 NRF1 [nucleoplasm]  53   \n",
       "54                                    APAF1 [cytosol]  54   \n",
       "55  Positive gene expression regulation by 'E2F1:T...  55   \n",
       "56       Positive regulation by 'ESRRA [nucleoplasm]'  56   \n",
       "\n",
       "                                        m.displayName  \n",
       "0               p-S15,S20-TP53 Tetramer [nucleoplasm]  \n",
       "1                           PMAIP1 Gene [nucleoplasm]  \n",
       "2   p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]  \n",
       "3            TP53 stimulates PMAIP1 (NOXA) expression  \n",
       "4               TP53 stimulates APAF1 gene expression  \n",
       "5                                  Expression of CYCS  \n",
       "6                                  Expression of NRF1  \n",
       "7           Release of Cytochrome c from mitochondria  \n",
       "8                                      CYCS [cytosol]  \n",
       "9   APAF1 gene expression is stimulated by E2F1 an...  \n",
       "10                                 Expression of NRF1  \n",
       "11                             PPARGC1A [nucleoplasm]  \n",
       "12                   p38 MAPK phosphorylates PPARGC1A  \n",
       "13                                 Expression of NRF1  \n",
       "14                                   PMAIP1 [cytosol]  \n",
       "15  BH3-only proteins associate with and inactivat...  \n",
       "16           Transactivation of PMAIP1 (NOXA) by E2F1  \n",
       "17              Translocation of tBID to mitochondria  \n",
       "18          Release of Cytochrome c from mitochondria  \n",
       "19           CYCS [mitochondrial intermembrane space]  \n",
       "20                     E2F1 binds APAF1 gene promoter  \n",
       "21              NRF1:PPARGC1B binds the CYCS promoter  \n",
       "22                                 NRF1 [nucleoplasm]  \n",
       "23                                EP300 [nucleoplasm]  \n",
       "24  p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...  \n",
       "25  Positive gene expression regulation by 'p-S15,...  \n",
       "26                 TP53 binds the APAF1 gene promoter  \n",
       "27  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]  \n",
       "28  Positive gene expression regulation by 'p-S15,...  \n",
       "29                                 E2F1 [nucleoplasm]  \n",
       "30                  E2F1 binds PMAIP1 (NOXA) promoter  \n",
       "31                                    APAF1 [cytosol]  \n",
       "32  Positive gene expression regulation by 'E2F1:T...  \n",
       "33                  E2F1 binds PMAIP1 (NOXA) promoter  \n",
       "34       Positive regulation by 'ESRRA [nucleoplasm]'  \n",
       "35                                    APAF1 [cytosol]  \n",
       "36                                CYCS binds to APAF1  \n",
       "37     Translocation of PMAIP1 (NOXA) to mitochondria  \n",
       "38  Positive gene expression regulation by 'p-S15,...  \n",
       "39                   E2F1:(TFDP1,TFDP2) [nucleoplasm]  \n",
       "40                       ESRRA:PPARGC1A [nucleoplasm]  \n",
       "41          Release of Cytochrome c from mitochondria  \n",
       "42                               APAF1:CYCS [cytosol]  \n",
       "43                                 Expression of CYCS  \n",
       "44  p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...  \n",
       "45  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]  \n",
       "46           TP53 stimulates PMAIP1 (NOXA) expression  \n",
       "47           Transactivation of PMAIP1 (NOXA) by E2F1  \n",
       "48                  E2F1 binds PMAIP1 (NOXA) promoter  \n",
       "49                     RORA:Coactivator [nucleoplasm]  \n",
       "50                       ESRRA:PPARGC1A [nucleoplasm]  \n",
       "51      NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter  \n",
       "52              NRF1:PPARGC1B binds the CYCS promoter  \n",
       "53                                 Expression of NRF1  \n",
       "54                               APAF1:CYCS [cytosol]  \n",
       "55                     E2F1:TFDP1,TFDP2 [nucleoplasm]  \n",
       "56                                ESRRA [nucleoplasm]  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.81 ms, sys: 46 μs, total: 3.85 ms\n",
      "Wall time: 3.72 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Match all edges and return them\n",
    "command = \"\"\"\n",
    "MATCH (n)-[e]->(m)\n",
    "RETURN n.displayName, e, m.displayName\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "98cb9c13-cc87-4b00-9b34-9c0c4ece6c7f",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.displayName</th>\n",
       "      <th>n.schemaClass</th>\n",
       "      <th>n.referenceType</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>E2F1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>ESRRA [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>EP300 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>PPARGC1A [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>CYCS [mitochondrial intermembrane space]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>PMAIP1 [cytosol]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>APAF1 [cytosol]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>ReferenceGeneProduct</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                              n.displayName                  n.schemaClass  \\\n",
       "0                        E2F1 [nucleoplasm]  EntityWithAccessionedSequence   \n",
       "1                       ESRRA [nucleoplasm]  EntityWithAccessionedSequence   \n",
       "2                            CYCS [cytosol]  EntityWithAccessionedSequence   \n",
       "3                       EP300 [nucleoplasm]  EntityWithAccessionedSequence   \n",
       "4                    PPARGC1A [nucleoplasm]  EntityWithAccessionedSequence   \n",
       "5                        NRF1 [nucleoplasm]  EntityWithAccessionedSequence   \n",
       "6  CYCS [mitochondrial intermembrane space]  EntityWithAccessionedSequence   \n",
       "7                          PMAIP1 [cytosol]  EntityWithAccessionedSequence   \n",
       "8                           APAF1 [cytosol]  EntityWithAccessionedSequence   \n",
       "\n",
       "        n.referenceType  \n",
       "0  ReferenceGeneProduct  \n",
       "1  ReferenceGeneProduct  \n",
       "2  ReferenceGeneProduct  \n",
       "3  ReferenceGeneProduct  \n",
       "4  ReferenceGeneProduct  \n",
       "5  ReferenceGeneProduct  \n",
       "6  ReferenceGeneProduct  \n",
       "7  ReferenceGeneProduct  \n",
       "8  ReferenceGeneProduct  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.99 ms, sys: 0 ns, total: 2.99 ms\n",
      "Wall time: 2.84 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all nodes of type \"EntityWithAccessionedSequence\" and referenceType \"ReferenceGeneProduct\"\n",
    "command = \"\"\"\n",
    "MATCH (n:EntityWithAccessionedSequence)\n",
    "WHERE n.referenceType = \"ReferenceGeneProduct\"\n",
    "RETURN n.displayName, n.schemaClass, n.referenceType\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "93d7b3c1-6590-4c4b-89de-bf4871fb7c21",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>count</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>n.schemaClass</th>\n",
       "      <th></th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>Reaction</th>\n",
       "      <td>12</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>EntityWithAccessionedSequence</th>\n",
       "      <td>10</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>Complex</th>\n",
       "      <td>9</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>BlackBoxEvent</th>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>PositiveGeneExpressionRegulation</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>PositiveRegulation</th>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                  count\n",
       "n.schemaClass                          \n",
       "Reaction                             12\n",
       "EntityWithAccessionedSequence        10\n",
       "Complex                               9\n",
       "BlackBoxEvent                         6\n",
       "PositiveGeneExpressionRegulation      2\n",
       "PositiveRegulation                    1"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 3.42 ms, sys: 24 μs, total: 3.44 ms\n",
      "Wall time: 3.28 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Count nodes of each schemaClass\n",
    "command = \"\"\"\n",
    "MATCH (n)\n",
    "RETURN n.schemaClass\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(pd.DataFrame(df.value_counts()))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "269f2d79-80f2-48ea-8545-b9336a70ed19",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n</th>\n",
       "      <th>n.displayName</th>\n",
       "      <th>n.schemaClass</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>37</td>\n",
       "      <td>Positive gene expression regulation by 'p-S15,...</td>\n",
       "      <td>PositiveGeneExpressionRegulation</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>38</td>\n",
       "      <td>Positive gene expression regulation by 'E2F1:T...</td>\n",
       "      <td>PositiveGeneExpressionRegulation</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    n                                      n.displayName  \\\n",
       "0  37  Positive gene expression regulation by 'p-S15,...   \n",
       "1  38  Positive gene expression regulation by 'E2F1:T...   \n",
       "\n",
       "                      n.schemaClass  \n",
       "0  PositiveGeneExpressionRegulation  \n",
       "1  PositiveGeneExpressionRegulation  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 2.81 ms, sys: 48 μs, total: 2.86 ms\n",
      "Wall time: 2.64 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all nodes of type \"PositiveGeneExpressionRegulation\" (which is also schemaClass)\n",
    "command = \"\"\"\n",
    "MATCH (n:PositiveGeneExpressionRegulation)\n",
    "RETURN n, n.displayName, n.schemaClass\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "id": "ccf2f274-d43b-4dc5-b348-dd9269417dfb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 1.47 ms, sys: 28 μs, total: 1.49 ms\n",
      "Wall time: 1.45 ms\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.displayName</th>\n",
       "      <th>n.schemaClass</th>\n",
       "      <th>e</th>\n",
       "      <th>m.displayName</th>\n",
       "      <th>m.schemaClass</th>\n",
       "      <th>m.category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>E2F1:(TFDP1,TFDP2) [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>20</td>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>E2F1:(TFDP1,TFDP2) [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>39</td>\n",
       "      <td>E2F1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>APAF1:CYCS [cytosol]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>42</td>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>APAF1:CYCS [cytosol]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>54</td>\n",
       "      <td>APAF1 [cytosol]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>CYCS gene:NRF1:PPARGC1B [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>21</td>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>CYCS gene:NRF1:PPARGC1B [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>22</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>RORA:Coactivator [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>23</td>\n",
       "      <td>EP300 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>RORA:Coactivator [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>49</td>\n",
       "      <td>PPARGC1A [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...</td>\n",
       "      <td>Complex</td>\n",
       "      <td>44</td>\n",
       "      <td>EP300 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...</td>\n",
       "      <td>Complex</td>\n",
       "      <td>24</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>ESRRA:PPARGC1A [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>40</td>\n",
       "      <td>ESRRA [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>ESRRA:PPARGC1A [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>50</td>\n",
       "      <td>PPARGC1A [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>24</td>\n",
       "      <td>p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...</td>\n",
       "      <td>Complex</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>25</td>\n",
       "      <td>Positive gene expression regulation by 'p-S15,...</td>\n",
       "      <td>PositiveGeneExpressionRegulation</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>26</td>\n",
       "      <td>TP53 binds the APAF1 gene promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>27</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>0</td>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>28</td>\n",
       "      <td>Positive gene expression regulation by 'p-S15,...</td>\n",
       "      <td>PositiveGeneExpressionRegulation</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>2</td>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>27</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>45</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>E2F1:TFDP1,TFDP2 [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>29</td>\n",
       "      <td>E2F1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>E2F1:TFDP1,TFDP2 [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>30</td>\n",
       "      <td>E2F1 binds PMAIP1 (NOXA) promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>E2F1:TFDP1,TFDP2 [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>55</td>\n",
       "      <td>Positive gene expression regulation by 'E2F1:T...</td>\n",
       "      <td>PositiveGeneExpressionRegulation</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                        n.displayName n.schemaClass   e  \\\n",
       "0                    E2F1:(TFDP1,TFDP2) [nucleoplasm]       Complex  20   \n",
       "1                    E2F1:(TFDP1,TFDP2) [nucleoplasm]       Complex  39   \n",
       "2                                APAF1:CYCS [cytosol]       Complex  42   \n",
       "3                                APAF1:CYCS [cytosol]       Complex  54   \n",
       "4               CYCS gene:NRF1:PPARGC1B [nucleoplasm]       Complex  21   \n",
       "5               CYCS gene:NRF1:PPARGC1B [nucleoplasm]       Complex  22   \n",
       "6                      RORA:Coactivator [nucleoplasm]       Complex  23   \n",
       "7                      RORA:Coactivator [nucleoplasm]       Complex  49   \n",
       "8   p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...       Complex  44   \n",
       "9   p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...       Complex  24   \n",
       "10                       ESRRA:PPARGC1A [nucleoplasm]       Complex  40   \n",
       "11                       ESRRA:PPARGC1A [nucleoplasm]       Complex  50   \n",
       "12              p-S15,S20-TP53 Tetramer [nucleoplasm]       Complex  24   \n",
       "13              p-S15,S20-TP53 Tetramer [nucleoplasm]       Complex  25   \n",
       "14              p-S15,S20-TP53 Tetramer [nucleoplasm]       Complex  26   \n",
       "15              p-S15,S20-TP53 Tetramer [nucleoplasm]       Complex  27   \n",
       "16              p-S15,S20-TP53 Tetramer [nucleoplasm]       Complex   0   \n",
       "17  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]       Complex  28   \n",
       "18  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]       Complex   2   \n",
       "19  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]       Complex  27   \n",
       "20  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]       Complex  45   \n",
       "21                     E2F1:TFDP1,TFDP2 [nucleoplasm]       Complex  29   \n",
       "22                     E2F1:TFDP1,TFDP2 [nucleoplasm]       Complex  30   \n",
       "23                     E2F1:TFDP1,TFDP2 [nucleoplasm]       Complex  55   \n",
       "\n",
       "                                        m.displayName  \\\n",
       "0                      E2F1 binds APAF1 gene promoter   \n",
       "1                                  E2F1 [nucleoplasm]   \n",
       "2                                      CYCS [cytosol]   \n",
       "3                                     APAF1 [cytosol]   \n",
       "4               NRF1:PPARGC1B binds the CYCS promoter   \n",
       "5                                  NRF1 [nucleoplasm]   \n",
       "6                                 EP300 [nucleoplasm]   \n",
       "7                              PPARGC1A [nucleoplasm]   \n",
       "8                                 EP300 [nucleoplasm]   \n",
       "9               p-S15,S20-TP53 Tetramer [nucleoplasm]   \n",
       "10                                ESRRA [nucleoplasm]   \n",
       "11                             PPARGC1A [nucleoplasm]   \n",
       "12  p-S15,S20-TP53:EP300:PRMT1:CARM1:GADD45A Gene ...   \n",
       "13  Positive gene expression regulation by 'p-S15,...   \n",
       "14                 TP53 binds the APAF1 gene promoter   \n",
       "15  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]   \n",
       "16              TP53 binds the PMAIP1 (NOXA) promoter   \n",
       "17  Positive gene expression regulation by 'p-S15,...   \n",
       "18              TP53 binds the PMAIP1 (NOXA) promoter   \n",
       "19              p-S15,S20-TP53 Tetramer [nucleoplasm]   \n",
       "20                          PMAIP1 Gene [nucleoplasm]   \n",
       "21                                 E2F1 [nucleoplasm]   \n",
       "22                  E2F1 binds PMAIP1 (NOXA) promoter   \n",
       "23  Positive gene expression regulation by 'E2F1:T...   \n",
       "\n",
       "                       m.schemaClass m.category  \n",
       "0                           Reaction    binding  \n",
       "1      EntityWithAccessionedSequence       <NA>  \n",
       "2      EntityWithAccessionedSequence       <NA>  \n",
       "3      EntityWithAccessionedSequence       <NA>  \n",
       "4                           Reaction    binding  \n",
       "5      EntityWithAccessionedSequence       <NA>  \n",
       "6      EntityWithAccessionedSequence       <NA>  \n",
       "7      EntityWithAccessionedSequence       <NA>  \n",
       "8      EntityWithAccessionedSequence       <NA>  \n",
       "9                            Complex       <NA>  \n",
       "10     EntityWithAccessionedSequence       <NA>  \n",
       "11     EntityWithAccessionedSequence       <NA>  \n",
       "12                           Complex       <NA>  \n",
       "13  PositiveGeneExpressionRegulation       <NA>  \n",
       "14                          Reaction    binding  \n",
       "15                           Complex       <NA>  \n",
       "16                          Reaction    binding  \n",
       "17  PositiveGeneExpressionRegulation       <NA>  \n",
       "18                          Reaction    binding  \n",
       "19                           Complex       <NA>  \n",
       "20     EntityWithAccessionedSequence       <NA>  \n",
       "21     EntityWithAccessionedSequence       <NA>  \n",
       "22                          Reaction    binding  \n",
       "23  PositiveGeneExpressionRegulation       <NA>  "
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all edges involving a node of type Complex (undirected edge get both directions of directed edges)\n",
    "command = \"\"\"\n",
    "MATCH (n:Complex)-[e]-(m)\n",
    "RETURN n.displayName, n.schemaClass, e, m.displayName, m.schemaClass, m.category\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "\n",
    "df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c436ed7d-5f24-4acd-a285-01818e3b4d7d",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "923fbf83-e3d6-408b-9d3f-4c5256da8fca",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>n.displayName</th>\n",
       "      <th>n.schemaClass</th>\n",
       "      <th>n.category</th>\n",
       "      <th>e</th>\n",
       "      <th>m.displayName</th>\n",
       "      <th>m.schemaClass</th>\n",
       "      <th>m.category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>0</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>1</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>2</td>\n",
       "      <td>p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>TP53 binds the PMAIP1 (NOXA) promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>3</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>TP53 binds the APAF1 gene promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>4</td>\n",
       "      <td>TP53 stimulates APAF1 gene expression</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>5</td>\n",
       "      <td>Expression of CYCS</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>6</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>CYCS binds to APAF1</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>7</td>\n",
       "      <td>Release of Cytochrome c from mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>transition</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>CYCS binds to APAF1</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>8</td>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>9</td>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>12</td>\n",
       "      <td>p38 MAPK phosphorylates PPARGC1A</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>transition</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>13</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>BH3-only proteins associate with and inactivat...</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>17</td>\n",
       "      <td>Translocation of tBID to mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>transition</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                        n.displayName n.schemaClass  \\\n",
       "0               TP53 binds the PMAIP1 (NOXA) promoter      Reaction   \n",
       "1               TP53 binds the PMAIP1 (NOXA) promoter      Reaction   \n",
       "2               TP53 binds the PMAIP1 (NOXA) promoter      Reaction   \n",
       "3               TP53 binds the PMAIP1 (NOXA) promoter      Reaction   \n",
       "4                  TP53 binds the APAF1 gene promoter      Reaction   \n",
       "5               NRF1:PPARGC1B binds the CYCS promoter      Reaction   \n",
       "6               NRF1:PPARGC1B binds the CYCS promoter      Reaction   \n",
       "7                                 CYCS binds to APAF1      Reaction   \n",
       "8                                 CYCS binds to APAF1      Reaction   \n",
       "9                      E2F1 binds APAF1 gene promoter      Reaction   \n",
       "10      NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter      Reaction   \n",
       "11      NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter      Reaction   \n",
       "12  BH3-only proteins associate with and inactivat...      Reaction   \n",
       "\n",
       "   n.category   e                                      m.displayName  \\\n",
       "0     binding   0              p-S15,S20-TP53 Tetramer [nucleoplasm]   \n",
       "1     binding   1                          PMAIP1 Gene [nucleoplasm]   \n",
       "2     binding   2  p-S15,S20-TP53 Tetramer:PMAIP1 Gene [nucleoplasm]   \n",
       "3     binding   3           TP53 stimulates PMAIP1 (NOXA) expression   \n",
       "4     binding   4              TP53 stimulates APAF1 gene expression   \n",
       "5     binding   5                                 Expression of CYCS   \n",
       "6     binding   6                                 Expression of NRF1   \n",
       "7     binding   7          Release of Cytochrome c from mitochondria   \n",
       "8     binding   8                                     CYCS [cytosol]   \n",
       "9     binding   9  APAF1 gene expression is stimulated by E2F1 an...   \n",
       "10    binding  12                   p38 MAPK phosphorylates PPARGC1A   \n",
       "11    binding  13                                 Expression of NRF1   \n",
       "12    binding  17              Translocation of tBID to mitochondria   \n",
       "\n",
       "                    m.schemaClass  m.category  \n",
       "0                         Complex        <NA>  \n",
       "1   EntityWithAccessionedSequence        <NA>  \n",
       "2                         Complex        <NA>  \n",
       "3                   BlackBoxEvent     omitted  \n",
       "4                   BlackBoxEvent     omitted  \n",
       "5                   BlackBoxEvent     omitted  \n",
       "6                   BlackBoxEvent     omitted  \n",
       "7                        Reaction  transition  \n",
       "8   EntityWithAccessionedSequence        <NA>  \n",
       "9                   BlackBoxEvent     omitted  \n",
       "10                       Reaction  transition  \n",
       "11                  BlackBoxEvent     omitted  \n",
       "12                       Reaction  transition  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 4.34 ms, sys: 0 ns, total: 4.34 ms\n",
      "Wall time: 4.26 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all edges with a node of category \"binding\" going to an other node\n",
    "command = \"\"\"\n",
    "MATCH (n)-[e]->(m)\n",
    "WHERE n.category = \"binding\"\n",
    "RETURN n.displayName, n.schemaClass, n.category, e, m.displayName, m.schemaClass, m.category\n",
    "\"\"\"\n",
    "df = client.query(command)\n",
    "if df.empty:\n",
    "    print(\"No result found\")\n",
    "else:\n",
    "    display(df)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "17c6974d-d78a-492c-9de8-cf70f2114920",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "84ca381e-5161-4059-b786-d57ec1b913b3",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "b95777b3-5825-440c-81ce-50d480b47535",
   "metadata": {},
   "source": [
    "## Complex queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "e70391cc-1016-4a58-892f-ca19a738d343",
   "metadata": {},
   "outputs": [],
   "source": [
    "def build_query_chain(\n",
    "    hop_count: int,\n",
    "    start_node_label: str = None,\n",
    "    start_node_property: str = None,\n",
    "    start_node_value: str = None,\n",
    "    end_node_label: str = None,\n",
    "    end_node_property: str = None,\n",
    "    end_node_value: str = None,\n",
    "    edge_type: str = None,\n",
    "    intermediate_node_label: str = None,\n",
    "    return_properties: list = None,\n",
    ") -> tuple[str, list[str]]:\n",
    "    \"\"\"\n",
    "    Build a general query to find chains between nodes.\n",
    "\n",
    "    Parameters:\n",
    "    -----------\n",
    "    hop_count : int\n",
    "        Number of hops/edges in the path (REQUIRED)\n",
    "    start_node_label : str, optional\n",
    "        Label of the starting node (e.g., 'Process', 'Station')\n",
    "    start_node_property : str, optional\n",
    "        Property name to match on start node (e.g., 'displayName', 'id')\n",
    "    start_node_value : str, optional\n",
    "        Value to match for start node\n",
    "    end_node_label : str, optional\n",
    "        Label of the ending node (None for any node)\n",
    "    end_node_property : str, optional\n",
    "        Property name to match on end node\n",
    "    end_node_value : str, optional\n",
    "        Value to match for end node\n",
    "    edge_type : str, optional\n",
    "        Type of edges to traverse (None for any edge type)\n",
    "    intermediate_node_label : str, optional\n",
    "        Label constraint for intermediate nodes (None for any label)\n",
    "    return_properties : list, optional\n",
    "        List of property names to return for nodes (default: ['displayName'])\n",
    "\n",
    "    Returns:\n",
    "    --------\n",
    "    tuple : (query_string, column_names)\n",
    "    \"\"\"\n",
    "\n",
    "    if return_properties is None:\n",
    "        return_properties = [\"displayName\"]\n",
    "\n",
    "    # Build MATCH clause\n",
    "    query = \"MATCH \"\n",
    "\n",
    "    # Start node - build based on what's provided\n",
    "    start_parts = []\n",
    "    if start_node_label:\n",
    "        start_parts.append(f\":{start_node_label}\")\n",
    "    if start_node_property and start_node_value:\n",
    "        start_parts.append(f'{{{start_node_property}:\"{start_node_value}\"}}')\n",
    "\n",
    "    if start_parts:\n",
    "        query += f\"(first{''.join(start_parts)})\"\n",
    "    else:\n",
    "        query += \"(first)\"\n",
    "\n",
    "    # Intermediate nodes and edges\n",
    "    for k in range(1, hop_count + 1):\n",
    "        # Edge\n",
    "        if edge_type:\n",
    "            query += f\"-[e{k}:{edge_type}]->\"\n",
    "        else:\n",
    "            query += f\"-[e{k}]->\"\n",
    "\n",
    "        # Last hop - end node\n",
    "        if k == hop_count:\n",
    "            end_parts = []\n",
    "            if end_node_label:\n",
    "                end_parts.append(f\":{end_node_label}\")\n",
    "            if end_node_property and end_node_value:\n",
    "                end_parts.append(f'{{{end_node_property}:\"{end_node_value}\"}}')\n",
    "\n",
    "            if end_parts:\n",
    "                query += f\"(last{''.join(end_parts)})\"\n",
    "            else:\n",
    "                query += \"(last)\"\n",
    "        # Intermediate nodes\n",
    "        else:\n",
    "            if intermediate_node_label:\n",
    "                query += f\"(n{k}:{intermediate_node_label})\"\n",
    "            else:\n",
    "                query += f\"(n{k})\"\n",
    "\n",
    "    # Build RETURN clause\n",
    "    query += \" RETURN first\"\n",
    "    column_names = [\"first\"]\n",
    "\n",
    "    # Add start node properties\n",
    "    for prop in return_properties:\n",
    "        query += f\", first.{prop}\"\n",
    "        column_names.append(f\"first.{prop}\")\n",
    "\n",
    "    # Add intermediate nodes/edges\n",
    "    for k in range(1, hop_count + 1):\n",
    "        query += f\", e{k}\"\n",
    "        column_names.append(f\"e{k}\")\n",
    "\n",
    "        if k == hop_count:\n",
    "            query += \", last\"\n",
    "            column_names.append(\"last\")\n",
    "            for prop in return_properties:\n",
    "                query += f\", last.{prop}\"\n",
    "                column_names.append(f\"last.{prop}\")\n",
    "        else:\n",
    "            query += f\", n{k}\"\n",
    "            column_names.append(f\"n{k}\")\n",
    "            for prop in return_properties:\n",
    "                query += f\", n{k}.{prop}\"\n",
    "                column_names.append(f\"n{k}.{prop}\")\n",
    "\n",
    "    return query, column_names"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "42ad8aa8-94d1-43d0-907c-15d4d35569c7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "****************************************************************************************************\n",
      "1 hop(s) :\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>first</th>\n",
       "      <th>first.id</th>\n",
       "      <th>first.displayName</th>\n",
       "      <th>first.schemaClass</th>\n",
       "      <th>first.category</th>\n",
       "      <th>e1</th>\n",
       "      <th>last</th>\n",
       "      <th>last.id</th>\n",
       "      <th>last.displayName</th>\n",
       "      <th>last.schemaClass</th>\n",
       "      <th>last.category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>29</td>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>CYCS [cytosol]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>43</td>\n",
       "      <td>23</td>\n",
       "      <td>Expression of CYCS</td>\n",
       "      <td>Expression of CYCS</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>31</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>46</td>\n",
       "      <td>26</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>31</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>47</td>\n",
       "      <td>22</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>33</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>53</td>\n",
       "      <td>24</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   first                   first.id          first.displayName  \\\n",
       "0     29             CYCS [cytosol]             CYCS [cytosol]   \n",
       "1     31  PMAIP1 Gene [nucleoplasm]  PMAIP1 Gene [nucleoplasm]   \n",
       "2     31  PMAIP1 Gene [nucleoplasm]  PMAIP1 Gene [nucleoplasm]   \n",
       "3     33         NRF1 [nucleoplasm]         NRF1 [nucleoplasm]   \n",
       "\n",
       "               first.schemaClass first.category  e1  last  \\\n",
       "0  EntityWithAccessionedSequence           <NA>  43    23   \n",
       "1  EntityWithAccessionedSequence           <NA>  46    26   \n",
       "2  EntityWithAccessionedSequence           <NA>  47    22   \n",
       "3  EntityWithAccessionedSequence           <NA>  53    24   \n",
       "\n",
       "                                    last.id  \\\n",
       "0                        Expression of CYCS   \n",
       "1  TP53 stimulates PMAIP1 (NOXA) expression   \n",
       "2  Transactivation of PMAIP1 (NOXA) by E2F1   \n",
       "3                        Expression of NRF1   \n",
       "\n",
       "                           last.displayName last.schemaClass last.category  \n",
       "0                        Expression of CYCS    BlackBoxEvent       omitted  \n",
       "1  TP53 stimulates PMAIP1 (NOXA) expression    BlackBoxEvent       omitted  \n",
       "2  Transactivation of PMAIP1 (NOXA) by E2F1    BlackBoxEvent       omitted  \n",
       "3                        Expression of NRF1    BlackBoxEvent       omitted  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "****************************************************************************************************\n",
      "2 hop(s) :\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>first</th>\n",
       "      <th>first.id</th>\n",
       "      <th>first.displayName</th>\n",
       "      <th>first.schemaClass</th>\n",
       "      <th>first.category</th>\n",
       "      <th>e1</th>\n",
       "      <th>n1</th>\n",
       "      <th>n1.id</th>\n",
       "      <th>n1.displayName</th>\n",
       "      <th>n1.schemaClass</th>\n",
       "      <th>n1.category</th>\n",
       "      <th>e2</th>\n",
       "      <th>last</th>\n",
       "      <th>last.id</th>\n",
       "      <th>last.displayName</th>\n",
       "      <th>last.schemaClass</th>\n",
       "      <th>last.category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>33</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>51</td>\n",
       "      <td>6</td>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>13</td>\n",
       "      <td>24</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>33</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>52</td>\n",
       "      <td>2</td>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>5</td>\n",
       "      <td>23</td>\n",
       "      <td>Expression of CYCS</td>\n",
       "      <td>Expression of CYCS</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>33</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>52</td>\n",
       "      <td>2</td>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>NRF1:PPARGC1B binds the CYCS promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>6</td>\n",
       "      <td>24</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   first            first.id   first.displayName  \\\n",
       "0     33  NRF1 [nucleoplasm]  NRF1 [nucleoplasm]   \n",
       "1     33  NRF1 [nucleoplasm]  NRF1 [nucleoplasm]   \n",
       "2     33  NRF1 [nucleoplasm]  NRF1 [nucleoplasm]   \n",
       "\n",
       "               first.schemaClass first.category  e1  n1  \\\n",
       "0  EntityWithAccessionedSequence           <NA>  51   6   \n",
       "1  EntityWithAccessionedSequence           <NA>  52   2   \n",
       "2  EntityWithAccessionedSequence           <NA>  52   2   \n",
       "\n",
       "                                           n1.id  \\\n",
       "0  NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter   \n",
       "1          NRF1:PPARGC1B binds the CYCS promoter   \n",
       "2          NRF1:PPARGC1B binds the CYCS promoter   \n",
       "\n",
       "                                  n1.displayName n1.schemaClass n1.category  \\\n",
       "0  NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter       Reaction     binding   \n",
       "1          NRF1:PPARGC1B binds the CYCS promoter       Reaction     binding   \n",
       "2          NRF1:PPARGC1B binds the CYCS promoter       Reaction     binding   \n",
       "\n",
       "   e2  last             last.id    last.displayName last.schemaClass  \\\n",
       "0  13    24  Expression of NRF1  Expression of NRF1    BlackBoxEvent   \n",
       "1   5    23  Expression of CYCS  Expression of CYCS    BlackBoxEvent   \n",
       "2   6    24  Expression of NRF1  Expression of NRF1    BlackBoxEvent   \n",
       "\n",
       "  last.category  \n",
       "0       omitted  \n",
       "1       omitted  \n",
       "2       omitted  "
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "****************************************************************************************************\n",
      "3 hop(s) :\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>first</th>\n",
       "      <th>first.id</th>\n",
       "      <th>first.displayName</th>\n",
       "      <th>first.schemaClass</th>\n",
       "      <th>first.category</th>\n",
       "      <th>e1</th>\n",
       "      <th>n1</th>\n",
       "      <th>n1.id</th>\n",
       "      <th>n1.displayName</th>\n",
       "      <th>n1.schemaClass</th>\n",
       "      <th>...</th>\n",
       "      <th>n2.id</th>\n",
       "      <th>n2.displayName</th>\n",
       "      <th>n2.schemaClass</th>\n",
       "      <th>n2.category</th>\n",
       "      <th>e3</th>\n",
       "      <th>last</th>\n",
       "      <th>last.id</th>\n",
       "      <th>last.displayName</th>\n",
       "      <th>last.schemaClass</th>\n",
       "      <th>last.category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>27</td>\n",
       "      <td>E2F1 [nucleoplasm]</td>\n",
       "      <td>E2F1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>39</td>\n",
       "      <td>12</td>\n",
       "      <td>E2F1:(TFDP1,TFDP2) [nucleoplasm]</td>\n",
       "      <td>E2F1:(TFDP1,TFDP2) [nucleoplasm]</td>\n",
       "      <td>Complex</td>\n",
       "      <td>...</td>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>9</td>\n",
       "      <td>21</td>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>31</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>46</td>\n",
       "      <td>26</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>...</td>\n",
       "      <td>Translocation of PMAIP1 (NOXA) to mitochondria</td>\n",
       "      <td>Translocation of PMAIP1 (NOXA) to mitochondria</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>transition</td>\n",
       "      <td>16</td>\n",
       "      <td>22</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>33</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>NRF1 [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>51</td>\n",
       "      <td>6</td>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "      <td>NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>...</td>\n",
       "      <td>p38 MAPK phosphorylates PPARGC1A</td>\n",
       "      <td>p38 MAPK phosphorylates PPARGC1A</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>transition</td>\n",
       "      <td>10</td>\n",
       "      <td>24</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>Expression of NRF1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>3 rows × 23 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   first                   first.id          first.displayName  \\\n",
       "0     27         E2F1 [nucleoplasm]         E2F1 [nucleoplasm]   \n",
       "1     31  PMAIP1 Gene [nucleoplasm]  PMAIP1 Gene [nucleoplasm]   \n",
       "2     33         NRF1 [nucleoplasm]         NRF1 [nucleoplasm]   \n",
       "\n",
       "               first.schemaClass first.category  e1  n1  \\\n",
       "0  EntityWithAccessionedSequence           <NA>  39  12   \n",
       "1  EntityWithAccessionedSequence           <NA>  46  26   \n",
       "2  EntityWithAccessionedSequence           <NA>  51   6   \n",
       "\n",
       "                                           n1.id  \\\n",
       "0               E2F1:(TFDP1,TFDP2) [nucleoplasm]   \n",
       "1       TP53 stimulates PMAIP1 (NOXA) expression   \n",
       "2  NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter   \n",
       "\n",
       "                                  n1.displayName n1.schemaClass  ...  \\\n",
       "0               E2F1:(TFDP1,TFDP2) [nucleoplasm]        Complex  ...   \n",
       "1       TP53 stimulates PMAIP1 (NOXA) expression  BlackBoxEvent  ...   \n",
       "2  NRF1:p-PPARGC1A, NRF2 bind the TFB2M promoter       Reaction  ...   \n",
       "\n",
       "                                            n2.id  \\\n",
       "0                  E2F1 binds APAF1 gene promoter   \n",
       "1  Translocation of PMAIP1 (NOXA) to mitochondria   \n",
       "2                p38 MAPK phosphorylates PPARGC1A   \n",
       "\n",
       "                                   n2.displayName  n2.schemaClass n2.category  \\\n",
       "0                  E2F1 binds APAF1 gene promoter        Reaction     binding   \n",
       "1  Translocation of PMAIP1 (NOXA) to mitochondria        Reaction  transition   \n",
       "2                p38 MAPK phosphorylates PPARGC1A        Reaction  transition   \n",
       "\n",
       "   e3 last                                            last.id  \\\n",
       "0   9   21  APAF1 gene expression is stimulated by E2F1 an...   \n",
       "1  16   22           Transactivation of PMAIP1 (NOXA) by E2F1   \n",
       "2  10   24                                 Expression of NRF1   \n",
       "\n",
       "                                    last.displayName  last.schemaClass  \\\n",
       "0  APAF1 gene expression is stimulated by E2F1 an...     BlackBoxEvent   \n",
       "1           Transactivation of PMAIP1 (NOXA) by E2F1     BlackBoxEvent   \n",
       "2                                 Expression of NRF1     BlackBoxEvent   \n",
       "\n",
       "  last.category  \n",
       "0       omitted  \n",
       "1       omitted  \n",
       "2       omitted  \n",
       "\n",
       "[3 rows x 23 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "****************************************************************************************************\n",
      "4 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "5 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "6 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "7 hop(s) :\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>first</th>\n",
       "      <th>first.id</th>\n",
       "      <th>first.displayName</th>\n",
       "      <th>first.schemaClass</th>\n",
       "      <th>first.category</th>\n",
       "      <th>e1</th>\n",
       "      <th>n1</th>\n",
       "      <th>n1.id</th>\n",
       "      <th>n1.displayName</th>\n",
       "      <th>n1.schemaClass</th>\n",
       "      <th>...</th>\n",
       "      <th>n6.id</th>\n",
       "      <th>n6.displayName</th>\n",
       "      <th>n6.schemaClass</th>\n",
       "      <th>n6.category</th>\n",
       "      <th>e7</th>\n",
       "      <th>last</th>\n",
       "      <th>last.id</th>\n",
       "      <th>last.displayName</th>\n",
       "      <th>last.schemaClass</th>\n",
       "      <th>last.category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>31</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>47</td>\n",
       "      <td>22</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>Transactivation of PMAIP1 (NOXA) by E2F1</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>...</td>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>9</td>\n",
       "      <td>21</td>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1 rows × 47 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   first                   first.id          first.displayName  \\\n",
       "0     31  PMAIP1 Gene [nucleoplasm]  PMAIP1 Gene [nucleoplasm]   \n",
       "\n",
       "               first.schemaClass first.category  e1  n1  \\\n",
       "0  EntityWithAccessionedSequence           <NA>  47  22   \n",
       "\n",
       "                                      n1.id  \\\n",
       "0  Transactivation of PMAIP1 (NOXA) by E2F1   \n",
       "\n",
       "                             n1.displayName n1.schemaClass  ...  \\\n",
       "0  Transactivation of PMAIP1 (NOXA) by E2F1  BlackBoxEvent  ...   \n",
       "\n",
       "                            n6.id                  n6.displayName  \\\n",
       "0  E2F1 binds APAF1 gene promoter  E2F1 binds APAF1 gene promoter   \n",
       "\n",
       "   n6.schemaClass n6.category e7 last  \\\n",
       "0        Reaction     binding  9   21   \n",
       "\n",
       "                                             last.id  \\\n",
       "0  APAF1 gene expression is stimulated by E2F1 an...   \n",
       "\n",
       "                                    last.displayName  last.schemaClass  \\\n",
       "0  APAF1 gene expression is stimulated by E2F1 an...     BlackBoxEvent   \n",
       "\n",
       "  last.category  \n",
       "0       omitted  \n",
       "\n",
       "[1 rows x 47 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "****************************************************************************************************\n",
      "8 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "9 hop(s) :\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>first</th>\n",
       "      <th>first.id</th>\n",
       "      <th>first.displayName</th>\n",
       "      <th>first.schemaClass</th>\n",
       "      <th>first.category</th>\n",
       "      <th>e1</th>\n",
       "      <th>n1</th>\n",
       "      <th>n1.id</th>\n",
       "      <th>n1.displayName</th>\n",
       "      <th>n1.schemaClass</th>\n",
       "      <th>...</th>\n",
       "      <th>n8.id</th>\n",
       "      <th>n8.displayName</th>\n",
       "      <th>n8.schemaClass</th>\n",
       "      <th>n8.category</th>\n",
       "      <th>e9</th>\n",
       "      <th>last</th>\n",
       "      <th>last.id</th>\n",
       "      <th>last.displayName</th>\n",
       "      <th>last.schemaClass</th>\n",
       "      <th>last.category</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>31</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>PMAIP1 Gene [nucleoplasm]</td>\n",
       "      <td>EntityWithAccessionedSequence</td>\n",
       "      <td>&lt;NA&gt;</td>\n",
       "      <td>46</td>\n",
       "      <td>26</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>TP53 stimulates PMAIP1 (NOXA) expression</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>...</td>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>E2F1 binds APAF1 gene promoter</td>\n",
       "      <td>Reaction</td>\n",
       "      <td>binding</td>\n",
       "      <td>9</td>\n",
       "      <td>21</td>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "      <td>APAF1 gene expression is stimulated by E2F1 an...</td>\n",
       "      <td>BlackBoxEvent</td>\n",
       "      <td>omitted</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>1 rows × 59 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "   first                   first.id          first.displayName  \\\n",
       "0     31  PMAIP1 Gene [nucleoplasm]  PMAIP1 Gene [nucleoplasm]   \n",
       "\n",
       "               first.schemaClass first.category  e1  n1  \\\n",
       "0  EntityWithAccessionedSequence           <NA>  46  26   \n",
       "\n",
       "                                      n1.id  \\\n",
       "0  TP53 stimulates PMAIP1 (NOXA) expression   \n",
       "\n",
       "                             n1.displayName n1.schemaClass  ...  \\\n",
       "0  TP53 stimulates PMAIP1 (NOXA) expression  BlackBoxEvent  ...   \n",
       "\n",
       "                            n8.id                  n8.displayName  \\\n",
       "0  E2F1 binds APAF1 gene promoter  E2F1 binds APAF1 gene promoter   \n",
       "\n",
       "   n8.schemaClass n8.category e9 last  \\\n",
       "0        Reaction     binding  9   21   \n",
       "\n",
       "                                             last.id  \\\n",
       "0  APAF1 gene expression is stimulated by E2F1 an...   \n",
       "\n",
       "                                    last.displayName  last.schemaClass  \\\n",
       "0  APAF1 gene expression is stimulated by E2F1 an...     BlackBoxEvent   \n",
       "\n",
       "  last.category  \n",
       "0       omitted  \n",
       "\n",
       "[1 rows x 59 columns]"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "****************************************************************************************************\n",
      "10 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "11 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "12 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "13 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "14 hop(s) :\n",
      "\n",
      "No result found\n",
      "****************************************************************************************************\n",
      "CPU times: user 62.3 ms, sys: 2 ms, total: 64.3 ms\n",
      "Wall time: 64.6 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "# Find all paths (with maximum length of 15 hops) between a node of type \"EntityWithAccessionedSequence\" and a node of type \"BlackBoxEvent\"\n",
    "max_hops = 15\n",
    "longest_df = None\n",
    "\n",
    "for hop in range(1, max_hops):\n",
    "    print(100 * \"*\")\n",
    "    print(f\"{hop} hop(s) :\\n\")\n",
    "\n",
    "    query, cols = build_query_chain(\n",
    "        hop_count=hop,\n",
    "        start_node_label=\"EntityWithAccessionedSequence\",\n",
    "        end_node_label=\"BlackBoxEvent\",\n",
    "        return_properties=[\"id\", \"displayName\", \"schemaClass\", \"category\"],\n",
    "    )\n",
    "    #print(query)\n",
    "    \n",
    "    # Use with client\n",
    "    df = client.query(query)\n",
    "    if df.empty:\n",
    "        print(\"No result found\")\n",
    "    else:\n",
    "        df.columns = cols\n",
    "        display(df)\n",
    "        longest_df = df\n",
    "\n",
    "print(100 * \"*\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a5f1017d-b052-41fc-b674-bd41629c537e",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "189ed0fa-3921-440c-b110-2b5599005faf",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "39609f4a-87dd-43e6-a9cc-a87db562b470",
   "metadata": {},
   "source": [
    "# Create subgraph to visualise"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "b6748e2f-161a-4c19-9165-d76ea2feaf19",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "MultiGraph with 10 nodes and 10 edges\n"
     ]
    }
   ],
   "source": [
    "# Get subgraph\n",
    "subset_nodes = longest_df.filter(regex=\"id$\", axis=1).iloc[0].values.tolist()\n",
    "subG = G.subgraph(subset_nodes).copy()\n",
    "print(subG)\n",
    "\n",
    "# Build CREATE command from subgraph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "09a3434e-b575-4f07-accc-b569ecce5305",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "8acf59d5-a985-4325-be49-9c55290398ac",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'reactome3_subgraph'"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "subgraph_name = f\"{graph_name}_subgraph\"\n",
    "subgraph_name"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "9882febc-a0ff-4b56-9f41-1f095629ae08",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Writing subgraph to JSONL...\n",
      "JSONL file written to: /home/ubuntu/.turing/data/reactome3_subgraph.jsonl\n",
      "Graph: 10 nodes, 10 edges\n",
      "\n",
      "Loading JSONL into TuringDB as graph 'reactome3_subgraph' ...\n",
      "\n",
      "✓ Graph 'reactome3_subgraph' created in 0.07 seconds\n",
      "CPU times: user 267 μs, sys: 1.98 ms, total: 2.24 ms\n",
      "Wall time: 68.9 ms\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "start_time = time.time()\n",
    "\n",
    "# Write subgraph to JSONL format\n",
    "print(\"Writing subgraph to JSONL...\")\n",
    "jsonl_filename = networkx_to_jsonl(subG, subgraph_name)\n",
    "\n",
    "# Load JSONL into TuringDB\n",
    "print(f\"\\nLoading JSONL into TuringDB as graph '{subgraph_name}' ...\")\n",
    "client.query(f\"LOAD JSONL '{jsonl_filename}' AS {subgraph_name}\")\n",
    "\n",
    "execution_time = time.time() - start_time\n",
    "print(f\"\\n\\u2713 Graph '{subgraph_name}' created in {execution_time:.2f} seconds\")\n",
    "\n",
    "# Set active graph for querying\n",
    "client.set_graph(subgraph_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ccdc96c7-6aa4-490a-b6ff-7596ee360894",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "4f071193-caf7-46e6-b7a0-d245da522278",
   "metadata": {},
   "source": [
    "<div class=\"alert alert-block alert-info\">\n",
    "    <h2>\n",
    "        You can visualise the subgraph directly in the notebook below.\n",
    "    </h2>\n",
    "</div>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "4920341d-e0b3-4f0e-8d00-a7972b1678d3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Warning: When  cdn_resources is 'local' jupyter notebook has issues displaying graphics on chrome/safari. Use cdn_resources='in_line' or cdn_resources='remote' if you have issues viewing graphics in a notebook.\n",
      "reactome_subgraph.html\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "\n",
       "        <iframe\n",
       "            width=\"100%\"\n",
       "            height=\"750px\"\n",
       "            src=\"reactome_subgraph.html\"\n",
       "            frameborder=\"0\"\n",
       "            allowfullscreen\n",
       "            \n",
       "        ></iframe>\n",
       "        "
      ],
      "text/plain": [
       "<IPython.lib.display.IFrame at 0x7daddc864ad0>"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from pyvis.network import Network\n",
    "import matplotlib.pyplot as plt\n",
    "import matplotlib.colors as mcolors\n",
    "\n",
    "net = Network(\n",
    "    height=\"750px\",\n",
    "    width=\"100%\",\n",
    "    notebook=True,\n",
    "    bgcolor=\"#ffffff\",\n",
    "    font_color=\"#000000\",\n",
    "    directed=True,\n",
    ")\n",
    "\n",
    "# Choose your palette (can be changed easily)\n",
    "palette_name = (\n",
    "    \"Pastel1\"  # Options: 'tab10', 'Set3', 'Paired', 'viridis', 'plasma', etc.\n",
    ")\n",
    "\n",
    "# Get unique node types\n",
    "unique_types = list(set(data.get(\"schemaClass\") for _, data in G.nodes(data=True)))\n",
    "\n",
    "# Get colors from matplotlib palette\n",
    "cmap = plt.get_cmap(palette_name)\n",
    "colors = [\n",
    "    mcolors.rgb2hex(cmap(i / len(unique_types))) for i in range(len(unique_types))\n",
    "]\n",
    "\n",
    "# Map types to colors\n",
    "type_colors = {node_type: colors[i] for i, node_type in enumerate(unique_types)}\n",
    "\n",
    "# Then use in your visualization\n",
    "for node, data in subG.nodes(data=True):\n",
    "    node_type = data.get(\"schemaClass\", \"Unknown\")\n",
    "    color = type_colors.get(node_type, \"#95a5a6\")\n",
    "\n",
    "    net.add_node(\n",
    "        node,\n",
    "        label=data.get(\"displayName\", str(node)),\n",
    "        title=f\"{data.get('displayName', '')}\",\n",
    "        color=color,\n",
    "        size=25,\n",
    "    )\n",
    "\n",
    "for source, target, data in subG.edges(data=True):\n",
    "    net.add_edge(source, target, color=\"#95a5a6\", width=3)\n",
    "\n",
    "net.toggle_physics(status=True)\n",
    "net.show(f\"{example_name}_subgraph.html\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "411c5146-1364-44c4-a624-be2549ef992c",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "71b073f4-312e-4398-9fb9-a89614db5faa",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "339e4e08-96e8-4c86-ac2a-8b2b94abb1a0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "cebe1567-fa94-46ec-a84f-8a8f2c57edb0",
   "metadata": {},
   "source": [
    "# Use LLM to generate Cypher query"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "7fb6883e-7a45-445e-bf5d-cd57f7b0f879",
   "metadata": {},
   "source": [
    "Before running this section, create a `.env` file in the project root with your API keys:\n",
    "\n",
    "```env\n",
    "ANTHROPIC_API_KEY=your_key_here\n",
    "OPENAI_API_KEY=your_key_here\n",
    "MISTRAL_API_KEY=your_key_here"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "dc01c223-c4e4-4623-905a-b208f34a60fe",
   "metadata": {},
   "outputs": [],
   "source": [
    "client.set_graph(graph_name)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "f9f62caf-0b73-4fbf-9639-ba1d8d4ce517",
   "metadata": {},
   "outputs": [],
   "source": [
    "import os\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "# Load environment variables from .env file\n",
    "if not load_dotenv():\n",
    "    raise ValueError(\"LLM credentials not saved in .env file\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "9f732145-fd41-451a-9f39-b57db744f7b4",
   "metadata": {},
   "outputs": [],
   "source": [
    "api_keys = {\n",
    "    \"Anthropic\": os.getenv(\"ANTHROPIC_API_KEY\"),\n",
    "    \"Mistral\": os.getenv(\"MISTRAL_API_KEY\"),\n",
    "    \"OpenAI\": os.getenv(\"OPENAI_API_KEY\"),\n",
    "}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "3a8cfedf-6aa1-4d88-90ae-5e9d89e1f390",
   "metadata": {
    "execution": {
     "iopub.execute_input": "2026-02-20T16:16:46.829087Z",
     "iopub.status.busy": "2026-02-20T16:16:46.828943Z",
     "iopub.status.idle": "2026-02-20T16:16:46.845557Z",
     "shell.execute_reply": "2026-02-20T16:16:46.844973Z"
    }
   },
   "outputs": [],
   "source": [
    "\"\"\"Build system prompt with TuringDB schema and examples\"\"\"\n",
    "\n",
    "turingdb_cypher_system_prompt = \"\"\"\n",
    "You are an expert at converting natural language questions into TuringDB queries.\n",
    "\n",
    "Your task is to generate syntactically correct TuringDB queries based on natural language input.\n",
    "\n",
    "VERY IMPORTANT - YOU MUST FOLLOW THESE REQUESTS - TuringDB Syntax Guidelines:\n",
    "1. Return ONLY the TuringDB query, no explanations or markdown formatting\n",
    "2. Use MATCH, CREATE and WHERE operations only\n",
    "3. Nodes: (n:Label {property = \"value\"}) or (n:Label {property: value})\n",
    "4. Edges: Use DIRECTED syntax with ->\n",
    "5. Pattern matching: MATCH (n)-[e]->(m)\n",
    "6. Property matching: Use = operator for exact matching\n",
    "7. Multiple constraints: (n:Person:Engineer {name = \"John\", age = 30})\n",
    "8. Return all matched entities: RETURN n, e, m or use RETURN * for all\n",
    "9. Filter using WHERE clause: MATCH (n:Person) WHERE n.name = 'John' RETURN n.firstname, n.lastname\n",
    "\n",
    "VERY IMPORTANT - YOU ARE NOT ALLOWED TO USE THE FOLLOWING - FORBIDDEN in TuringDB:\n",
    "- Do NOT use AS aliases\n",
    "- Do NOT use LIMIT, SKIP clauses\n",
    "- Do NOT use WITH clauses\n",
    "- Do NOT use CALL (except for metaqueries)\n",
    "- Do NOT use toLower() or other functions\n",
    "- Do NOT use wildcard character (*)\n",
    "- Do NOT use multi-hops pattern for edges: e.g. `-[e:CONNECTED*1..10]->`\n",
    "- Do NOT use \"end\" or \"s3\" variable name\n",
    "\n",
    "Supported TuringDB Operations:\n",
    "- MATCH queries: MATCH (n:Label)-[e:Type]->(m) RETURN n, m\n",
    "- CREATE queries: CREATE (n:Label{property=\"value\"})-[e:Type]->(m:Label)\n",
    "- Metaqueries: CALL db.propertyTypes(), CALL db.labels(), CALL db.edgeTypes()\n",
    "- Property types: String (\"text\" or `text`), Boolean (true/false), Integer (20), Double (20.5)\n",
    "\n",
    "Examples for few-shot learning:\n",
    "- Find all persons: MATCH (n:Person) RETURN n\n",
    "- Find connections: MATCH (n:Person)-[e]->(m:Person) RETURN n, e, m\n",
    "- Create person: CREATE (n:Person{name=\"John\", age=30})\n",
    "- Match person with specific name: MATCH (p:Person) WHERE p.name = \"John\" RETURN p\n",
    "- Path with 1 hop between Station Paddington and Blackfriars:  MATCH (first:Station{displayName:\"Paddington\"})-[e1:CONNECTED]->(last:Station{displayName=\"Blackfriars\"}) RETURN start, start.displayName, start.Note, e1.Line, last, last.displayName, last.Note\n",
    "- Path with 2 hops between Station Paddington and Blackfriars: MATCH (first:Station{displayName:\"Paddington\"})-[e1:CONNECTED]->(s1:Station)-[e2:CONNECTED]->(last:Station{displayName=\"Blackfriars\"}) RETURN start, start.displayName, start.Note, e1.Line, s1, s1.displayName, s1.Note, e2.Line, last, last.displayName, last.Note\n",
    "- Path with 8 hops between Station Paddington and Blackfriars: MATCH (first:Station{displayName:\"Paddington\"})-[e1:CONNECTED]->(s1:Station)-[e2:CONNECTED]->(s2:Station)-[e3:CONNECTED]->(s3:Station)-[e4:CONNECTED]->(s4:Station)-[e5:CONNECTED]->(s5:Station)-[e6:CONNECTED]->(s6:Station)-[e7:CONNECTED]->(s7:Station)-[e8:CONNECTED]->(last:Station{displayName=\"Blackfriars\"}) RETURN start, start.displayName, start.Note, e1.Line, s1, s1.displayName, s1.Note, e2.Line, s2, s2.displayName, s2.Note, e3.Line, s3, s3.displayName, s3.Note, e4.Line, s4, s4.displayName, s4.Note, e5.Line, s5, s5.displayName, s5.Note, e6.Line, s6, s6.displayName, s6.Note, e7.Line, s7, s7.displayName, s7.Note, e8.Line, last, last.displayName, last.Note\n",
    "- Find all Chinese providers and what they supply: MATCH (n{provider_country:\"CHN\"}) RETURN n, n.provider_name, n.displayName, n.share_provided, n.type\n",
    "- Find all deposition tools and their types: MATCH (specific)-[e:IS_TYPE_OF]->(general:Tool_Resource{displayName:\"Deposition tools\"}) RETURN specific, specific.displayName, specific.provider_name, e, general, general.displayName\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c1f74732-e1cf-4ff8-b08c-1965065b26bc",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "92c324f1-f622-4132-91ef-4bf00af3904d",
   "metadata": {
    "execution": {
     "iopub.execute_input": "2026-02-20T16:16:46.847937Z",
     "iopub.status.busy": "2026-02-20T16:16:46.847806Z",
     "iopub.status.idle": "2026-02-20T16:16:46.868265Z",
     "shell.execute_reply": "2026-02-20T16:16:46.867525Z"
    }
   },
   "outputs": [],
   "source": [
    "# Create system_prompt\n",
    "system_prompt = f\"\"\"\n",
    "TuringDB Cypher prompt :\n",
    "{turingdb_cypher_system_prompt}\n",
    "\n",
    "Here is a sample of nodes from the graph so you know the structure and available properties :\n",
    "{client.query(\"MATCH (n) RETURN n LIMIT 3\")}\n",
    "\n",
    "Here is the output of \"CALL LABELS ()\" command, showing the different node types of the graph :\n",
    "{client.query(\"CALL db.labels()\")}\n",
    "\n",
    "Here is also the output of \"CALL EDGETYPES ()\" command, showing the different edge types of the graph :\n",
    "{client.query(\"CALL db.edgeTypes()\")}\n",
    "\n",
    "Very important :\n",
    "- You MUST follow current TuringDB Syntax Guidelines\n",
    "- You MUST NOT USE what is FORBIDDEN in TuringDB\n",
    "- By default, RETURN ALL THE MATCHED NODES AND EDGES AND THEIR PROPERTIES in the RETURN section (except contrary demand from user)\n",
    "- Use the correct node and edge properties name in the MATCH section.\n",
    "- Use the correct node and edge properties name in the RETURN section.\n",
    "- Pay attention to which properties come from nodes or edges, to create a functioning query\n",
    "- Pay attention to lower and uppercases in properties\n",
    "- If some properties contain spaces, be careful to wrap them\n",
    "\n",
    "Give me the query FOLLOWING TURINGDB GUIDELINES AND NOT USING WHAT IS FORBIDDEN for this specific question :\n",
    "\"\"\"\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "4c4c457d-1b0a-4089-99ac-0a2627389336",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "26882b58-7f47-496b-92d2-27e7ce2ad893",
   "metadata": {},
   "outputs": [],
   "source": [
    "\"\"\"Build system prompt with TuringDB schema and examples\"\"\"\n",
    "\n",
    "turingdb_cypher_system_prompt = \"\"\"\n",
    "You are an expert at converting natural language questions into TuringDB queries.\n",
    "\n",
    "Your task is to generate syntactically correct TuringDB queries based on natural language input.\n",
    "\n",
    "VERY IMPORTANT - YOU MUST FOLLOW THESE REQUESTS - TuringDB Syntax Guidelines:\n",
    "1. Return ONLY the TuringDB query, no explanations or markdown formatting\n",
    "2. Use MATCH, CREATE and WHERE operations only\n",
    "3. Nodes: (n:Label {property: value})\n",
    "4. Edges: Use DIRECTED syntax with ->\n",
    "5. Pattern matching: MATCH (n)-[e]->(m)\n",
    "6. Property matching: Use : operator for exact matching\n",
    "7. Multiple constraints: (n:Person:Engineer {name: \"John\", age: 30})\n",
    "8. Return all matched entities: RETURN n, e, m or use RETURN * for all\n",
    "9. Filter using WHERE clause: MATCH (n:Person) WHERE n.name = 'John' RETURN n.firstname, n.lastname\n",
    "\n",
    "VERY IMPORTANT - YOU ARE NOT ALLOWED TO USE THE FOLLOWING - FORBIDDEN in TuringDB:\n",
    "- Do NOT use AS aliases\n",
    "- Do NOT use LIMIT, SKIP clauses\n",
    "- Do NOT use WITH clauses\n",
    "- Do NOT use CALL (except for metaqueries)\n",
    "- Do NOT use toLower() or other functions\n",
    "- Do NOT use wildcard character (*)\n",
    "- Do NOT use multi-hops pattern for edges: e.g. `-[e:CONNECTED*1..10]->`\n",
    "- Do NOT use \"end\" or \"s3\" variable name\n",
    "\n",
    "Supported TuringDB Operations:\n",
    "- MATCH queries: MATCH (n:Label)-[e:Type]->(m) RETURN n, m\n",
    "- CREATE queries: CREATE (n:Label{property:\"value\"})-[e:Type]->(m:Label)\n",
    "- Metaqueries: CALL db.propertyTypes(), CALL db.labels(), CALL db.edgeTypes()\n",
    "- Property types: String (\"text\" or `text`), Boolean (true/false), Integer (20), Double (20.5)\n",
    "\n",
    "Examples for few-shot learning:\n",
    "- Find all persons: MATCH (n:Person) RETURN n\n",
    "- Find connections: MATCH (n:Person)-[e]->(m:Person) RETURN n, e, m\n",
    "- Create person: CREATE (n:Person {name: \"John\", age: 30})\n",
    "- Match person with specific name: MATCH (p:Person) WHERE p.name = \"John\" RETURN p\n",
    "- Path with 1 hop between Station Paddington and Blackfriars:  MATCH (departure:Station{displayName:\"Paddington\"})-[c1:CONNECTED]->(arrival:Station{displayName:\"Blackfriars\"}) RETURN start, start.displayName, start.Note, ec.Line, last, last.displayName, last.Note\n",
    "- Path with 2 hops between Station Paddington and Blackfriars: MATCH (departure:Station{displayName:\"Paddington\"})-[c1:CONNECTED]->(st1:Station)-[c2:CONNECTED]->(arrival:Station{displayName:\"Blackfriars\"}) RETURN start, start.displayName, start.Note, c1.Line, s1, s1.displayName, s1.Note, c2.Line, last, last.displayName, last.Note\n",
    "- Path with 8 hops between Station Paddington and Blackfriars: MATCH (departure:Station{displayName:\"Paddington\"})-[c1:CONNECTED]->(st1:Station)-[c2:CONNECTED]->(st2:Station)-[c3:CONNECTED]->(st3:Station)-[c4:CONNECTED]->(st4:Station)-[c5:CONNECTED]->(st5:Station)-[c6:CONNECTED]->(st6:Station)-[c7:CONNECTED]->(st7:Station)-[c8:CONNECTED]->(arrival:Station{displayName:\"Blackfriars\"}) RETURN start, start.displayName, start.Note, c1.Line, st1, st1.displayName, st1.Note, c2.Line, st2, st2.displayName, st2.Note, c3.Line, st3, st3.displayName, st3.Note, c4.Line, st4, st4.displayName, st4.Note, c5.Line, st5, st5.displayName, st5.Note, c6.Line, st6, st6.displayName, st6.Note, c7.Line, st7, st7.displayName, st7.Note, c8.Line, last, last.displayName, last.Note\n",
    "- Find all Chinese providers and what they supply: MATCH (n{provider_country:\"CHN\"}) RETURN n, n.provider_name, n.displayName, n.share_provided, n.type\n",
    "- Find all deposition tools and their types: MATCH (specific)-[e:IS_TYPE_OF]->(general:Tool_Resource{displayName:\"Deposition tools\"}) RETURN specific, specific.displayName, specific.provider_name, e, general, general.displayName\n",
    "\n",
    "## SCHEMA CONTEXT\n",
    "{schema_context}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "id": "bd46508f-cd64-4482-a315-3ea0c7d1d3d2",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Build schema context for LLM\n",
    "labels_result = client.query(\"CALL db.labels()\")\n",
    "rel_types_result = client.query(\"CALL db.edgeTypes()\")\n",
    "prop_types_result = client.query(\"CALL db.propertyTypes()\")\n",
    "query_sample_nodes = \"MATCH (n) RETURN \" + \", \".join([f\"n.`{prop}`\" for prop in prop_types_result[\"propertyType\"].tolist()]) + \"LIMIT 3\"\n",
    "sample_nodes = client.query(query_sample_nodes)\n",
    "\n",
    "schema_context = f\"\"\"Node labels: {labels_result}\n",
    "Relationship types: {rel_types_result}\n",
    "Property names and types: {prop_types_result}\n",
    "Sample nodes: {sample_nodes}\"\"\"\n",
    "\n",
    "system_prompt = turingdb_cypher_system_prompt.replace(\"{schema_context}\", schema_context)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ceeb1b77-33ce-447c-b0b8-edd1d8728cef",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8d378c8d-8ff7-4c3f-83c9-6b97258f6658",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "18aa749e-0411-4311-8832-6cee3628ccc4",
   "metadata": {},
   "outputs": [],
   "source": [
    "question = \"\"\"\n",
    "Is there a path of any size linking gene PMAIP1 and gene E2F1 ?\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "457cb58e-7bfb-458b-bee4-cd314298df08",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "bc3f9afa-128f-4727-b784-180ac24a7087",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "cypher_query : MATCH (gene1:EntityWithAccessionedSequence {name: \"PMAIP1\"})-[e:CONNECTED]-(gene2:EntityWithAccessionedSequence {name: \"E2F1\"}) RETURN gene1, e, gene2\n",
      "CPU times: user 385 ms, sys: 52.7 ms, total: 438 ms\n",
      "Wall time: 4.16 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "provider = \"OpenAI\"\n",
    "\n",
    "cypher_query = natural_language_to_cypher(\n",
    "    question=question,\n",
    "    system_prompt=system_prompt,\n",
    "    provider=provider,\n",
    "    api_key=api_keys[provider],\n",
    "    temperature=0.0,\n",
    ")\n",
    "print(f\"cypher_query : {cypher_query}\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "848bb899-5874-4562-a0c0-dd6c49e2eb26",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "--> No result found\n",
      "\n"
     ]
    }
   ],
   "source": [
    "df_path = client.query(cypher_query)\n",
    "if df_path.empty:\n",
    "    print(\"--> No result found\\n\")\n",
    "else:\n",
    "    display(df_path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d7d91506-60fa-494d-965e-2f88add2e9c6",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cc3b5ea3-81ad-4f60-8969-bea2c1cb65d5",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "6d8564f0-4418-4868-9a9b-e9e998947a79",
   "metadata": {},
   "source": [
    "# Use LLM to get subgraph summary"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "id": "edbe8085-c266-4dad-986b-2ed38100a14d",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "CPU times: user 7.49 ms, sys: 1.98 ms, total: 9.46 ms\n",
      "Wall time: 30.6 s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "\n",
    "prompt = f\"\"\"\n",
    "Give me a summary of this graph. It represents biological entities, tell me more about the entities involved and the interactions.\n",
    "Here is the graph :\n",
    "{G.nodes(data=True)} {G.edges(data=True)}\n",
    "\"\"\"\n",
    "\n",
    "system_prompt = \"\"\"\n",
    "You are a specialist in analysing graphs and their structure.\n",
    "You will use your knowledge to add more information about the entities and relationships in the graph.\n",
    "Add information only when you are sure it is relevant.\n",
    "\"\"\"\n",
    "\n",
    "provider = \"OpenAI\"\n",
    "\n",
    "response = query_llm(\n",
    "    prompt=prompt,\n",
    "    system_prompt=system_prompt,\n",
    "    provider=provider,\n",
    "    api_key=api_keys[provider],\n",
    "    temperature=0.0,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "id": "32bb06da-51ec-4e3b-b688-9c06b2a602fa",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/markdown": [
       "The graph represents a complex network of interactions involving various biological entities primarily related to apoptosis and gene regulation in *Homo sapiens*. Here’s a summary of the key entities and their interactions:\n",
       "\n",
       "### Key Entities:\n",
       "1. **TP53 (Tumor Protein p53)**: A crucial tumor suppressor protein that regulates the cell cycle and functions in preventing cancer. It binds to the promoters of various genes, including PMAIP1 and APAF1, to stimulate their expression.\n",
       "   - **p-S15,S20-TP53 Tetramer**: A phosphorylated form of TP53 that is active in the nucleoplasm and involved in gene regulation.\n",
       "\n",
       "2. **PMAIP1 (NOXA)**: A pro-apoptotic gene that is regulated by TP53. Its expression is crucial for apoptosis, particularly in response to cellular stress.\n",
       "   - **PMAIP1 Gene**: The DNA sequence that encodes the PMAIP1 protein.\n",
       "\n",
       "3. **APAF1 (Apoptotic Protease Activating Factor 1)**: A protein that plays a key role in the apoptosome formation, which is essential for the activation of caspases during apoptosis.\n",
       "   - **APAF1 Gene**: The gene encoding the APAF1 protein.\n",
       "\n",
       "4. **CYCS (Cytochrome c)**: A protein involved in the electron transport chain and apoptosis. It is released from mitochondria during apoptosis and interacts with APAF1 to promote apoptosome formation.\n",
       "\n",
       "5. **E2F1**: A transcription factor that regulates the expression of genes involved in cell cycle progression and apoptosis. It binds to the promoters of PMAIP1 and APAF1, stimulating their expression.\n",
       "\n",
       "6. **NRF1 (Nuclear Respiratory Factor 1)**: A transcription factor that regulates the expression of genes involved in mitochondrial biogenesis and function, including CYCS.\n",
       "\n",
       "7. **PPARGC1A (Peroxisome Proliferator-Activated Receptor Gamma Coactivator 1-alpha)**: A coactivator that regulates genes involved in energy metabolism and mitochondrial biogenesis.\n",
       "\n",
       "8. **ESRRA (Estrogen-Related Receptor Alpha)**: A transcription factor that regulates various genes, including those involved in energy metabolism.\n",
       "\n",
       "### Key Interactions:\n",
       "- **TP53 Binding**: TP53 binds to the promoters of PMAIP1 and APAF1, stimulating their expression, which is critical for apoptosis.\n",
       "- **Complex Formation**: The p-S15,S20-TP53 tetramer forms complexes with PMAIP1 and other regulatory proteins, enhancing gene expression.\n",
       "- **CYCS and APAF1 Interaction**: Cytochrome c binds to APAF1, leading to the release of cytochrome c from mitochondria, a key step in the apoptotic pathway.\n",
       "- **E2F1 Regulation**: E2F1 binds to the promoters of PMAIP1 and APAF1, promoting their transcription, and is involved in positive regulation of gene expression.\n",
       "- **NRF1 and CYCS**: NRF1 binds to the CYCS promoter, regulating its expression, which is essential for mitochondrial function and apoptosis.\n",
       "- **Positive Regulation**: Various complexes, including those involving ESRRA and PPARGC1A, positively regulate the expression of genes involved in apoptosis and mitochondrial function.\n",
       "\n",
       "### Conclusion:\n",
       "The graph illustrates a network of interactions that highlight the regulatory roles of TP53, E2F1, and NRF1 in apoptosis and gene expression. The interplay between these proteins and their target genes is crucial for maintaining cellular homeostasis and responding to stress signals, ultimately influencing cell fate decisions such as survival or apoptosis."
      ],
      "text/plain": [
       "<IPython.core.display.Markdown object>"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "display(Markdown(response))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7635bb0f-031c-4401-9978-6eff01dad2b5",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "578ee33c-5d1c-45fa-9f40-c66fd2ce25f0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "76b947cf-d996-433d-a6b6-c1e00ebb6fa6",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "cfea1ab5-f1d5-4235-8c00-75ae7ca0e5fe",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Notebook finished !\n"
     ]
    }
   ],
   "source": [
    "print(\"Notebook finished !\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "ff261309-7eec-4bae-97b1-23044924feaa",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c3ee45c1-6fed-4d2c-9b5f-c9e2435cb52b",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bc245f10-cd1f-4de7-8e6d-6e7b53489c42",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.13.12"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
